{"title":"Key Lessons From Cryptine Network’s Failure*","lang":"en","tags":[],"image":null,"videos":[],"text":"Several weeks ago Cryptine Networks failed as a security software startup. While this has been a frustrating and painful experience it has taught me valuable lessons about corporate structure and stock vesting that I feel compelled to share with other early-stage entrepreneurs.\n\nCryptine Networks was incorporated with in early 2002 with essentially a do-it-yourself-kit to be an IT security consulting firm.Incorporation on the cheap was fine at the time because Cryptine was a lifestyle business and the primary purposes of incorporation were tax shielding and the reduction of personal liabilities.I joined the team over the summer of 2003 and after working with Cryptine for about a year we realized there was an opportunity to automate many of the security services were delivering by hand with software.In December of 2004 we brought on our first two software developers and began working on the project.\n\nOver the next 10 months our software development took several twists but it was clear that we were on to something.It also became increasingly clear that while the consulting revenue had been supporting the software development, these were two separate businesses and that capital would be allocated more efficiently by separating them.Thus, in October of 2005 we sold our consulting assets to Helio Solutions, which amounted to a small seed investment and allowed the remaining team members to focus exclusively on software development.Yet, the sale to Helio Solutions represented a major change to Cryptine Networks structure and team, which ultimately led to our recent failure.\n\nBetween October of 2005 and May of 2006 we made significant strides in our software development and were ready to release our first product this summer.Also, we had put together a list of 12 beta partners that included 3 publicly listed companies (two of which were in the Fortune 1000) and 2 additional very famous/recognizable/influential brands with in the high-tech community.Furthermore, we had just recently received our first purchase order and while it wasn’t a huge check, it was a compelling demonstration that our customer/beta traction was leading somewhere.As I’ve mentioned before, customer traction is a great way to get investor’s attention.As such, we had 3 institutional investors following up with us (but to be fair no term sheets yet) and we had 3 angel investors who had also expressed an interest in investing if a round came together.Suffice it to say that it looked like things were about to get pretty interesting.\n\nHowever, as investors became more interested it was clear that we need to rework Cryptine Networks structure and equity distribution from that of a lifestyle business to something venture fundable.Unfortunately, this became a struggle between the team members who left Cryptine when we sold our consulting assets to Helio Solutions and those that continued to work on the software development project.\n\nAt the time of the sale, we had a discussion about the leaving founders giving back ownership and control to be redistributed amongst the current team members, future employees and (hopefully) the next investors.It was clear that we weren’t going get anything done at that time but it was just days after the sale and it was hard for both sides to see that what if any role the former founders would play in the software business.In part wanting to avoid the difficult negotiation and somewhat blinded by the optimism surrounding the Helio sale, I made the major mistake of coming to the following agreement.We agreed that the goal was to create a capitalization table that allow Cryptine to be venture fundable but we couldn’t agree on exactly what the appropriate numbers were for founders who were leaving the company at such an early-stage.Thus, we decided the leaving founders would retain X% of company ownership but with the understanding that the next investor would cram them down and that they wouldn’t endanger the financing by fighting the dilution too hard.\n\nThis agreement allowed Cryptine to move forward but it was a huge mistake on my part for two primary reasons.First, cramming a founder down is difficult and can have legal ramifications.No investor had any interested in doing my dirty work and our expectation that they would was a healthy dose of wishful thinking.Second, the longer that we waited to finalize the agreement the harder it became.This was bad psychology on my part because the longer our resting agreement was in place the more it felt like a final agreement to the leaving party and the more entrenched they became.While on the other side of the fence those still at the company felt it was increasingly obvious that those leaving were no longer contributing to the software project.In essence both parties dug their heels in a little bit deeper each day and unfortunately we wound up concluding that it was not possible to move forward with an agreement about equity redistribution.\n\nEveryone involved in this decision was highly intelligent and rational but ultimately shutting down Cryptine Networks was a totally irrational decision that benefited no one, which highlights a second problem.Cryptine’s do-it-yourself incorporation did not create an efficient board of directors so there were no outsiders to add objectivity to the negotiation and the board couldn’t break the deadlock.\n\nSome suggested using the highly aggressive tactic of simply issuing more shares to dilute the leaving founders to more appropriate levels.I don’t know if I would recommend this course of action to because share holders rights are highly protected, which can cause legal problems down the road.Furthermore, it is a bridge burning tactic and I try to avoid burning bridges unless it is truly a last resort.Yet, regardless of my own reluctance the threat of forced dilution would have provided leverage in the negotiation and might have led to a different outcome. However, forced dilution wasn’t an option because our board of directors was deadlocked.If we had created our corporate structure with the guidance of an experienced corporate attorney s/he would have seen this problem coming a mile a way, which would have kept more options open and possibly saved the company.\n\nI believe there are two key lessons to be learned from Cryptine Network’s demise.First, all stock should be on a vesting schedule from day one.Equity is a key resource for startups.Equity is used to attract capital and is a major part of employee compensation packages.Thus, it is very important that startups are as efficient with their equity distribution as they are with their capital.Stocked owned by anyone who isn’t contributing to the companies success represents dead weight, which means there is less in the pot to attract new investors and team members.\n\nNo matter how close of friends, how much you trust each other or how good your intentions are money comes between people and everyone over estimates their own contributions.Furthermore, founders become highly emotional about their companies.Thus, the process of negotiating taking back stock from founders is not rational and inherently very difficult.However, vesting schedules reduce the difficult negotiation to simply and mechanically exercising the companies pre-agreed right to repurchase stock at the price it was issued.I foolishly let myself fall into the “it won’t happen to me” trap but no startup gets it right on the first try and theses hiccups often lead to changes in the team.Believing that any startup won’t have to deal with stock vesting issues is totally unrealistic.\n\nTypical startup vesting schedules last 36-48 months and include a 12 month cliff.The cliff represents the period of time which the person must work for the company in order to leave with any ownership and the vesting schedule represents what percentage of stock the company can buy back at the time of departure.For example on a 48 month vesting schedule with a 12 month cliff, if an employee is offered 1000 shares but leaves in the first 12 months they don’t keep any equity.However, if they leave after 26 months they get to keep 26/48 of the equity promised or 542 or the 1000 shares.Key team members leaving will always be difficult but using a vesting schedule can make one acrimonious aspect of their departure much easier.\n\nThe second key lesson is that boards are most effective when they have 3 or 5 voting members and include at least one objective outsider to break any deadlocks.Early-stage startups are probably better suited with 3 directors than 5 so that the entrepreneur(s) can focus on building their company without getting bogged down managing their boards.My experience suggests that 3 is a good number even for bootstrapped companies that haven’t yet raised capital.Upon raising capital the investor will likely want a board seat so one of the board members needs to be ready to resign. In fact, it is a good idea to get an undated, pre-signed letter of resignation that says something like…\n\n“Due to the XYZ Corp’s recent financing, I will be resigning in order for the new investor to take my seat.”…from the departing board member to ensure that everyone is on the same page and smooth the transition.\n\nFor myself and everyone involved, Cryptine Networks will always be a painful memory for having come so close and failed under seemingly preventable circumstances.At a minimum, given the salaries forgone, time, blood, sweat and tears that we all invested in Cryptine, everyone would have been better off, even with the same outcome, if we had come to these conclusions the day we sold our consulting assets.\n\n*I am not a lawyer and none of this posting is legal advice.If you are seeking legal advice about startup issues I recommend speaking with Fred GregurasBarry CarrGreg Pickrell"}