{"title":"Salorix, Bangalore based data analytics startup, that said no to Google search shuts operations","favicon":"/favicon.ico","description":"BANGALORE: A Bangalore company that spurned an acquisition offer from Google downed shutters last May as a result of a row between its founder and investors who were keen that Santanu Bhattacharya","keywords":"news","lang":"en","canonicalLink":"http://articles.economictimes.indiatimes.com/2014-03-04/news/47894914_1_data-analytics-startups-bangalore-company","tags":["Warren Buffett","united states","product","premium","piracy","Nexus Venture Partners","net worth","National Aeronautics and Space Administration","NASA","M&A","Krishnan Ganesh","insurance","Insurability","Facebook","endorsements","DeepMind Technologies","Berkshire Hathaway","United States"],"image":"http://economictimes.indiatimes.com/photo/31367333.cms","videos":[],"text":"Salorix, a data analytics company, was approached twice by Google — first in 2012 and again in January 2013 — but Bhattacharya was not impressed by the offers, ET learns by piecing together accounts that are only now trickling out.\n\nBANGALORE: A Bangalore company that spurned an acquisition offer from Google downed shutters last May as a result of a row between its founder and investors who were keen that Santanu Bhattacharya accept the internet giant's overture.\n\nThe investors were strongly in favour of a deal because they thought they saw an attractive offer. But when they found that Bhattacharya was not budging, they put a stop to further funding, precipitating a crisis and the eventual closure of the company.\n\nThe investors, Nexus Venture Partners and Inventus Capital, declined to comment. Founded in 2009 by former NASA scientist and IIT Bombay alumnus Bhattacharya, Salorix had raised $3.5 million (Rs 21.6 crore at current rates) in 2011.\n\n\"The investors made a recommendation to the founder to take the offer, but he was asking for a higher price and the deal did not go through,\" said a person with direct knowledge of the negotiation, who wanted to remain anonymous. With offices in India and the United States, Salorix had 35 employees when it went under. They had been promised a severance package, including bonus, but they are still waiting for it.\n\nBhattacharya, who is now based in the United States, confirmed the shutdown but declined to provide details. \"It was a great part of my professional experience,\" he wrote in an email. \"Unfortunately, all good things must come to an end and this one did, too.\"\n\nGlobally a surge of acquisitions of data analytics startups has drawn attention to an already hot industry. Last December, Apple bought social data analytics company Topsy for $200 million (Rs 1,200 crore). Google recently outbid Facebook to acquire artificial intelligence and big data company DeepMind Technologies for $400 million (Rs 2,470 crore).\n\nSalorix's story also puts the spotlight on failures among startups. With two new startups coming up every day, experts said that it is obvious that not all will survive. \"Shutting down is like a divorce, it should be done in a more humane way and made less painful,\" said Krishnan Ganesh, a serial entrepreneur who has founded companies such as education provider TutorVista and data analytics company Marketics.\n\n\"It is better to fail fast, than to have a slow death.\" Last month music streaming startup Dhingana shut down citing challenges like piracy. Bangalore-based subscription streaming service startup iStream was forced to down shutters last May after investors declined to provide more capital.\n\nGanesh is of the view unlike in Silicon Valley, people in India are more emotional and need handholding to cope with failure. He also suggested that entrepreneurship networks and industry bodies should set up a support systems to help startups cope with failure, pivot their business model and help laid off employees get a job in other startups.\n\nThose who have tracked Salorix said that the closure was not due to a lack of customers or the absence of a cuttingedge product. The Bangalore-based firm had developed social media analysis technology and an artificial intelligence platform to understand brand impact."}