{"title":"Changing Tune","favicon":"http://cloudfront.extension.fm/favicon.ico","keywords":"news,chrome,tech,music,exfm","lang":"en","tags":[],"image":"https://31.media.tumblr.com/b8fc3de00d7a5dda1817ae28c88bc0b5/tumblr_inline_my4hianwLA1qzohff.png","videos":[],"text":"When we started Exfm four years ago, we had one goal. To help people discover and listen to new music on the web. What started as a Chrome extension quickly grew to a website, iPhone app, Android app, blog widget and API. Along the way we had people from over 200 countries use our apps and more than 50 artists play at our concerts in NYC.\n\nFour years ago the music landscape was very different. Spotify and Rdio didn’t exist in America. There was no Google Music or iTunes Radio. Soundcloud and Bandcamp were just getting started. Today, music flows from all places on the web. It’s easy and affordable to get and it just keeps getting better.\n\nAfter an amazing four years of sweat and tears, we’re ever-so-reluctantly accepting the reality of sustaining the Exfm platform as it exists today. The high costs of processing millions of new songs every month while attempting to keep that data relevant and useable is monumental. The technical challenges are compounded by the litigious nature of the music industry, which means every time we have any meaningful growth, it’s coupled with the immediate attention of the record labels in the form of takedowns and legal emails. Today, subscription services are gaining in popularity and enjoy the blessings of most major labels at a non trivial cost to those companies.\n\nAll this adds up to a very challenging position for a small startup with grand visions to make any real headway. The sad news is that we are no longer going to be able to keep the Exfm website and suite of apps up and running. To ease the transition to another music service, we’ve created an export tool so you won’t lose any of your songs, as well as a new Chrome extension that can run independently of our backend.\n\nWe still want to help create the links between the disparate music blogs and all of the music sites and apps out there. Our new Chrome extension will let you scrobble songs to Last.fm from Soundcloud. You can buy Bandcamp songs you hear on Tumblr. You can discover music on a blog and instantly save it to your Rdio or Spotify playlist. It acts as the glue between these services.\n\nThe new extension is available now. If you don’t have it yet, we hope you install it and give it a try. On January 15, 2014, we will completely remove the ability to love songs and follow people and your data will no longer be accessible. Our website will only offer the Chrome extension for install and our iPhone and Android apps will stop working. Our blog widget will also stop working. We urge you to grab your songs and sites before it’s too late.\n\nOnce you’ve exported your songs you can import them into an awesome new desktop app called Tomahawk which works really well with our new Chrome extension. You call also import all your songs to Rdio using this great website - re/spin.\n\nThis isn’t a full goodbye. We feel the time is right to reassess how we can continue to play a role in the new music landscape. We hope you continue to find us useful in the ever-growing world of music online. We’d love to hear back from you so please leave us comments and let us know your thoughts. Let us know what you think of the new Chrome extension.\n\nThanks for an amazing four years."}