{"title":"Zumbox to Shutter its Operations","lang":"en","canonicalLink":"http://blog.infotrends.com/?p=14891","tags":["digital mailbox","digital postal mail","Zumbox"],"image":null,"videos":[],"text":"As of next Monday, April 14th, Zumbox will be shuttering its operations. Here is the email that many of its users received today:\n\nWe are sad to announce today that after more than five years of working to revolutionize the way mail is delivered, we have made the very difficult decision to shut down the company. All of us at Zumbox, along with our partners and the mailing community, remain committed to the concept of digital postal mail and have great confidence this capability will one day be the way you receive and manage your postal mail. However, at this point, the time and cost required to deliver on the vision is more than the market is prepared to invest.\n\nAs a result, the Digital Postal Mail site will be taken down shortly. If you wish to export your digital documents, please do so by Monday, April 14, 2014. The username for your account is _______. To export documents, choose Export Your Mail from the Settings menu within your account.\n\nThank you for supporting Digital Postal Mail.\n\nI have been writing about Zumbox since my 2010 study on the future of electronic bill presentment & payment. I got to know their team well as a result of subsequent studies on the digital mailbox services market, three presentations to their advisory board, and my broader coverage of the customer communications market.\n\nWhat Zumbox and other digital mailbox services are trying to achieve in a market as fragmented as the U.S. is extremely difficult and it is unlikely that any are profitable today. Consumers will not use the service without relevant business content (unless there is a chance to win $1M), and businesses will not partner unless the service has consumers. Without the governmental support–or mandates–that some services outside of the U.S. benefit from, digital mailbox services are tasked with building their own traction…often by scraping the content from business websites. Some have executed this task better than others, while still others never even made it to market.\n\nConsequently, we have seen a market shift in the last 12 months that places more emphasis on supporting existing consumer destinations–banks, financial institutions, email providers, e-commerce websites, and cloud storage services. By meeting consumers at digital locations they already frequent, it is solving the first part of the equation. Maybe someday we will see the Zumbox technology platform find a home within one of these companies.\n\nUnfortunately for now, Zumbox cannot deliver on its promise of “forever, for free.” But that is a topic for another blog post.\n\nWishing the Zumbox team all the best in their next endeavors…"}