{"title":"Why Wesabe Lost to Mint","description":"A number of people have asked and speculated about why the company I co-founded, Wesabe, shut down earlier this summer. Some of the claims or guesses …","lang":"en","canonicalLink":"http://blog.precipice.org/why-wesabe-lost-to-mint","tags":[],"image":null,"videos":[],"text":"A number of people have asked and speculated about why the company I co-founded, Wesabe, shut down earlier this summer. Some of the claims or guesses about it are just factually wrong; others seem misinformed to me; others seem to have some truth. I thought I’d add my own opinion.  In November 2006, Wesabe launched as a site to help people manage their personal finances. We certainly weren’t the first to try to tackle this problem through a web app, but we were the first of a new wave of companies that came out in the months that followed, characterized but what some would call a Web 2.0 approach to the problem. Like Flickr and del.icio.us, we relied on community and features such as tags; unlike some of the previous attempts, we tried to automatically aggregate and store all of our users’ financial accounts on the web (instead of relying on manual data entry, say, or desktop storage of the data); and most especially, we tried to learn from the accumulated data our users uploaded, and make recommendations for better financial decisions based on that data. If every copy of Quicken started out as a blank spreadsheet, Wesabe tried to accumulate knowledge from users and data that would fill in some of that spreadsheet for you, and point you in the direction of better choices.  Even before we launched, we heard about other people working on similar ideas, and a slew of companies soon launched in our wake. None of them really seemed to get very far, though, and we were considered the leader in online personal finance until September 2007, when Mint launched at, and won, the first TechCrunch 40 conference. From that point forward we were considered in second place at best, and they overshadowed our site and everyone else’s, too. Two years later, Mint was acquired by Intuit, makers of Quicken (and after Mint’s launch, the makers of Quicken Online) for $170 million. A bit less than a year later, Wesabe shut down.  That’s the history; now, some interpretation, with the completely obvious caveat that I am anything but an unbiased observer. I was the first person to start work on Wesabe and formally co-founded the company (as Chief Product Officer) with my high school friend, Jason Knight (who was CEO). I made nearly all of the product decisions myself, and was notorious with Jason and our board as being very hard-headed about those decisions. While I relied on many other people in making product choices, I also hired and managed all of those people, so that group was at the least a reflection of who I thought had the right values and ideas. When Jason had to leave the company due to a family illness, I took over as CEO and led the company without a formal peer for the final two years. All that adds up to me having absolutely no one to blame for Wesabe’s failure but myself, and as a result I can’t now nor could ever be dispassionate in thinking about what happened.  With that in mind, here are what I believe are a number of myths about why Mint won and Wesabe lost:\n\nMint launched first - I hear this surprisingly often; they didn’t. Wesabe launched about 10 months before Mint. More the shame that we didn’t capitalize on that early lead. There’s a lot to be said for not rushing to market, and learning from the mistakes the first entrants make. Shipping a “minimum viable product” immediately and learning from the market directly makes good sense to me, but engaging with and supporting users is anything but free. Observation can be cheaper. Mint (and some others) did well by seeing where we screwed up, and waiting to launch until they had a better approach.\n\nWesabe never made any money - untrue. We started generating revenue in late 2008, a year and a half before we shut down; and ran completely out of invested funds almost nine months before closing the company. (Put another way: we survived solely on revenue from mid-November 2009 until the end of July of this year, when we turned off the site.) Obviously we didn’t make enough to keep us going indefinitely, but we were not far off from supporting a small company indefinitely on revenue.\n\nMint was a better name and had a better design - both of these things are true, but I don’t believe they were primary causes for our company to fail and for Mint to be acquired. Mint’s CEO likes to talk about how ridiculous our name was relative to theirs, but I think the examples of Amazon, Yahoo, eBay, Google, and plenty of others make it plain that even ludicrous names (as all of those were thought to be when the companies launched) can go on to be great brands. Mint’s design, while definitely very appealing and definitely a factor in getting people to trust the company, doesn’t seem to me to be enough to explain the different outcomes, again based on what I’ve seen from other companies (del.icio.us versus Magnolia, eBay versus Amazon Auctions, and now iPhone slipping against Android). Design matters a huge amount, without question, and Mint’s design was exceptional, but if other, stronger forms of lock-in are in place first, design alone can’t win a market, nor can it keep a market.\n\nWesabe wasn’t viral and Mint was - half-true: neither product was. Neither of us bore any resemblance to a typical Silicon Valley success story, with traffic surging up and to the right (YouTube, Twitter, etc). Mint aggressively acquired users by paying for search engine marketing (reportedly spending over $1 for each user), while Wesabe spent almost nothing on marketing; yet in the end we grew at about 1/5th the rate they did. Take a look at Mint’s Compete.com graph today and you’ll see that their traffic dropped substantially for the six months after their acquisition, and has had sawtooth traffic after that. That pattern matches with a decreased and then increased marketing budget, but not with viral growth. Our patterns similarly followed non-scalable curves (influenced primarily by press wins, economic conditions, and sometimes drafting on Mint’s coverage).\n\nThose are what I see as the common beliefs about the outcome of our competition with Mint that I don’t believe were right. Why was there such a difference, then?  I see two primary reasons that, if they had changed before Mint’s launch or had never occurred in the first place, could well have allowed Wesabe to maintain its early lead and remain the leader against Mint’s entry.  First, we chose not to work with Yodlee, but failed to find or make a replacement for them (until too late). Yodlee is a company that provides automatic financial data aggregation as a web service. They screen-scrape bank web sites (that is, read the payee and amount and date by parsing them out of the bank’s web site, writing a custom parser for each bank they support). When we talked to Yodlee in 2006, the company was crumbling, having failed to get acquired and losing executives. They were also very aggressive in negotiation, telling us they would give us six months’ service nearly free and then tell us the final price we’d be charged going forward. Since they had effectively no competitors, we didn’t believe we should tie our company to a single-source provider, especially one in very bad business shape. Mint used Yodlee (at least until they were acquired - I’m not sure what they’re doing now) to automatically get user’s data from bank sites and import them into Mint, and as a result had a much easier user experience getting bank data imported. Wesabe built our own data acquisition system, first using downloadable client programs (partially because that was easier and partially to preserve users’ privacy) and later using a Yodlee-like web interface, but the Yodlee-like version didn’t launch until six months after Mint went live, and even then didn’t really work as a near-complete replacement for some time after.  A good friend argues that our mistake was not using Yodlee in the first place, and maybe – probably – it was. I believe, though, that we could have made that choice as long as we immediately assumed that someone else would eventually sign up with Yodlee, and that we had to be at least as good if not better than what Yodlee provided, however we got there. (PageOnce, for instance, has not used Yodlee, but has grown very significantly in the same time, using a combination of other aggregation methods that were more effective than ours.) Mint’s dependence on Yodlee apparently suppressed their acquisition interest among companies that knew Yodlee well (such as Microsoft, Yahoo, and Google); since we had developed our own technology for aggregation, we didn’t have that particular problem, and in fact had some acquisition interest simply for the aggregator we’d built. We just didn’t build it nearly fast enough. That one mistake (not using or replacing Yodlee before Mint had a chance to launch on Yodlee) was probably enough to kill Wesabe alone.  Second, Mint focused on making the user do almost no work at all, by automatically editing and categorizing their data, reducing the number of fields in their signup form, and giving them immediate gratification as soon as they possibly could; we completely sucked at all of that. Instead, I prioritized trying to build tools that would eventually help people change their financial behavior for the better, which I believed required people to more closely work with and understand their data. My goals may have been (okay, were) noble, but in the end we didn’t help the people I wanted to since the product failed. I was focused on trying to make the usability of editing data as easy and functional as it could be; Mint was focused on making it so you never had to do that at all. Their approach completely kicked our approach’s ass. (To be defensive for just a moment, their data accuracy – how well they automatically edited – was really low, and anyone who looked deeply into their data at Mint, especially in the beginning, was shocked at how inaccurate it was. The point, though, is hardly anyone seems to have looked.)  Between the worse data aggregation method and the much higher amount of work Wesabe made you do, it was far easier to have a good experience on Mint, and that good experience came far more quickly. Everything I’ve mentioned – not being dependent on a single source provider, preserving users’ privacy, helping users actually make positive change in their financial lives – all of those things are great, rational reasons to pursue what we pursued. But none of them matter if the product is harder to use, since most people simply won’t care enough or get enough benefit from long-term features if a shorter-term alternative is available.\n\nI am, of course, enormously sad that Wesabe lost and the company closed. I don’t agree with those who say you should learn from your successes and mostly ignore your failures; nor do I agree with those who obsess over failures for years after (as I have done in the past). I’m hoping that by writing this all out I can offload it from my head and hopefully help inform other people who try to start companies in the future.You’ll hear a lot about why company A won and company B lost in any market, and in my experience, a lot of the theories thrown about – even or especially by the participants – are utter crap. A domain name doesn’t win you a market; launching second or fifth or tenth doesn’t lose you a market. You can’t blame your competitors or your board or the lack of or excess of investment.  Focus on what really matters: making users happy with your product as quickly as you can, and helping them as much as you can after that.  If you do those better than anyone else out there you’ll win.I think in this case, Mint totally won at the first (making users happy quickly), and we both totally failed at the second (actually helping people).  No one, in my view, solved the financial problems of consumers.  No one even got close.  Yes, both products helped some people – ours mostly through a supportive community and theirs mostly through giving people a rough picture of where their money has gone. But when we analyzed the benefits we saw for our users, and when Mint boasted about the benefits they saw for their users, the debt reduction and savings increase numbers directly matched the national averages.  Because our products existed during a deep financial crisis, consumers everywhere cut back, saved more, and tried to reduce their debt. Neither product had any significant impact beyond what the overall economy led people to do anyways.So, yeah. Changing people’s behavior is really hard. No one in this market succeeded at doing so – there is no Google nor Amazon of personal finance. Can you succeed where we failed? Please do – the problems are absolutely huge and the help consumers have is absolutely abysmal. Learn from the above and go help people (after making them immediately happy, first)."}