{"title":"Why we shut NewsTilt down","lang":"en","canonicalLink":"http://blog.paulbiggar.com/archive/why-we-shut-newstilt-down/","tags":["failure","journalism","newslabs","newstilt","startups","ycombinator"],"image":null,"videos":[],"text":"NewsTilt was a YCombinator-backed startup which aimed to provide services to help journalists become entrepreneurs and earn a living off their work online.\r It closed down in July 2010, a total of 8 months after it was founded.\n\nA while back, we announced to our journalists that we shut NewsTilt down, only two months since we launched.\r I think people are interested in why it failed, and there are some interesting lessons in our demise, at least for me.\n\nThis piece focuses on my own view of why it failed, as opposed to answering the questions and comments which appeared following the publication of our announcement by Romenesko.\r I’ll probably take some time in the future to respond to critics in the future, and to get back to those who contacted me for comments.\n\nAs a result, I made a carefully thought out decision to shutdown the company, and return as much money as we had left (about 50%) to the investors.\r Nathan believed the best thing to do would be to pivot our company, and so I agreed to step down to allow him do that.\r After some work, he agreed that it was best to shut it down (hence the email above), and we are currently going through the steps of winding down the company, and returning the remaining money to investors.\n\nFollowing the launch, everything started going to shit, and a huge number of challenges to the success of the company had arisen.\r The biggest of these were the lack of traction from launch, that we had lost the faith of our journalists, and because there were communication issues between Nathan (my co-founder) and me.\r This combination also killed our motivation.\n\nOverall, the most important of these are that Nathan and I had difficulty communicating in a way which would allow us save the company, and that this really drained out motivation.\n\nNone of these problems should have been unassailable, which leads us to why NewsLabs failed as a company:\n\nWe also made some bad technical decisions, such as failing to choose WordPress, and the whole Facebook thing.\r The latter also prevented us from moving journalists to their own domains, instead of being under the NewsTilt banner.\n\nWe also suffered from a lack of technical resources.\r I spent nearly all my time doing CEO things , so Nathan was left to do the technical stuff alone.\r We needed to hire quickly to make up for that, but made a key error with our hiring.\n\nOne reason is that we misprioritized things, where the thing that really really needed to get built right now changed daily.\r Another is that building things take time, and we weren’t just building one product, we were building tons of products to be used in different ways.\r We needed Facebook integration and Twitter integration, to integrate the latest changes from the designer, to automatically admit journalists, and alert the editors upon application, and to actually build the product, to build the social promotion tools, etc, etc, etc.\r Individually each feature might only take between a few hours and a few days each.\r However, they build up very quickly, and soon we had features we promised would be ready weeks ago, still sitting in a low-priority slot on our TODO list.\n\nWe basically over promised what we were going to do for the journalists.\r We showed them a list of things we were going to build quickly, then built things very slowly.\r Our technical ability was going to be our differentiator, but our technology showing was pretty poor.\n\nWe also missed a few opportunities for some traffic.\r We fluffed our TechCrunch launch by having the piece posted before the site was even launched.\r This happened because we were sending out old fashioned press releases in an effort to get old media to cover it, and they needed to go out a day early.\r Old media didn’t cover it, but TechCrunch did, a good 30 hours or so before we actually launched.\r We got 18,000 hits that day, nearly all of whom saw no news, and probably didn’t come back.\n\nWe had pseudo-hired a social media promoter, someone who had gotten bitten by the startup bug, and was interested in community management, social media promotion, etc.\r She was pretty good, way better than me, but was still relatively new at it. What we really needed was someone who knew this stuff inside out , rather than someone who was learning as they went.\n\nWe had no domain experience in promotion, and really had no idea what to do.\r Worse, we had no idea what to tell the journalists to do.\r We struck upon the idea that if we had fifty journalists, and they each cross-promoted each other to their social networks, then over time we would get more and more people to read each others’ content.\r Suffice to say that the journalists were not happy, and didn’t go along with it.\n\nIn retrospect, it was foolish to offer to do promotion for the journalists.\r We should instead have built the tools to help them with promotion, and let them do it themselves.\r We had a couple of ideas of what these would be, but we never built them.\r We felt that we would understand promotion better if we started by doing it ourselves–standard practise for any company–but it sucked up massive amounts of time, and we never got anywhere with it.\n\nOne part of the service we offered was that we would get the journalists traffic.\r Whooops!\r Getting traffic is really really difficult.\r We completely underestimated how difficult it would be, largely because I’d never had a problem with it in the past.\r When I’ve needed to promote some pieces I’ve written, I simply submitted them to Hacker News and Proggit.\r However, that doesn’t generalise in any way.\n\nThe major reason the journalists bailed was that we failed them.\r We didn’t deliver the things that we said we would, and we wasted the content they provided.\n\nI could possibly have fixed this at a certain level by giving a greater role to the editors, but I was very uneasy about having editors in the first place.\r I didn’t want to tell the journalists what to write, and I felt that greater input for the editors would have made each journalist’s brand less individual .\n\nThe fact that we didn’t know anything about our readers’ demographics underscores another problem: I don’t understand news readers.\r I certainly wasn’t one, and I didn’t know many people who really were.\r My customer development had largely consisted of talking to journalists and figuring out what they wanted.\r I never really–despite good intentions on lots of occasions–talked to people who loved news about why they loved it.\r So I was unable to say what was going wrong and why people weren’t sticking around.\n\nIt took a while for me to work out that the first thing I did in the morning to sate my internet addiction wasn’t going to NewsTilt.\r I was still going to Reddit and Hacker News.\r When I did read the pieces, I wasn’t terribly interested in them; they were definitely better than what I read in the paper, but they didn’t trigger the dopamine receptors that made me want more and more, and I didn’t know how to fix it.\n\nThe problem was that I didn’t really know how the journalists should write their pieces, only a vague sense that it was wrong.\r I also didn’t really want to tell them what to write, since they were doing us a favour by writing at all.\r In fact, we actively told them to write what they wanted.\r This could have been fine, if they had taken their cue from their readers.\r But we didn’t really know who the readers were, and there weren’t that many of them anyway.\n\nThe actual content that the journalists wrote wasn’t what we needed either.\r Content on the site was a very high standard, but it tended to be very long pieces.\r Long pieces online are difficult to make a success of, as the online attention span is very low.\n\nWe never made it clear how hard it was going to be to create an online presence, and so when articles went nowhere, there was little motivation to continue.\r Building a brand online is akin to doing a startup – it’ll take five years.\r But we failed to prepare them for this , and we failed to recruit the people with the kind of that kind of dedication to “making it”.\n\nI think it’s important to say that we really failed because of a lack of content.\r But that was a symptom of having the wrong kind of journalists.\r All the problems the journalists faced, not writing enough, their distrust of Facebook, their unwillingness to socially promote their work, would not have been problems for a young journalist eager to make a name for himself.\r If we had the sort of people who gave up everything to succeed at their dreams, these problems could have been blown past.\r But as established successes in their field, it was unreasonable to expect them to make giant changes for uncertain return.\n\nInstead, we got journalists who were already successful in their day jobs, and who already had families and other commitments.\r They were checking out the latest thing in news, not hungry to make something of themselves.\r Why would they be, they already had made something of themselves.\r Unsurprisingly, they didn’t write 18 hours a day, instead just dipping their toes in to try NewsTilt out.\r They applied, and either never started or posted only a small number of articles.\n\nIn hindsight, this may have been a big mistake.\r The kind of writer we actually needed was one that was hungry to succeed.\r Someone who would write five pieces a day, and who wanted nothing more than to be a big-time journalist.\r We needed a young Perez Hilton or Michael Arrington, people who wrote for 18 hours a day in order to make their names.\n\nSomewhat surprisingly, the journalists we picked were too good.\r We made a big deal of only hiring the “best journalists”, something we spent a great deal of time getting right.\r We had a guy with a Pulitzer, one with an Emmy, and overall a great deal of talent writing for us .\n\nSince we weren’t making any money for them, and it appeared to them–correctly–that no-one was even reading their content, there was no earthly reason they would keep writing “for us”.\n\nAs a result, it looked like NewsTilt was trying to be another Huffington Post , that is, a news company to compete with existing news organisations.\r As well as convincing the journalists that they were contributing to us for nothing in return, this had knock-on effects: other venues to which a journalist might sell their news refused to allow the same stories to be posted to NewsTilt.\r This is obviously the right thing to do if you perceive NewsTilt to be a competitor.\r If they had perceived each journalist’s NewsTilt site to essentially be a personal blog, as we perceived it, we wouldn’t have had this problem.\n\nJournalists felt that they were writing for us, instead of writing for themselves, for their own brands.\r How could they feel anything else, since that’s the impression we gave them by the design of newstilt.com.\r The most important part of NewsTilt–that journalists would have their own brands and own domains–got cut from the minimum viable product in order to make launch date .\r It was never re-added because of technical issues with Facebook.\n\nNewsTilt was a news destination website, but we very quickly ran out of news.\r We relied on journalists posting news, and they stopped posting because they largely no longer believed that NewsTilt was good for them.\n\nNewsTilt wasn’t a bad idea, but we certainly faced a ton of problems with it.\r Most of them could be overcome, but its instructive to go through what they were.\n\nGiven the options above, it was pretty clear that closing down NewsLabs was the best option.\n\nYC had consulted and advised us every step of the way.\r When we had co-founder problems, they gracefully refused to take sides.\r When we wanted to make a new product, they advised us not to proceed without co-founders, and that we’d need to move to Silicon Valley to be fair to those co-founders.\r And finally, they didn’t expect a cent back, telling us to give all the money back to our later investors.\r Not once in my whole time at YC did I believe that they valued their investment more than they valued us, and they were OK with us closing down.\r YC is a class act.\n\nThey too favoured shutting down the company down and returning what money we had left .\r They accepted that NewsTilt was not going to work, didn’t like some other ideas we ran past them, and everybody at that point agreed that returning what was left was the best outcome for them.\n\nWe felt a great duty to two great sets of investors who had put up their personal money to finance our idea, even though they both kissed their money goodbye when they invested.\r They had largely invested because we had clicked as people, and we wanted to make sure we did the best thing for them too.\r We still had $20,000 of the original $50,000 they gave us, and we had the option to return that to them.\n\nWe had one employee, but she was working for free, and it now seemed unlikely that we’d be raising the money to pay her.\r Our co-founder relationship would have to end either way, so if we decided to part ways we wouldn’t have been screwing our partner.\r The journalists had already stopped posting, and they and we were not convinced that continuing was the best thing for them.\r The only thing left to consider was the investors.\n\nWhen deciding how to proceed, we had to consider all the people in the company.\n\nHowever, since we weren’t going to work together, whichever one of us stayed needed a new co-founder.\r To be fair to a co-founder, you have to be able to move to Silicon Valley, especially since my product ideas were all for early adopters .\r I couldn’t move to California without my wife, and I couldn’t get a visa that would allow me bring my wife .\r Take into account I’d essentially be starting from scratch, and that I’d been working 14 hour days for 8 months and had no motivation left, and you can see why I’m not sure I’d have made a success of this.\n\nWe each had a few ideas of other products we wanted to make.\r I quite liked the idea of a Heroku for Python, a competitor to Google App Engine.\r I also had a few products that I knew I wanted to use, so this seemed like the best time to make them.\n\nI felt that it was probably possible, though extremely challenging, to make something of NewsTilt or some variation of it.\r When you combine a lack of interest and motivation with that extreme challenge, I think it’s clear that this wasn’t a good idea.\n\nOur motivation was sapped from not working well together, and so our ability to be optimistic was pretty sapped too, especially since one of us would be leaving.\r Working on NewsTilt had never been the fun that startups are supposed to be , and the stress was not being counterbalanced by anything positive.\r We also weren’t all that into news and journalism, so our desire to keep pushing the “mission” was extremely low.\n\nWell, maybe.\r This assumes we could find a CEO, and that we hadn’t burnt our journalist bridges.\r It assumes that we could find anyone to give us more money, especially since we launched once and got no traction at all .\r It assumes that we could do something with the first two journalists, especially considering making them money would be very difficult for the first year at least, probably longer, so we’d probably have to pay them ourselves.\n\nWe’d need more money, but the new CEO could handle that.\r We’d need more tech, but the new money could fix that, and whichever one of us stayed would make it happen.\r Everything could be fixed.\n\nPresumably most other things could be fixed.\r We could shut down NewsTilt for a few weeks or months while we fixed everything, focusing instead on the personal sites of one or two journalists who were dedicated to making it big .\r We’d fix our technical mistakes, build the tools we really needed, and relaunch later in the year to take in another 10 journalists.\r Over the next two years, we’d expand to 1000 journalists, and to 10000 over the next five years.\r At some point, we’d reopen NewsTilt as a news aggregator, when it actually made sense, instead of when we were too small to do anything valuable with it.\n\nThe second flaw was that Nathan and I hadn’t been working well together since about February.\r There probably isn’t any blame to be apportioned, except that we should have tried working together on something before building a company together.\r So one or the other of us should probably leave the company.\n\nNewsTilt was definitely a good idea, just one that we hadn’t executed well on.\r The major flaw was that we couldn’t promote the stories well enough, and the journalists’ stories went into a black hole where no-one read them.\r The clear way to fix this would be to hire someone who knew what they were doing in this regard.\r We had a couple of people in mind who possibly could be brought in, and if it required stepping down as CEO so be it .\n\nI realised this when I found myself reluctant to suggest that people visit the site.\r Journalists were still excited by the concept, readers wanted to check it out, but I realised that I didn’t believe that NewsTilt was a good product for either set of our customers.\n\nAs a result of the errors above, we managed to alienate our journalists.\r By the time we ran out of content, it was already too late.\r The journalists were disillusioned and unhappy, and we did not have a product to prevent that.\n\nOne of the things we did right at the start was that the journalists trusted us.\r They may not have trusted us to do everything right or to be successful, but they felt we would do right by them.\r There are some companies who could probably try to replicate this model and not succeed because they wouldn’t be trusted by the journalists; Demand Media for example.\r AOL is still tinged in the scent of the content mill, but they’ve hired cleverly and are probably capable of pulling it off.\r Google has shown it is able to operate transparently and somewhat benevolently, but lots of people don’t trust it.\n\nGoogle could have made this work.\r I believe that if Google applied the same model they could probably succeed.\r They have the tech ability, they have the traffic, and they already have a massive news property.\r They also have have a big problem with whiny news organisation, and an elegant solution would be to kill them off by enfranchising their journalists to be their own bosses.\n\nIt also needs to ability to build great tech very quickly, and lots of it.\r There were tons of things we were dying to innovate on that media companies are still doing very badly, but we hadn’t the money to make them happen quickly enough.\n\nThe biggest thing it needs is a shit-ton of traffic, and that is not easy to bootstrap.\r Perhaps that’s why bootstrapped technology startups haven’t been very successful in media, and why most of the inroads into content startups have come from people with more money, ability to create traffic, or both: Demand Media, True/Slant , AOL’s Seed.com, or Pierre Omidyar’s Honolulu Civil Beat.\n\nDespite everything that went wrong, I’m pretty sure that what we set out to do can be accomplished, though perhaps not by us.\r It is certainly the product that journalists want, but simply one we were unable to deliver.\n\nPersonally, I’ve learned so much from working on NewsLabs.\r The largest, for me anyway, was that before I started I still had a bit of that shyness that lots of geeks have; doing the CEO job quickly cures you of that.\r I don’t want anyone to come away from this essay with the idea that they shouldn’t do a startup because it might fail.\r Mine failed, and I still learned more and improved myself more than I probably could have in any other way.\n\nWe did OK on the business side.\r We got into YC, and we ditched out first idea which was going nowhere fast.\r Between demo day and me going back to Ireland, 7 days, we managed to raise $50K from two small angels.\r I had a five minute video interview in the Wall Street Journal, which is going on my resume next to my Google Tech Talk.\r And when the chips were down, we somewhat bravely  decided to shut down, saving time and money for our unpaid employee, ourselves, the journalists, and investors.\n\nSimilarly, we got about 150 journalists to sign up to take part.\r Of those, 27 actually wrote something on the site.\r That’s no small number, and I was delighted in achieving that.\r We also launched, which is a lot more than many startups.\n\nWe were able to convince editors to come on board, and even to lend their names to the enterprise.\r Doug, Les and Jon helped NewsTilt no end, and I am very grateful to them.\r But they got behind us because they believed in the mission, and they believed in us, and getting this right was important early on.\n\nThe thing that the journalists wanted was to be in control of their own destinies.\r They don’t like how their newspapers are essentially fucking up their lives and possibly their pensions, and they don’t like the content mill alternatives.\r They really loved the model that we only made money if they did, and that a 20% cut was the way to go about it.\n\nFor a start, we developed an idea that people wanted.\r I spoke to lots of journalists and came up with an idea that they were really interested in.\r Then I talked to more and more of them, developing the idea until it was something that lots of people got behind.\r To a certain extent, this was easier as an outsider looking in.\r We didn’t really know what the problem was with the industry, so we instead looked at what people wanted, and we really nailed the customer development aspect of this, at least initially.\n\nSo far, I’ve tried to present why we failed, which focuses on our mistakes and is by definition pretty bleak.\r But we did lots of things right too.\n\nI’ve made a list of what I’ve personally learnt from working on NewsLabs.\r Not every one of these will generalise, but I hope my mistakes are instructive for other founders.\n\nIn no particular order:\n\nLesson: Deeply care about what you’re working on\n\nI think it’s fair to say we didn’t really care about journalism.\r We started by building a commenting product which came from my desire for the perfect commenting system for my blog .\r This turned into designing the best damn commenting system ever, which led to figuring out an ideal customer: newspapers.\r While there, we figured they were never going to buy, and we figured out a product that people were dying to use if it existed.\n\nBut we didn’t really care about journalism, and weren’t even avid news readers.\r If the first thing we did every day was go to news.bbc.co.uk, we should have been making this product.\r But even when we had NewsTilt, it wasn’t my go-to place to be entertained, that was still Hacker News and Reddit.\r And how could we build a product that we were only interested in from a business perspective.\n\nThis compounded when we didn’t really know anything about the industry, or what readers wanted.\n\nOne of the reasons that switching to domains was cut from our MVP was that it didn’t work with our Facebook integration.\r I was married to this idea that Facebook integration was really important.\r It was the only way that we would allow people to comment, because it forced them to use their real names.\r This would mean high quality comments, and great community interaction, and I was convinced that this was essential for our success.\n\nAnd we could only get real names by making everybody use Facebook to sign in.\r Absolutely everybody worried about this, but I was convinced.\r I was totally wrong.\r It alienated people who didn’t like Facebook, including some of our journalists.\r Worse, it caused people to just not comment, meaning they didn’t come back, they didn’t engage with the journalists, and they didn’t start to frequent the site.\n\nThis was at the time of renewed interest in Facebook’s privacy policy–they had just changed it and people weren’t happy.\r Every day there were articles in newspapers about how Facebook was doing a terrible thing; there was massive backlash .\r Our own John Graham-Cumming even wrote a piece called ‘the Facebook Cull‘, and told us the only thing keeping him on Facebook at all was that we required it.\n\nMan was I stupid.\r When people asked to signup without it, I told them no.\r When the people who did sign up were worried about things being posted to their walls, I didn’t understand the problem.\r When readers said they wouldn’t signup to comment, I thought it was just a small minority.\n\nAfter a few weeks, I realised I had made a mistake, and put it on our “nice to have” list.\r There were a million other priorities, and how important was this, really.\r So that was another massive mistake.\r I should instead have moved it to the top priority, in particular because it held back domains which should (um, also) have been our top priority.\n\nFrom a technical perspective, it also prevented us from rolling out one-domain-per-journalist a lot sooner.\r There is an issue with Facebook where single-sign on doesn’t work across domains, so readers would have to approve each domain separately.\r As a result, we didn’t introduce what was probably the most important feature for actually making the journalists feel like they were writing for themselves.\n\nLesson: If you think you should build it, not buy it, you’re wrong\n\nWe built our whole platform ourselves.\r Now, we used lots of scaffolding, built on Rails, hosted at Heroku, using every plugin we could find.\r I reasoned that the platform was the core of our technology, and we were a technology company, and smart technology companies needed the flexibility that comes from writing the core of their platform themselves.\r In retrospect, this could only be considered premature optimization.\n\nThe natural thing to do was build on WordPress instead, but I wasn’t having any of it.\r The major problem with WordPress is that it’s written in PHP .\r I hated PHP with a passion, and couldn’t fathom building my company on it.\r How would we attract good developers?\n\nHow could we live with ourselves?\n\nReally, I shouldn’t have worried.\r It was far more important to just get it built, and nothing could have helped that more than just using WordPress.\r We could easily have given journalists distinctive styles, so they didn’t feel like they were writing for us, and we could have built things really quickly by just plugging them together.\n\nIf I was worried about how productive we’d be with PHP, well, it’s not like we had to build everything in PHP.\r We could just have done data collection in Python, and made it available to the rest of our app through either a web service, the database, or some other way.\r We might not have been happy, but we would have stood a much better chance of being successful.\n\nSince we needed to build so quickly, as soon as we got some money we wanted to hire another technical person.\r Nathan had a friend he wanted to hire, who was exactly the kind of great programmer he could work well with.\r However, it took some convincing to get him to try working on a news website, and he wasn’t sure he’d stick with it.\r We were sure we’d be able to convince him to stay, and we even waited two weeks for him to move to work with us.\n\nUnfortunately, we were never able to excite him about the project, and we quickly realised he was never going to be intrinsically motivated the way we need for a first employee.\r There was a point when I was over in Cambridge with Nathan and the other developer, and I noticed that the developer wasn’t working on a Sunday.\r Now, we aren’t the kind of people who think our employees owe us 90 hours a week, but startups need that kind of work ethic from very early employees–exactly the reason that intrinsic motivation is so important.\r If your first employee doesn’t love what you do, doesn’t wake up each morning dying to work on HIS product, you have likely chosen poorly, and that’s exactly what we did.\n\nSimilarly, we hired someone who wanted to learn how to do community management and social media promotion, instead of someone who knew how already.\r This is a pretty tough area, and I think we made a mistake in not hiring someone with much more experienced for such an important role.\n\nUpdate: The comment about working on a Sunday probably raised more ire than anything else in the piece, largely from developers, so I think I should clarify some things.\n\nFirstly, we’re not talking about death marches or prolonged periods of 100 hour weeks.\r It was early days in his employment, maybe the first or second week, and we had either just launched, or were coming up to launch, and had a great deal of things to be done.\n\nSecondly, early stage startups are not normal jobs, and early stage employees are not normal employees.\r Your first employee is almost a founder.\r While they get less reward as a result of taking less risk, the success of the company depends on them a great deal.\n\nThirdly, it’s nothing that Nathan and I didn’t do ourselves.\r We worked 80 hour weeks basically since December.\r And you can get more done in 80 hours than you can in 40, so long as you don’t prolong it.\n\nFinally, I’m not speaking ill of the developer.\r The problem is that we tried to convince someone to join a startup who wasn’t really interested.\r The fault was ours.\n\nAt the end of YCombinator, I moved to back to Dublin, and Nathan moved back to Cambridge.\r Neither of us had US visas, and we both had things to keep us here: Nathan’s girlfriend, and my soon-to-be wife.\r Both of us prioritised our significant others over the company, and I stand by that.\n\nHowever, that meant a number of sacrifices, including that we were in different cities.\r We already had a communication problem when this happened, but this made it far worse.\r Our social media optimizer was in San Francisco, our designer was in York, and we struggled to make the whole thing work.\n\nWhile there is nothing wrong with remote teams, I think your company has to be at a certain point for it to work.\r Everyone has to be on the same page, everyone’s roles have to be certain, and the communication has to be constant.\r We had none of these, and we never had the time to implement them.\n\nLesson: Work with co-founders before starting a company together\n\nYou need a co-founder who gets you, and who you work together well with.\r When Nathan and I signed up together, we had not spent any time working together, and that was a big mistake.\r Nathan is certainly a great coder, but when we didn’t share a vision, and we found it so difficult to communicate, there was no way we were going to get this built.\n\nWhen I get another co-founder, I’m going to make sure that we spend a lot more time working together on other things before we start a company together.\n\nIt was important to the journalists that we were a very open and transparent company.\r From the start, we tried to put as much information out there as we possibly could, and the most efficient way was to put every journalist we accepted onto a mailing list.\r However, this meant that our blunders and critical feedback were visible for all those journalists to see.\r Lots of them hadn’t started writing, we didn’t know them, and they had simply signed up, so we were always aware that our emails were semi-public.\r As a result, when we decided to close up shop, our closing down email was “leaked” to Poynter, leading to all sorts of speculation.\n\nIt takes a lot of time to be open like this, and a lot of effort to communicate effectively.\r The lesson here isn’t so much that we did it wrong, but that it’s difficult to do well.\n\nLesson: Don’t do too much at once\n\nI finished and submitted my PhD thesis a week before the YCombinator application deadline.\r Three days later I gave a talk to 900 people at StackOverflow London.\r When I moved to California in January to do YCombinator, I had still to organise my wedding in May, and I had a paper to write in between.\r My PhD defence in April was 4 hours after we launched NewsTilt.\r In May I got married and went on honeymoon.\n\nBasically, life happens.\r There is never a good time to start a company, just like there is never a good time to have kids.\r Certainly entrepreneurship favour those without other commitments, but it seems like nonsense that people with other commitments shouldn’t start companies.\n\nWhile I don’t regret doing all those things, I need to stop feeling like I can do everything at once.\r Everything takes time, and that’s time which could be spent on other things which are really important too.\r In retrospect, I should have delayed either the wedding or YCombinator.\n\nLesson: Be very careful how you are presented to the press\n\nWhen I gave my demo day speech to investors, I explained that there were tons of customers out there; in 2008-2009, 30000 journalist had been laid off.\r When I gave an interview to AllThingsD a few minutes later, Peter Kafka focused heavily on the unemployed part of this.\r I didn’t quite realise the problem–it seemed like a minor detail that he was focusing on a bit heavily–until potential customers kept asking “what about solutions for journalists not laid off”.\r Even though our product was for all journalists, it had effectively been maligned by what I thought was a minor detail.\n\nThis also led to people thinking we were going to take advantage of them, and that we were just another content mill like Demand Media.\r Even when we made it clear that we were only making money if they did–taking a 20% cut–this kept coming up, even with journalists who we had signed up and were using our service.\n\nUpdate: Peter Kafka spent some time defending himself when he wrote about this post.\n\nI feel there is no need for this.\n\nIt was my pitch that put unemployed journalists in his mind, and I had the opportunity to correct him afterwards.\n\nClearly, the error was mine.\n\nLesson: You have the greatest product on earth, and everyone should be lucky to talk to you\n\nMy natural way to network is to chat to someone, develop a rapport, and to set up another chat to talk about the world, current events, and (given time) some business .\r But even to chat to someone, you need an in: what do I know about that person, what could I say to get chatting.\r So this is what I did on Demo day.\n\nThe way it should be done it in to boldly walk up to them and ask them what they thought of your speech.\r After a few minutes discussing it, they have to talk to someone else, so do you, that’s fine, here’s a card, we’ll chat later.\n\nIrish people tend to self deprecate.\r They also don’t like successful people, and certainly not people who talk like they’re the greatest thing in the world.\r Silicon Valley is the complete and utter polar opposite.\r Self deprecation is out.\r No-one invests in a company who isn’t convinced that they are the greatest thing to ever happen.\r I’m thinking “my company has a great idea, but most companies fail, probably mine too, but we’ll certainly try as hard as we can to make it work”.\r Great entrepreneurs never concede that they might fail, and tell everyone how lucky they are to be able to invest in their company.\n\nI was certainly told early on to present ourselves as the greatest thing ever, but I didn’t properly internalise it until demo day was over, which was probably too late.\n\nLesson: Two sets of customers is hard\n\nNewsTilt was a product designed to connect journalists with readers.\r As such, we had two sets of customers, which means we need to do customer development twice.\r I spent a great deal of time designing the ultimate solution for journalists, and almost no time on what readers wanted.\r As such, I didn’t really know what to make, or what to say to the journalists about what they should write.\n\nIt’s tempting to look at the lesson as “don’t forget to do both sets of customer development”, but I think its many times more difficult to do it twice than to do it once.\r In the future, I’ll certainly be aiming for tools that only need to appeal to one set of customers."}