{"title":"Lessons Learned From My Money Losing Startup","favicon":"http://33.media.tumblr.com/avatar_fa28abd723a5_128.png","description":"Learn by Shipping: Lessons Learned From My Money Losing Startup This isn't a postmortem. Bellstrike, isn’t dead or dying. We have a great product (we let nonprofits set up attractive, donation-enabled...","keywords":"startups","lang":"en","tags":[],"image":"http://bellstrike.com.s3.amazonaws.com/blog/images/MoonClerk%20Logo%20Color.jpg","videos":[],"text":"This isn't  a postmortem. Bellstrike, isn’t dead or dying. We have a great product (we let nonprofits set up attractive, donation-enabled websites in about 1-2 minutes,) but it’s not profitable. I’ve lost a lot of money. But I shipped. And by shipping I learned. I learned why some ventures lose money and why you shouldn’t always be upset about it.\n\nWhy My Startup Is Losing Money:\n\n1) It’s scratching an itch that a market doesn’t care much about scratching\n\nBefore I launched Bellstrike in September, I talked to a lot of small nonprofits. Most said they would use Bellstrike. Then they didn’t. In retrospect, I realize I got a lot of false positives. I remember having to convince many of them why they actually needed a website. I’m pretty sure that’s not good.\n\nThere’s a reason many small nonprofits are small - they don’t raise a lot of money. Since my revenue is based on donations, (we have free signup and take a cut of donations, capping our fees every month) that’s a bummer. Some of them don’t have the desire to grow, some don’t have the time or resources, and some don’t have the skills. Having a website that makes it easy to donate only provides the platform, not the donations. It’s still up to the nonprofit to promote their site.\n\nAdditionally, many of the nonprofits that have the ability to raise a good bit of money have custom desires, meaning that they want all kinds of custom stuff on their website. If they want to do a lot of custom stuff, they’re probably better off going with something more robust like Wordpress. I’ve tried to create a Carbonmade for nonprofits. I’m still not sure how Carbonmade pulls it off - creating websites with limited customization but that work for their target audience.\n\n2) I haven’t found a profitable, replicable, and scalable way to pick up customers\n\nThe goal is to pay $X to pick up a customer and get $Y in lifetime revenue from that customer where Y > (X + our other costs). Some people call that a “profit”. I’ve heard it’s beneficial if you can repeat this process. I’ve tried a lot of methods to make that happen but haven’t found anything that’s remotely promising. I’ve tried paid sponsorships, pay-per-click advertising (on my own and hiring it out), traditional advertising, all kinds of SEO stuff I’ve read in books, social media stuff everyone talks about, contests, guest blog posts, online display advertising, A/B testing, referral incentives, PR, and even some callouts. So far, the best avenue has just been word of mouth.\n\n3) There’s a long lag (usually infinite) between customer acquisition and customer revenue\n\nWe’ve had 1152 signups (not all are legit.) Of those signups, 45 nonprofits have received donations (1,467 donations totaling more than $110,000.) I’ll let you do the math on where that leaves my revenue. Of the nonprofits that have raised money, there is generally a long lag (months) between when they sign up and when they upload content to their website. Then there’s a lag between when they upload content and when they promote the site and receive donations.\n\nWhy I’m Not Upset That It’s Losing Money:\n\n1) Shipping Itself is an Accomplishment\n\nA lot of people have ideas but never start. Even fewer ship after starting. I shipped Bellstrike. Before I started, I didn’t know the difference between CSS and HTML. While I’m still not a developer, I know enough not to be a clueless CEO. I learned how to design software that’s easy for non-technical people to use. I learned how to work with developers and designers. I learned what mistakes I don’t want to repeat. I learned that making good software is hard. And I learned that I like it.\n\nEven though Bellstrike isn’t profitable, it continues to pick up new nonprofits and revenue continues to grow, mostly through word of mouth. We’ve got some incredible customers. My costs are way less now that we’ve developed a solid feature set and aren’t investing as much into more features. I’m in the fortunate position to be able to afford the maintenance costs, hosting, etc. I’m also passionate about helping nonprofits so I have no plans to abandon it. Though Bellstrike won’t ever make me millions, over time it has potential to be a profitable, though not huge, venture.\n\nWhen we were developing the recurring donation feature for Bellstrike, I learned a lot about the recurring payments industry. Not just for nonprofits, but for everybody. I learned that it’s really tricky and costly. If you’re not a developer, there aren’t really any good options out there. So, Ryan Wood, one of the developers at Bellstrike, and I are starting a new venture called MoonClerk.\n\nOur tagline is “Recurring Payments for the Rest of Us.” We allow anyone, regardless of technical ability, to immediately start accepting recurring and one-time credit card payments for physical and digital products, services, and donations. We’re doing some cool stuff that hopefully solves some problems for a big market (you can read more on our website.) And, we’re actually going to be charging a monthly fee. No more freemium for me. We were accepted to The Iron Yard, a startup accelerator located in our amazing town, Greenville, SC. I would have never had the idea, know-how, or connections to build MoonClerk if I hadn’t first built Bellstrike.\n\n4) “Comparison is the thief of joy” **\n\nI try not to compare my successes and failures to others. There are very few Instagrams or Airbnb’s. When I go around comparing myself to everyone else, I usually end up disappointed. Comparison is tempting though. I resist the temptation by thinking about all of the things in my life that are undeservedly, mind-blowingly awesome. The list is pretty long. And if you think about it, yours probably is too."}