{"title":"Close, but no cigar.","favicon":"http://38.media.tumblr.com/avatar_9c7fe3ce741d_128.png","description":"Close, but no cigar. We just found out that we were unable to #saveBloomfm. We were very close to coming out the other side of this. But, alas, it wasn’t to be. Thank you to everyone – our listeners,...","lang":"en","tags":[],"image":"https://31.media.tumblr.com/6ad28946f4647da82029722f0fa133ac/tumblr_inline_n5vuwpYF5a1qmk4e5.png","videos":[],"text":"We just found out that we were unable to #saveBloomfm.\n\nWe were very close to coming out the other side of this. But, alas, it wasn’t to be.\n\nThank you to everyone – our listeners, the record labels, business partners and our fantastic team – that joined us for the ride. Your support over the last few weeks has been incredible.\n\nLegal music needs to be more affordable. When it is, more people will pay for it and all our favourite musicians will benefit.\n\nWe look forward to someone cracking this challenge. It’s a shame it couldn’t be us.\n\nPress Release: 11th hour attempt to save Bloom.fm fails as buyer withdraws\n\nAdministrators, Moorfields Corporate Recovery, will sell Bloom.fm assets following withdrawal of an offer.\n\nBloom.fm, the first mobile music service to offer truly mass-market subscription pricing, will cease operations within the next couple of days following the withdrawal of an offer from a potential buyer. The London-based start-up’s assets are now up for sale and the process is being managed by Moorfields Corporate Recovery.\n\nOleg Fomenko, CEO and co-founder of Bloom.fm said:\n\n“After Bloom.fm was placed into administration we received incredible amount of support from our users and a lot of commercial interest from prospective buyers. One offer stood out in particular, as it would have allowed Bloom to continue in the spirit we originally intended. We have worked furiously on finalising it but unfortunately, due to very tight timelines and complexities associated with the administration process, the deal fell through at the last minute. I would like to offer massive thanks to my team who have supported us through such a difficult time, our users who gave us a reason to get up in the morning and all our business partners for the rare opportunity to launch something truly innovative. We strongly believe in what Bloom.fm was trying to achieve and look forward to seeing someone else give UK music fans a fantastic streaming service at a reasonable price\".\n\nSimon Thomas, Administrator at Moorfields, commented:\n\n“Bloom.fm has had an incredible response from their customers and we received a lot of offers. Sadly, we were unable to finalise a deal within the timelines”.\n\nContact Arron Kendall akendall(at)moorfieldscr.com, Robert Mcilroy rmcilroy(at)moorfieldscr.com or call +44 207 186 1144 for further information."}