{"title":"Three years","description":"","lang":"en","canonicalLink":"http://christopherbull.name/2014/06/19/three-years/","tags":[],"image":null,"videos":[],"text":"Three years is a long time to spend on most things.  If you'd asked me when I started this last, perverse, journey where I would be three years down the track, I probably wouldn't have told you negotiating the end of it with the options being considered consisting of just shutting it down, letting a partner take it all, or shutting it down and releasing all our work into the public domain.  No willing buyer.  No riches.  No, I definitely would not have predicted that.\n\nWhat am I even talking about?  I'm talking about my last, proudly failed startup that we called Popin.\n\nJust quickly, if you're hoping to get a list of '20 Things You Should Definitely Not Do As A Founder', you're not going to get that here.  Those lists are plentiful and most are filled with great advice which you will devour and, promptly, ignore until you're in the post-mortem stage and those lists come flooding back and help you to categorise what you did wrong. I don't plan on giving any direct advice either, the internet is full of  people who will happily shout at you about their long experience gleaned reading books and blog posts, or who write with so much survivorship bias as to slaughter all hope of their message being universal or relateable.\n\nTo be honest, this essay is for me.  Like most I've been 'meaning to write more'.  A major block has been my desire to at least address this part of my life formally, publicly; this urge disrupting (ha!) any other attempts I've made to start writing on other subjects.  I've been wanting to do this for a while (we agreed to stop working on Popin in September 2013), so as much as anything, this is just an adhoc way for me to acknowledge something that happened and then move on.  Perhaps with some insight along the way.  Perhaps not.\n\nPopin was originally a website, built in 2010, called Let's Tweet Out.  This was founded by Jamie MacDonald (now the founder of a great startup called Storypark) and myself while we were being noobs down in Dunedin (New Zealand) as members of The Distiller.  We were in The Distiller ostensibly to build businesses, but for both of us it ended up being more of a personal development exercise than a business development exercise.  Jamie was the designer, I was the coder; we were both, at best, enthusiastic imposters when it came to being 'founders'.  Let's Tweet Out was (and I think still is...) a great idea.  We'd seen What the fuck should I make for dinner and were both blown away by how simple yet effective it was at making you actually choose something.  We decided we should build this for choosing where to go for dinner.\n\nI'm not going to dwell on that product too much, suffice to say we built it and it kinda worked. But then we got distracted...\n\nLike all good early tech founders, we didn't know much about building a website audience.  We had heard of a Sydney-based accelerator called Startmate and we immediately pivoted (ha! ha!) our focus towards getting into this.  We were convinced that, once they realised the giant opportunity to build Let's Tweet Out for everything, they would take us instantly.\n\nThings didn't quite work out that way: they were nervous about hospo people being cheap and this making our sales process expensive.\n\nWe did the rational thing next.  We decided that, because they were nervous about hospo, we should just build the ambitious thing now!  We recruited two more co-founders (James Bushell, now running an agency called Motif, and Stevie Mayhew, currently a senior developer at a prominent agency here in Auckland) and set out building what a friend of mine would later describe as \"the internet\".  This was a social network which had business listings and could do location stuff and had ways for people to follow you and businesses and group your friends into businesses and would probably be adding Washio's features if we had kept it up.  Eventually, due to no one knowing what the hell they were meant to do on the product, we realised we'd created a monster and set about taming the beast.  Jamie had, wisely, started Storypark by this time, so we enslited Felix Terpstra to help us design the new, leaner Popin.\n\nThis process went really well. Felix produced some great designs which we set about implementing.  Problem was, the initial code base was a mess and both Stevie and I were quite busy with other contract work now - due to us both having grown up and become useful to people who needed dev work done.  I was mostly doing Ruby on Rails work so in my infinite wisdom I decided it would be best to rebuild in Rails as a way of cutting ties with the legacy app and because Rails felt totes more productive (I wasn't that experienced in it yet).  I convinced the others of this and off I went.  Of course, Stevie was still a PHP developer so wasn't able to help much: my desire for productivity now meant I was the only person able to work on the app.  I also decided that the front end should be built in Ember JS (recently released, still not 1.0). Things were as productive as you'd expect.\n\nThroughout this whole ordeal a little thing called mobile had stopped sucking.  All of the people who were meant be our customers were now carrying around small computers which had location capabilites and were always connected to the internet.  They were using apps which did the same things that our app did but weren't our app.  James and I, over a delicious Japanese lunch on Courtenay Place, decided that we should restart once more.  We decided to build an iPhone app which would allow you to share short notes about places, privately among your friends.  The idea was that if everything were private and everyone was known to the user, they could both be more honest when they were posting, and more able to reason about the recommendations they were seeing from their friends - i.e. if you know your friend has terrible taste, you can use their recommendations as warnings and then the information is still valuable.\n\nFelix got to work and we produced a nice little app.  It did everything I just said, but didn't seem to capture anybody, especially not the way that Snapchat and other apps that work on more intimate networks have since.  We got to about 70 users or so, some who actually quite enjoyed it, but in the end we'd all just lost enthusiasm.  There's only so long you can work off the back of your own hubris.\n\nNow, I know I said I wouldn't try give any advice, but I'm willing to plead a charge of hypocrisy in order to convey this one, very important point:  In the early days of an endeavour EVERYTHING is your fault.\n\nYou may have co-founders/collaborators/bandmates who you can (and probably really want to) blame, but you'd be wrong to.  They likely may have contributed to something going wrong, but, when there's only a few of you, you either let them do it (bad) or (worse) didn't know they were doing it.\n\nTo clarify, I don't raise this in any specific sense for any specific action Popin took.  We were all guilty of blindness to each other in some way - that's probably why this is a failure tale - but it's all very irrelevant now.  I merely want to emphasise that, when you start something from scratch you're confronted with an object that just won't gather momentum no matter how hard you try.  This leads to bad decisions and they aren't any single person's fault, they're everyones' fault because no one stopped the bad decision being made.  This isn't malice, this is just life.  Learning this was my biggest lesson from Popin.  You have to trust your co-founders, but everyone also has to be in each other's business too.  You have to confront everything when and as it happens - it saves far more energy than you'd imagine, despite what other discomfort you may feel at the time.\n\nBack to the story though, to describe an ending without fanfare. On a typical, miserable, Auckland 'spring' day last September, the remaining three of us decided to wind down the company and open source the code over coffee at Imperial Lane.  If you'd been friends with me on Popin you would've known to go there."}