{"title":"Part Two of the HelloParking postmortem","description":"More than two years ago, I shut down HelloParking. We never managed to find product-market fit, and we were having trouble scaling. Here's what happened:","lang":"en","canonicalLink":"http://chrishoog.com/the-helloparking-postmortem-a-look-back-and-a-new-perspective/","tags":[],"image":"http://chrishoog.com/wp-content/uploads/2013/09/cemetery-645x250-300x116.jpg","videos":[],"text":"More than two years ago, Neil and I shut down HelloParking. We never managed to find product-market fit, and we were having trouble scaling. Before heading back to class and moving on, I wrote about our experience. In a rather long-winded essay, I exposed our triumphs, our failures, and told the story of HelloParking, a failed parking startup, to anyone who felt compelled to read it.\n\nTo my surprise, those who felt compelled numbered in the tens of thousands, and I’ve been contacted by many ever since publishing our story. As it turns out, we weren’t the only ones wanted to disrupt the parking industry. And as it turns out, where I thought we went wrong two years ago isn’t the full story.\n\nAfter writing HelloParking’s postmortem, I’ve since moved on – I’ve learned about Lean Startups and Customer Development. I’ve ripened my understanding of how to shape products. And as all things on the internet have a tendency to do, my original post has lived on.  Because this one morsel of my past life continues to attract readership, I’ve decided it’s time to share an epilogue.\n\nTo save the average reader from the toils of reading through the pages that follow, I’ve compiled my summary of new insights in the bullets below:\n\n* In the University of Entrepreneurship, Customer Development is a pre-requisite, and there’s no such thing as graduation. What you think you know is probably wrong. You can’t getting inside your customer’s head without getting out of the building. Any attitude otherwise is doomed to fail.\n\n* It’s not that the parking industry wasn’t ready for us. We weren’t ready, and didn’t know how to speak their language.\n\n* Pivoting for pivoting’s sake is worthless. It should be a calculated affair, where changes to the business model are made, hypotheses are tested, and results are measured. Otherwise, you can’t learn anything.\n\n* When it comes to entrepreneurship education, nothing beats a good reading list and personal experience. Having graduated with a degree in Entrepreneurship, I thought I was ready to fire on all cylinders. I was wrong. Nothing has prepared me more for success in the startup world than a handful (a roomful, rather) of good books. Works by Steve Blank (Customer Development Guru), Eric Ries (Lean Startup Guru), and the Heath Brothers (Applied Psychology Gurus) are great places to start.\n\n* Ignore the hype. Focus on product-market fit, earlyvangelists, and bright spots. Along our journey, lots of really cool stuff happened. We got featured in the press (press, press, press, and more press). We were finalists in business showcases. We (nearly) made it to TechStars. I confused this excitement with success, and I should have seen it as a distraction.\n\n* Broadcast knowledge, and share failure. It opens doors and is helpful to others. Failure doesn’t need to be guarded, and shouldn’t be a source of embarrassment. Writing about what we learned attracted new connections and got me recruited into my current position, where I have been for two years.\n\nYears have passed, and with them I’ve grown a deeper understanding to the answer here. Our first model (“AirBnb for parking spaces”), has since sprouted dozens of fellow upstart imitations, without much success. Just like ours, many who started in this model have since graduated to the commercial parking space. It seems that the reason the AirBnb model hasn’t quite worked yet is the difficulty in collecting enough supply. Some have found marginal success at the hyper-local level, but none have found a model that works at scale.\n\nMore folks are hunting for parking spaces than exist parking space owners who are willing to share. This is the problem we weren’t able to solve, and a problem that still exists today for folks taking their own stab at the driveway sharing business. That’s not to say it’s a problem that can’t be solved, but rather it’s a tough one that has yet to be solved at scale (that I’ve seen, anyway).\n\nOur failed attempts at the “ZipCar for parking”, “Priceline for Parking” and “Groupon for parking” models followed in the months thereafter. And then we gave up. At the time, I was convinced that the industry wasn’t ready for our innovations. I was convinced that property managers and parking operators didn’t “get it” or just didn’t care.\n\nThat just can’t be the case. And it wasn’t.\n\nI’m now the product manager at QuickPay, where I have been for two years. I know from first hand experience that parking operators are willing to innovate. They’re looking for ways to grow their businesses. But at the time, I just didn’t know how to speak their language. I didn’t know a lot of things.\n\nFirst of all, I didn’t have a good understanding of the Customer Development model. And though I didn’t realize it at the time, doing “xyz for parking” isn’t the way to build product and discover value. The transitive property doesn’t apply as well in the startup world. (““)\n\nThe truth is, as co-founders of HelloParking we huddled together to decide on ideas that sounded nice, built prototypes, put on our salesman hats, and didn’t understand why we weren’t closing deals. And then we rinsed and repeated. We pivoted because pivoting seemed like the right thing to do.\n\nBut we never defined clear hypotheses, developed experiments, and we rarely had meaningful conversations with our target end-users. And while we had some wonderful advisors in the parking industry, we should have met with everyone we could get our hands on. Worst, we rarely got out of the building.\n\nBut at the end of the day, I’m fortunate to have had the opportunity to learn from my mistakes in my early twenties. And I’m fortunate to have been given a second chance as an early employee at QuickPay. I’m better for the experience, and have learned from it. I only hope that some of you out there can learn from my mistakes as well."}