{"title":"Today my startup failed","favicon":"http://33.media.tumblr.com/avatar_1e24341a122c_128.png","description":"Today my startup failed No soft landing, no happy ending—we simply failed. It’s been a long four year journey, full of highs and lows. I am simultaneously incredibly proud, and incredibly...","keywords":"christopher poole, chris poole, 4chan, moot, canvas networks, canvas, drawquest, startups","lang":"en","tags":[],"image":null,"videos":[],"text":"It’s been a long four year journey, full of highs and lows. I am simultaneously incredibly proud, and incredibly disappointed.\n\nI’m incredibly proud of an amazing team and all that they have accomplished. Our most recent product, DrawQuest, is by all accounts a success. In the past year it’s been downloaded more than 1.4 million times, and is currently used by about 25,000 people a day, and 400,000 last month alone. Retention and engagement are great. And yet we still failed.\n\nIt may seem surprising that a seemingly successful product could fail, but it happens all the time. Although we arguably found product/market fit, we couldn’t quite crack the business side of things.\n\nBuilding any business is hard, but building a business with a single app offering and half of your runway is especially hard (we created DrawQuest after the failure of our first product, Canvas). I’ve come away with new found respect for those companies who excel at monetizing mobile applications. As we approached the end of our runway, it became clear to us that DrawQuest didn’t represent a venture-backed opportunity, and even with more time that was unlikely to change.\n\nI’m terribly saddened that this may spell the end for our wonderful community, but it’s my goal to use what little money we’ll have left after the wind-down to keep the service alive for another few months. However as of today the team has gone their separate ways, and our doors are effectively closed.\n\nI’m disappointed that I couldn’t produce a better outcome for those who supported me the most—my investors and employees. Few in business will know the pain of what it means to fail as a venture-backed CEO. Not only do you fail your employees, your customers, and yourself, but you also fail your investors—partners who helped you bring your idea to life.\n\nIn my case, I am extremely lucky and grateful to be partners with people who are simply the best. What separates the best investors is not how they help you when you’re a rocketship, but when your ship is on fire and you’re venting atmosphere. In this case, our investors have demonstrated what sets them apart from the rest—they’ve supported me throughout the ups and downs, and especially the downs.\n\nWith that said, life goes on, and the best path forward is not a wounded one, but a more learned and motivated one. I’m definitely not itching to start another company any time soon—it will take time to decompress and reflect on the events of the past four years—but I hope that if I do some day decide to pursue a new dream, I’ll be in a much better position to. After all, I did just receive a highly selective, four-year education for a mere $3.6 million dollars! (I find humor helps as well.)\n\nAs for what’s next for me, I honestly have no idea. This is the first time in four years I’ve been at a crossroads like this.\n\nOne thing I’ll be doing more of is writing about my experience. Partially because it’s therapeutic, but also because if there’s a silver lining in all of this (and there is), it’s that I can help educate others about a path fraught with hardship, but rewarding nonetheless.\n\nI’m also particularly inspired by what Everpix has done by making so much of their story public, and hope many others will follow in their footsteps of radical transparency. I don’t wish to glorify my failure, but it’s certainly something I’d rather embrace than hide behind for the next five years.\n\nOn that note, if there are any specific topics you’d like me to write about, feel free to submit them via my Ask page. Or if you’d like to say hi in general, please don’t hesitate to e-mail me at moot@4chan.org. Believe me—I’ll have a lot of free time on my hands these next few weeks.\n\nLast but not least, to my team—Dave, Eunsan, Alex, Nick, Shaun, and Jim—I am eternally grateful. To my investors—Union Square Ventures, Andreessen Horowitz, Lerer Ventures, SV Angel, Founder Collective, Chris Dixon, and Joshua Schachter—I could not have done this without you.\n\nAnd to everyone who has supported us over the past few years, from the bottom of my heart: thank you."}