{"title":"Day 23: Seven Major Insights I Learned from my Failed Startup (guest post)","lang":"en","canonicalLink":"","tags":[],"image":null,"videos":[],"text":"“This is a guest post by Sebastien Provencher, VP Product Innovation at HomeAdvisor”\n\nFounded in 2006 and vc-funded in 2007, my most recent startup Praized Media / Needium went through multiple iterations including 2 pivots before shutting down in the summer of 2012. Through this amazing six-year rollercoaster ride, I probably learned something new every day. We did a lot of things right (especially after we pivoted to Needium in 2010) but if I could go back, I’d change a few things. Here are seven insights I recently shared at a Montreal New Tech event.\n\nBy now, in a minimum viable product world, this advice sounds almost cliché but, in 2007, it took us 9 months to get to a first release. We over-complexified our first product launch (in July 2008) and should have been in the market sooner, gathering important learnings from our target customers.\n\nAs mentioned above, we shipped multiple products at the same time when we launched. Only one of them really took off: our Facebook application “Praize ‘n Raize”. It went viral very quickly, generating huge usage in Montreal. It had all the winning elements (local search, voting, reviews, gaming elements, etc.) that Foursquare would introduce on mobile 9 months later. We should have focussed on this and killed the rest of our product stack.\n\n-Trust your product/market instinct. You are the expert.\n\nWhen you run a startup, you often get confronted by elements you don’t control. In our case, it was the financial crisis of September 2008. As we were raising a new round based on our early success, all funding dried up. The “Rip Good Times” presentation from Sequoia scared everyone. Our VCs asked us to reduce our burn as much as possible by increasing revenues and reducing costs very quickly. We fired half our team and did our first pivot. We thought we could generate short-term revenues by licensing our technology stack to local media companies, in effect becoming an enterprise social platform provider. But 9 to 12-month sales cycles did not solve our revenue problem. We eventually signed a few customers but, in reality, we should have followed our original vision and focussed on our Facebook app. By moving it to mobile (as we were planning to do), we might have become Foursquare before Foursquare.\n\n-Your self worth is not the same as your startup worth\n\nThe September 2008 to early 2010 period was extremely difficult for us. We barely survived. When you launch your own company, your personal emotions often follow the same path as your startup. Up, down, up, down, up, down. Sometimes during the same day! I eventually realized that this wasn’t good for my physical and mental health and I learned to uncouple my emotions from the rollercoaster that we were riding. I also realized that, even though this was a difficult year for my company, my professional reputation in the market was improving all the time. You are not your company.\n\n-Always step up to the plate\n\nThat period was also difficult for one of our co-founders & CEO who had to leave the company for health reasons. In hindsight, I should have raised my hand when that happened and taken the CEO role but I felt I wasn’t ready. Instead, we hired an external CEO. From that, I learned that you should always step up to the plate when you’re needed, even though you might feel uncomfortable about the move.\n\nAnother advice that sounds cliché, but is also true. Even though you might feel the pressure to fill positions quickly, take your time when hiring. In a small team, everyone plays a critical role. It can make or break the company in the long run. Hire only A-players. And if you make a hiring mistake, don’t wait multiple months before making the required change.\n\nWhen you’re iterating, pivoting and taking follow-up funding rounds over 6 years, you’re slowly diluting your ownership of your own company. As I often tell entrepreneurs, it’s better to own 10% of a company worth $100 million than 50% of one worth $1 million, but without explosive growth and value creation, all that dilution eventually catches up to you. Don’t get to a point where you feel you don’t “own” your company anymore."}