{"title":"A startup postmortem with a happy ending? ..in...","favicon":"http://33.media.tumblr.com/avatar_2459e06a6241_128.png","lang":"en","tags":[],"image":null,"videos":[],"text":"When facing the reality of a failed product and 3 months runway left of investors money, sometimes the best solution is to go to Thailand.\n\nIn early 2012 Thomas and I envisioned a future where recreational football players would use an app to share their matches with friends and family. All their history of achievements would be recorded that would become their online football identity.\n\nUsing mockup design we tested the idea at KB (football club in Copenhagen) with players and coaches. The response was very positive. So we gave ourselves three months to build the first version of the app and test with a group of teams.\n\nAt the time I could work full time as I just sold my previous startup. Thomas on the other hand was contracted at Scandinavia’s biggest deal site to upgrade their whole backend. A tall order for any hacker. So building this app on the side would not going to be easy.\n\nAs I started working in the morning, Thomas would join me after his work and code till late after midnight. Those three months I think he slept 4-5 hours each night.\n\nPumodo was launched in App Store in mid April with 5 test teams. The feedback was promising and the data showed that each user would in average add 6.4 players to his team. A very good growth indicator.\n\nInterviews showed that spectators really loved the idea to get live score notification from the matches they were unable to attend. The math was that each player had in average 3 fans so a team had 45 in total. Often only 5 people attended a match so there would be 40 friends and family at home wanting to be updated on that match. The key would be getting players to track their matches.\n\nA Skype meeting with senior level guys at Adidas confirmed that we were on right track in regards to our monetization model. They were committed to launch a campaign in our app once we reached a specific amount of users.\n\nThomas and I had the proof we needed. He just finished the contracting assignment so it was perfect timed as he could go full time on the project.\n\nWe also decided to work on the app the next three months in Silicon Valley. We’d had never been there before and it sounded like fun.\n\nThere we also could test the US market that was among the top 3 in size in regards to active recreational football players.\n\nDo or do not. There is no try\n\nIn August we left for Palo Alto where we were invited to stay for two weeks for free in a cabin build in a backyard. The host was an awesome guy we met a year before in Copenhagen and one of the most esteemed growth hackers in The Valley.\n\nFrom the comfort of the backyard cabin we moved to big city San Francisco and faced the totally hopeless situation of finding a place to live. We survived the first two weeks by renting office space at Tradeshift and sleeping on their couches at night. Not sure if they ever found that out.\n\nFinally we managed to get a 9 m2/97 sqft room through our Y-Combinator network. Rent $1,250. Dang! But since we had free office space from our friends at OneLogin, our burnrate wasn’t yet gone through the roof. But close..\n\nWe did the show and tell dance at Techcrunch Disrupt and DEMO. Networked at GigaOm RoadMap Con and  YC Startup School. Got tons of advice. Met people with amazing experience. We felt we were in the nexus of entrepreneurship and innovation. And we probably were. But we also got tangled in the hype machine. Our business plan was changing every week. We went from focusing only on football to becoming app for all sports. Think BIGGER was the mantra.\n\nIt was like our feet never touched the ground.\n\nOur market research showed USA would not become our main market. Too fragmented and unfavorable league structures. Europe would be our target.\n\nSo in November we headed back to Copenhagen just in time for the Danish App Awards where we were nominated for Best Sports App and Best Functionality. With our feet on solid ground yet again we won as Best Sports App. Sweet!\n\nAnd since we had been contacted by Danish business angels interested in investing, we felt everything was going as planned.\n\nOne of the biggest disadvantages with recreational football in Europe was the long winter breaks. In Denmark it was 5 months. I felt like Ned Stark facing many years of winter. It rendered our app lifeless and desolate. No live user data to use to improve the app as majority of our users were based in the cold north of Europe.\n\nTrying to remain positive we saw it as an opportunity to submerge into our hack cave to build the next big feature.\n\nWe wanted to solve the lack of ability to compare players across different positions.  Current comparable metrics were goals and assist. It was not possible for a defender and forward to compare fairly.\n\nThe solution was an universal score based on players abilities to compare and compete against anybody regardless of age, level or position in lineup. Kinda like Klout score just for football players. The bigger impact you have in a matches, the higher is your score.\n\nClubs were offered a widget that showed Team of the Week based on the players’ score and a leaderboard among the clubs players. We wanted the clubs to celebrate individual players weekly achievements with place on the clubs Team of the Week\n\nThe hypothesis was that if we can get a club to place it on their club page and promote it, the players would want to be on the weekly Team Of Week so they download the app and start tracking their matches.\n\nThis was our growth hack.\n\nGetting as close to our users as possible\n\nIn April we closed a $180k angel round and hired our first employee, Anders as a frontend dev. He was a great fit. Skillful, curious and a football fan.\n\nFrom the desire to be in close day-to-day dialogue with our users, we decided to move our office to a football club (B93) in Copenhagen that was 1,800 members strong. Our office had only smelly locker rooms as neighbors. Perfect!\n\nWe were basically living with and meeting our users every day.\n\nThe coding of these two features took longer than anticipated which meant that we would not be able to launch before the summer holiday that is from May to August. The breaks between season started to really become a huge problem. How had we not seen this coming?\n\nWe needed users to test the new features. So that summer we went on a 7-day guerilla marketing campaign at one of the worlds biggest youth football tournaments, Dana Cup. We made a special Team of the Day webpage for this campaign. Promotion was with flyers and posters.\n\nDespite personally handing out 10k+ flyers only 3 teams tracked their matches. The morale was still high but concerns started to arise. No panic. Yet…\n\nIf a platform fails at encouraging creation, it breaks down\n\nWhen the new season started we had convinced a handful of teams at B93 to start tracking their matches. It started well as the matches were tracked and the “Team of the Week” on the clubs webpage was generated.\n\nBut the conversion of teammates joining after invite was very low. After 2-3 matches the tracking stopped. Even those players who had been explicitly instructed by the club director to track, stopped tracking. We did multiple interviews with the players and the general response was “the idea is cool, but meh..”\n\nWe had created an Indifferent product. Oh, the shame.\n\nPumodo was a product where people wanted to consume the live matches, player data and history but players didn’t want to supply it. The reward wasn’t high enough compared to the effort.\n\nBut our biggest self realization was that we were not users of our own product. We didn’t obsess over it and we didn’t love it. We loved the idea of it. That hurt.\n\nCoinciding with our time of woe, the Danish National Football Union announced they would launch a competitive live score app. With all their members already in the app it would get even harder for us to sign up users on our home market.\n\nWe had good ideas how to fix the situation but with 3 months runway remaining of our angel round and, once again, a 5 month winter break upon us, we needed radical ideas.\n\nFurther funding was not possible without a critical amount of active users and an proven product/market fit.\n\nOne does not simply pivot\n\nOur conclusion was that if we would use remaining resources to try to fix Pumodo, the odds would be against us. Even with extended runway the winter break would make it very difficult to test and validate the new ideas.\n\nSo why not create a new football app build upon our current experience and code…\n\nDuring the last year working on Pumodo we had noticed accelerated technology leaps in live tracking of pro football players during matches.\n\nThe ability to track and record 1,000+ live events per match created incredible rich data that nobody was utilizing properly. Live score services still served fans with simple and stale stat notifications in apps and on web.\n\nSo we looked at the market for live score football apps. No real market leader. But the market was growing fast as this seemed to be the last category that not yet migrated to mobile. We looked at some of the major apps and thought we can do much better.\n\nBut we needed more runway!\n\nExtending the runway by bringing down expenses was the only solution. Denmark is not a cheap country to live and work in. Almost as expensive as San Francisco.\n\nSo moving to a much cheaper country made sense. We narrowed it down to Philippines, Indonesia and Thailand. After much consideration we chose Thailand as Thomas had a good friend who lived there and owned a small co-working space from where we could work and live.\n\nAs the dust had settled, we realized that this time we did not have to convince teams to input data. We could just buy it. Awesome!\n\nFour weeks later in mid November Thomas and I were on a plane to Thailand. Anders would join us later in January. We decided to bump Anders up to co-founder. He shared our passion for the new product, was prepared to take a drastic pay cut and we really liked him. Best decision ever!\n\nThe next months went fast. Our corner of the co-working space was quickly transformed into our new hack cave . We were spitting out code and design in a daze of strong coffee and thai Red Bull. The Pace was frantic and probably prolonged the jetlag with a week.\n\nWe didn’t care. This time we were building an app with ourselves as users. That just felt right.\n\nWe designed the ultimate football app and then scraped everything “nice” off. Left was a minimum viable product that could be build fast and get out in the hands of users asap. All hypothesis could then be tested and iterated on as we got feedback.\n\nOne thing we thought was missing among the other football apps was the ability to get notification for individual players. Get updates of just Zlatans achievements without following PSG.\n\nThis would become our unique value proposition.\n\nOut of money but an awesome app richer\n\nLast wages were paid end of March. As expected. With barely $1,000 remaining, it was time to get this show on the road.\n\nWe limited the launch to Thai App Store only. It gave us a contained environment to learn and iterate. To get users in the app we used most of remaining cash to buy cheap app installs through Facebook ads. We had 5 weeks left to test the app in before the football season ended.\n\n30 days later we became no. 1 sports app in the Thai App Store.\n\nThe launch had gone so much better than hoped for.\n\nOut of money. Don’t care. We’re driven by the excitement of building, what we think, can become the best football experience on mobile. An app that empowers fans with great insight in players stats and history.\n\nSoon it will deliver a live-score experience so powerful that we expect to see José Mourinho sneak peek at our app before making substitution decisions.\n\nBut right now we’re laser focused on the biggest football event of them all: The World Cup in Brazil. To celebrate this we will add some Easter eggs that maybe will ruffle some Uruguayan and Brazilian fans.\n\nHope this story can become inspirational for entrepreneurs when struggling with a failed product and end of runway.\n\nUPDATE! Read next chapter here: When your startup runs out of money you only got 1 problem\n\nPS. If you want to help us, check out Champion and, if you like it, share it with friends. Thanks!"}