{"title":"A Post Mortem","favicon":"http://www.iaventures.com/InformationArbitrage/favicon.ico","description":"Monitor110: A Post Mortem Turning Failure into Learning Writing a post mortem is hard, particularly when the result is failure: a failed deal; a failed investment; a failed concept. That said, without...","keywords":"Evergreen,Principles,Investing","lang":"en","tags":[],"image":"http://assets.tumblr.com/images/og/text_200.png","videos":[],"text":"Writing a post mortem is hard, particularly when the result is failure: a failed deal; a failed investment; a failed concept. That said, without a post mortem, without deep reflection, honesty and introspection, how can we get better and do better the next time? Quite simply, we can’t. My involvement with Monitor110, as an investor, Board member and leader, was one of the most interesting and informative experiences of my life. I learned about areas I never dreamed of. I worked with a terrific group of young, exceptionally bright people who believed in the vision. Ultimately, we failed. But why did we fail, and what could we have done differently?  Some of the stuff is pure 20:20 hindsight. These observations aren’t worth much. But the interpersonal dynamics, the issues of organizational structure, the need to change strategy in light of new information, the relationship with key investors, all of these are very instructive. I will endeavor to be as honest and candid as possible.\n\nLet me say that I deeply respect everybody involved with Monitor110 from the original founder, Jeff Stewart, to our investors, employees and customers. Everyone tried very hard to make things work, and this post is not an indictment of anyone. There are no “bad actors” in this story. But a confluence of factors made success an uphill struggle.\n\nWhile we certainly made more than seven mistakes during the nearly four-year life of Monitor110, I think these top the list.\n\nThe lack of a single, “the buck stops here” leader until too late in the game\n\nNo separation between the technology organization and the product organization\n\nToo much PR, too early\n\nNot close enough to the customer\n\nDisagreement on strategy both within the Company and with the Board\n\nI was initially approached in early 2005 by Jeff Stewart, who had the original idea for Monitor110. It was a compelling idea. The thesis: more and better information is being put out on the Internet every day, information that can be valuable to Institutional investors who are constantly looking for an edge. And these investors were not very sophisticated about how to best access this information; Monitor110 would use technology to help them get that edge. Jeff and a few guys had hacked together a version 1.0 of the system, which was based on a boolean matching engine with rules corresponding to each company and investment theme. It was fast. It worked ok. We spent some time working with PubSub, who had built a scalable matching engine but was not focused on the financial services industry.\n\nBy mid-2005 the system worked, but spam was becoming more prevalent and caused the matching results to deteriorate, e.g., too much junk clogging the output. Around the same time we started to dig into natural language processing and the statistical processing of text, thinking that this might be a better way to address the spam issue and to get more targeted, relevant results. This prompted us to not push version 1.0, instead wanting to see if we could come up with a more powerful release using NLP to mark the kick-off. In retrospect, this was a big mistake. Mistake #5, to be precise. We should have gotten it out there, been kicked in the head by tough customers, and iterated like crazy to address their needs. Woulda, shoulda, coulda. Didn’t.\n\nThe idea was that Jeff was the technology guy and I was the business guy. Jeff focused on technology and product and I focused on fund raising, HR, controls and client access (given my Wall Street and hedge fund rolodex). On paper, made sense. Jeff was a successful three-time entrepreneur, I was an experienced senior Wall Street executive. The problem was, however, that when it came time to make hard decisions the two-headed structure really didn’t work. It was a technology company working to solve a complex problem, and ultimately technology dominated the discussion. Ultimately, we ended up building something that the business side was not happy with, which made selling it difficult. An indication of Mistake #2. Neither Jeff nor I had the power, real or perceived, to simply change direction. The Board was supportive of this management structure. This was also a mistake. Mistake #1.\n\nWe talked about “release early/release often,” but were scared of looking like idiots in front of major Wall Street and hedge fund clients. Is it better to wait a bit before releasing to have a more compelling product or to begin getting feedback on a less impressive offering? We chose #1; in retrospect I think we should have chosen #2. By choosing to wait we lost our intimacy with the customer (Mistake #5 again), falling into the classic (as a “green” entrepreneur I didn’t know this, but as a seasoned four-year venture investor I know this now) trap of pursuing a “science project,” not building a commercially salable product. Dumb. Another problem: technology and product management were effectively bundled together, with the same decision-makers for both. This was another crucial error, #2 again. Instead of having product management as the advocate for the customer and the product evangelist, we had technology running the show in a vacuum. Huge mistake. This allowed us to perpetuate the science project for much, much longer than we should have. There were no checks-and-balances built into the system. This was a recipe for failure. I intuitively knew it then but as an inexperienced entrepreneur didn’t feel empowered to act. Really, really stupid. After 20 years of making consistently good business decisions why didn’t I throw a fit and and be more assertive in communicating my concerns? No good answer here.\n\nAnd these bad behaviors were reinforced by an unplanned event that sharply impacted our psyche: being on the front page of the Financial Times. It is hard to call it a mistake since we didn’t seek to get such exposure, but I put it down as Mistake #3. To be honest, this single fact was a very meaningful factor in our failure. It raised the level of expectations so high that it made us reluctant to release anything that wasn’t earth-shattering. It was also catalyst for us raising our last and largest round of capital. So the net effect was that it enabled to raise all this money that kept us far from the customer. Truth be told, we were probably afraid of customers at this point because we didn’t want to disappoint them or look bad. Oh, we’d build something they’d love. We just wouldn’t show it to them until it was done. Ugh. Just so stupid.\n\nToo much money is like too much time; work expands to fill the time allotted, and ways to spend money multiply when abundant financial resources are available. By being simply too good at raising money, it enabled us to perpetuate poor organizational structure and suboptimal strategic decisions. Mistake #4. We weren’t forced early on to be scrappy and revenue focused. We wanted to build something that was so good from the get-go that the market would simply eat it up. Problem was, with all that money we hid from the market while we were building, almost ensuring that we would come up with something that the market wouldn’t accept. And then there were technology issues that came up along the way, very substantive issues, that because of so much money we simply didn’t face into nearly fast enough. And this drove a wedge in the company between those that were more plugged into the market (and felt we weren’t building the right thing or addressing the data issues the right way) and those who were building the product (and felt very convinced that what they were building was responsive to the market). I would almost argue that too much money enabled the other six mistakes to be made again and again and again. Seems counter-intuitive, right? It’s not. And believe me, I am super sensitive to this issue now as an investor. If a company wants to raise significantly more money than I think they need to get to revenue, I push back. Hard.\n\nWe raised money based on a vision of a scalable web portal, a tool that would eventually be the web-enabled side of Bloomberg. We never believed we’d replace Bloomberg, Reuters or Thomson for market data and mainstream news, but that we’d eventually become a necessary part of the Institutional investor research mosaic. We were positioned as a technology company, not as an alternative research provider or a services business. And it was the deep belief in Monitor110 as a pure technology company that created a rift between the business side of the company and powerful members of the Board. Mistakes #6 and #7, as you’ll soon see.\n\nWe did an angel round in the latter part of 2005 followed by an institutional round early in 2006, enough money, we thought, to help us build the new version 1.0 of the product. We then did another institutional round in Q3 2006 to further execute against this vision, because the money was offered to us on a pre-emptive basis and around six months earlier than we were planning to do a raise. The new release would be whizzy, fast, comprehensive and use all that neat technology to analyze unstructured data in real time, and to score each data element by reputation and relevance. Easy to filter, discover and analyze. Super cool, right? Sure. Problem was, we started out trying to analyze most of the dynamic web (probably up to 100 million sources by now) in real-time, and using technology (NLP, pattern matching, etc.) to do the filtering, indexing and categorization. This was no mean engineering feat. We had a very, very large and complex back-end. And even with this, the quality of the data coming through to the end-user was just not that good. Too much spam, still. Duplicate posts. Sometimes mis-categorized. Difficulty applying our reputation algorithms. Not good.\n\nThose closer to the customer wanted to effectively chuck this approach and to build up a high-value corpus of data from the bottom up, using our deep knowledge of the source universe to assemble a body of data from publishers of high reputation. Really more akin to a “Bloomberg for the Web” than the original product, as the sources would be of high-quality and indexed correctly. They also wanted to build a research capability, where a desk could generate customized reports for clients leveraging our technology and data. But making this fundamental change to our approach towards data and the business model resulted in a fight. Almost a jihad, where certain parts of the company were vehemently in favor of changing our approach while others said “improvement to the current system is right around the corner.” This could only happen because of Mistakes #1 and #2, where nobody could pound the table and say “this is the way we’re going to do it and here’s why,” nor could the business side simply say “this is what our clients want. This is why we should do it.” We were one big, passionate, driven, dysfunctional family. This argument played out over months and months, and cost us an enormous amount of money. Eventually we did change our approach to data, but it was a fight that spiritually damaged the company and morale and had a financial impact that substantially depleted our coffers.\n\nThe good news for me personally is that I now invest in a way that actively seeks to avoid the seven deadly sins listed above, and the performance of my portfolio companies bears this out. But I simply wasn’t smart enough or experienced enough to see all of these mistakes or to feel empowered to do something about them until it was too late. I would like to thank all of our investors for having the confidence in us to pursue the Monitor110 vision, and I’m sorry that we weren’t financially successful. I’d also like to thank the people with whom I worked during my tenure at Monitor110. Not a bad apple in the lot. Smart, hard-working, highly motivated professionals. They will invariably do extremely well in their post-Monitor110 lives.\n\nThe market for alternative information and tools is very, very challenging, and the current market environment isn’t making it any easier. But there are clear needs out there that should and will be addressed. I will write a post on the alternative information market at a later time. Thanks for listening."}