{"title":"Looking back at 7 years with my startup GroupSpaces","favicon":"http://33.media.tumblr.com/avatar_c787af86adb0_128.png","description":"Looking back at 7 years with my startup GroupSpaces Today I announced that I’m joining the team at Stripe, after 7 years working on my startup, GroupSpaces. The decision to join Stripe was by no means...","lang":"en","tags":[],"image":null,"videos":[],"text":"Today I announced that I’m joining the team at Stripe, after 7 years working on my startup, GroupSpaces. The decision to join Stripe was by no means easy, to say the least. The journey bringing GroupSpaces from a college-room idea has been the best ride of my life - an unbeatable learning experience full of the hardest challenges, the opportunity to work with people I have the utmost respect for, and the creation of a product of which I’m immensely proud. I’m indebted to all the mentors, advisors, investors and all who’ve supported us along the way.\n\nGoing back to when I first started working on the ideas that became GroupSpaces - before we formed a company, lost and gained team members, reformed a new company, took time out of university and raised investment - it’s been a 7 year journey for me. 7 years ago, my cofounder David and I knew nothing about business or startups. We had no connections to anything like the ecosystem that exists today in London.\n\n7 years is a long time in any context, particularly for a business that has not become the proverbial billion dollar success. But I’m at one with what Ian from Songkick (who I highly respect for being down to earth in the face of much of the hype and hubris of the startup scene) had to say about being open and proud about the length of time it takes to build our companies. In this manner we fought a long hard graft, assembling the cliche’d airplane on the way down.\n\nToday, GroupSpaces is a sustainable small business, doing that old-fashioned thing of making more money than it spends, and continuing to grow user base and revenue. A fascinating diversity of organisations use GroupSpaces to ease management of their membership, communications and activities - from professional associations to sports clubs, local hobby groups to prominent international campaigning organisations, campus-based student societies to community groups and charities.\n\nWhile disappointed that the business grew slower than we hoped in financial returns, I’m hugely proud of the contribution and impact we’ve made, and I remain dedicated to seeing GroupSpaces continue to thrive and achieve the best it can. We started GroupSpaces with the ambition to build a global internet-scale company, and it’s in this light that it’s now time for me to move on to tackle the next challenge. However I’ll continue to be involved in supporting the business, while my departure from the day-to-day has made room for fresh blood to drive it forward in new ways. I look forward to seeing GroupSpaces continue to grow, either standalone or in time with an appropriate partner.\n\nWith the bittersweet benefit of hindsight, I’ve been able to dwell on the key mistakes we made and how they affected our progress. For the possible benefit of others - along with bringing no small amount of closure for myself - I’ve detailed my thoughts on these mistakes and learnings as follows:\n\n- Failing to appreciate a lack of product-market fit as we moved into new markets\n\nGroupSpaces originally started out serving the student market, where we achieved considerable success. We designed a tool to solve our own problems, discovered that there were many like us, and with the benefit of the closely-linked geographically-concentrated nature of universities and colleges we spread often like wildfire though campuses in the UK. A stand-out memory was signing up a single organisation at the London School of Economics at the beginning of the semester; with no further marketing we had 100 organisations using the platform by the end of that term.\n\nThe problems came when we followed this by focusing on marketing and distribution when expanding into other markets beyond students, failing to identify early on our issues with significantly different activation rates due to issues such as far less recognition, peer endorsement and good old-fashioned offline word of mouth. As a result we ploughed on for too long “pushing uphill” without going back and ensuring our product was fully appropriate for these new markets.\n\nI firmly believe startups should choose their One True Thing as early as possible and aim to do that one thing well. With a small team that peaked around 12 people, we simultaneously tried to work on the product, while scale up user acquisition and paid marketing channels, while building out a business model consisting of 3(!) different revenue streams - all while attempting to fit our achievements into a framework that would enable us to demonstrate progress and hit milestones that we could use to raise further funding. This had the inevitable effect that we ended up scoring straight Cs - sub-standard product, sub-standard metrics, sub-standard traction.\n\nThe irony is that at the time we believed we understood this point, and considered ourselves to be very focused - we’d learned to say “no” to most opportunities and suggestions, and had a very clear idea of our target customer, our product and what we were not. Our problem was that our “one thing” had many multiple parts. I cringe when I recall our spreadsheet models that had customer lifetime value as a messy fudge blending multiple different metrics, each of which depended on other metrics - and ultimately too many assumptions to meaningfully test.\n\nI believe a startup needs to achieve a single A grade in one thing to advance to the next stage - if I could go back, the advice I would give myself would be to force ourselves to limit our focus to one thing - a single KPI at a time - to which all our efforts should directly and measurably contribute.\n\nFollowing on the point about focus, looking back we were very confused about which milestones we needed to hit in order to be able to progress to the next stage and raise subsequent funding. We ended up hedging ourselves - attempting to limit the downside in the case the upside didn’t work out, attempting to have multiple stories and metrics on which we could raise if we didn’t hit other targets. Predictably, there’s no such thing as a free lunch - we simply ended up in no-mans’ land with our straight C grades - no massively scaling user base on the social side and mediocre numbers on the business model.\n\nWe fell into this trap in part though the history of the company: we spent the first years of the company building a smaller business with mentors and investors focused on safety and predictability of building a solid company. Our ambitions led us to raise a VC round where the game becomes the go-big-or-go-home play (aka. throw-stuff-against-the-wall-and-see-what-sticks..). Not to say that either would have been a better or worse path to choose, but our mistake was not to make the jump to a boom-or-bust game fully, and instead get stuck in in the middle - a murky territory without clear strategy where every decision feels at odds with another, and our hedging to limit the downside definitely held us back from achieving the upside.\n\nIt follows on from the points above, but we most definitely committed the all-too-common sin of premature scaling. Driven by the desire to hit significant numbers to prove the road for future fundraising and encouraged by our great initial traction in the student market, we embarked on significant work developing paid marketing channels and distribution channels that we could use to demonstrate scalable customer acquisition. This all fell flat due to our lack of product/market fit in the new markets, distracted significantly from product work to fix the fit (double fail) and cost a whole bunch of our runway.\n\n- Moving too slowly after we raised our Series A\n\nIn hindsight it’s painful that we were not up to speed with the full team we wanted to hire until a full 8 months after we closed our VC round. We proudly described how we’d spent 3 months “learning how to hire” - by doing everything we could to learn from others, interview carefully and ensure we hired the right people. “Hire slow, fire fast” was the advice on many a respected startup blog. Well, not to add to the problem - but as I now know: “hire fast, fire fast” is for sure the better plan.\n\nNothing struck me as such a comparison as when a friend more recently made a hire for her startup on the spot after an interview that went well, extended to 90 minutes and then - done. When I mentioned this to her she said simply “I need to hire 20 people in the next month”. Granted not how it goes in every situation, but another piece of advice I would give my earlier self would be to trust my gut sooner without dragging out an interview process to multiple rounds as standard or because “regardless, we should spend some time making this hire to see who else comes along”.\n\nWe should have closed our round being able to name the 3 people we wanted to hire next, and being moving forward producing product and traction with a full team (not necessarily large, but balanced) within 2 months. At the time it was easy to feel like all our time on the meta-aspects of building a company was well spent. But for too long we were not 100% focused on the only things that ultimately mattered - customers, product/market fit, traction - and all the while our monthly burn was - well - burning.\n\nWhat we did right\n\nDespite all the above, we certainly did a number of things right. You may note that nowhere have I mentioned the key ideas behind GroupSpaces as among the things I consider mistaken. With GroupSpaces we have provided a great product that provides significant value to our many loyal users, and more continue to sign up as customers each day. I still believe a place exists for GroupSpaces or a similar service to scale to serve the market of the millions of membership organisations that currently rely on the unhappy marriage of a Yahoo/Google Group coupled with an Excel spreadsheet/google doc for member records, in addition to their own website and other services for events or payments.\n\nI hope to write more about my learnings as time allows, but for now it just remains for me to restate my heartfelt thanks to those who have supported us in the journey with GroupSpaces, and look forward to what the future holds for both GroupSpaces and Stripe."}