{"title":"Travelllll Post-Mortem","favicon":"/favicon.ico","description":"","lang":"en","canonicalLink":"http://john.onolan.org/travelllll-post-mortem/","tags":["Startup Life"],"image":null,"videos":[{"src":"//player.vimeo.com/video/39255851?title=0&byline=0&portrait=0","height":"337","width":"600"}],"text":"Every story has a beginning, a middle and an end. While Ghost is very much at the beginning of its journey, a few months ago I closed the book on my previous venture: Travelllll.com. As a culture obsessed with success stories, I think there's a great deal to be learned by sharing the stories which don't have such happy endings.\n\nA few weeks ago I read an incredible startup post-mortem by the team at FlowTab, an iPhone app for ordering drinks at a bar. They analysed their successes, their failures, and the reasons for their ultimate demise. They also proceeded to Open Source their entire codebase so that their two years of work would not go to waste.\n\nToday I'm going to try and do the same.\n\nI appreciate that , , most of you reading this will never have seen or even heard of Travelllll.com - so, let's start with some context.\n\nIn the summer of 2010 I was doing a lot of work in the travel industry. One client lead to another, and my most recent piece of work had been to build the travel blog for one of Virgin Atlantic's latest digital ventures. Having completed the site, Virgin invited me to attend a press trip on their behalf and write about it on the blog I'd created for them. The deal was a 1-week, all expenses paid, 5-star trip to Valencia, Spain - and a free ticket to the Formula One Grand Prix. Not a hard decision.\n\nOn this trip I met a fantastic group of people and discovered that the travel industry was, in effect, trying to catch up with the rest of the world when it came to social media. I was on the trip with a group of about 18 travel bloggers and representatives from Spain's tourism department, all discussing how this \"social media stuff\" was the next big thing.\n\nNow, as a web designer in mid-2010, I was already pretty bored with Twitter. It was already what I refer to as \"Post Vaynerchuk Era\" - where mainstream social media had pretty much peaked... But these guys seemed to be just catching up to it.\n\nOver the following year I attended (on my own this time, rather than for Virgin Atlantic) many more of these types of trips - and spoke at a great deal of conferences about social media, customer service, marketing and - of course - WordPress, in the travel industry.\n\nBy summer of 2011 it seemed like the travel industry had barely moved along at all - but I'd met a good bunch of other people who seemed to \"get it\" and were moving in the right direction. It seemed obvious to me, at the time, that what was really missing from this industry was a Mashable. A site to cover the technology and startup trends within the travel industry and promote new media to an industry very much stuck in tradition.\n\nI made some mockups, talked to a few other people about the idea, and a couple of months later we launched Travelllll.com.\n\nThe first few months of the site went reasonably well. Traffic was decent and, because the travel industry was scrambling to find any way of \"engaging with new media\" it was very easy for us to do some small partnership deals with big brands. By the end of the year we'd worked with Expedia, KLM, Travora, TravelZoo, Guoman Hotels, Four BGB, World Travel Market, TBEX, and countless tourist boards.\n\nAfter that, we just didn't grow. We had a small but loyal following of [every travel blogger in the world], which consisted of roughly 5,000 people - being generous. We had the digital \"travel inspiration\" market covered. The commerical/financial/booking side of the market was already being covered by a competitor, TNooz, and the harsh reality was that we didn't really have anywhere to go.\n\nSo we pivoted. Several times.\n\nOne thing we tried was to offer a kind of real-time tracking service for all the press trips happening around the world. This was an interesting use of technology, but even if it had been much more developed than it was - there was still no real audience for it.\n\nOther things included a jobs board, to help travel brands and travel journalists connect with each other. A tourism guide, to try and create a sort of international directory of tourism boards - Our own events and press trips - and our own video/media coverage of conferences and press trips.\n\nThe last one was probably the most fun, but again, it was entirely pointless due to there being no real audience for it.\n\nBy the beginning of 2013 things had reached a head. Several people had left (or given up) after working long hours for many months and not really getting anything in return.\n\nThe people who remained, myself included, were frustrated and - frankly - out of ideas. Our content publication schedule (and quality) had gone down the drain, and our traffic was dwindling.\n\nWe'd made a little bit of money, but really just enough to cover the costs of running the site. Our monetisation strategy had always been to get a fuck-ton of traffic and then put ads on the site but, as you may have noticed due to repeated mentions, there was no real audience to get this traffic from. This was when we eventually realised the great truth. The thing we missed right from the start.\n\nTravel isn't just lagging behind other industries when it comes to social media because it's a bit slow to catch on. It's a fundamentally different market. The average consumer - not including business travel - purchases travel related products just once or twice a year. Compare this to the other industries where new media has been successful and the difference is overwhelming: Tech, food, fashion, publishing, photography... these are things people do and use every single day. The majority of consumers research travel just once or twice per year before booking a trip - and then not again for another 12 months.\n\nThis is the reason we see a huge amount of failed \"travel inspiration\" startups. I got into this industry through Virgin Atlantic's \"vtravelled\" startup which was a travel-inspiration app which ultimately shut down.\n\nThe same thing has been repeated over and over again by others like Trippy which has pivoted 3 or 4 times now (despite millions in VC funding) due to not being able to find a big enough market. There was also Gowalla - which went for a travel-inspiration angle where Foursquare went for a social paradigm, and eventually shut down and had its staff merged into Facebook. But people keep spotting this \"gap\" in the market and chasing after it, and travel blogging falls into the same space. Trying to provide \"travel inspiration\" and encourage people to want to travel.\n\nThe reality is that most people don't make a hobby out of travel. It's pretty expensive, and it's pretty hard to fit in around work. People take a holiday - and then they don't think about travel again until the next holiday. Eventually we accepted that we were trying to write about and cover the \"news\" in a tiny market which was simply never going to get any bigger.\n\nWe didn't know what traction was, and by that measure we didn't know that we didn't have any. Our first media pack boasted our \"10,000 page views in just 48 hours of launch\" and our monthly traffic was 3-4x that of any travel blog we knew about. We knew we were a big fish... we just didn't know how small the pond was. For reference, Ghost got roughly 300,000 page views in its first 48 hours, and by the end of its first week it had accumulated more traffic than T5 got in its entire 2 year lifespan.\n\nIf your montisation strategy is advertising, you need to be marketing to an enormous audience. It's possible to make a little money from a lot of people, or a lot of money from a few people. Making a little money from a few people doesn't add up. If you're not selling something, you better have a LOT of eyeballs. We didn't.\n\nRunning a magazine/news site is hard. Probably the biggest hurdle between us and publishing quality content, more often, was struggling endlessly to find an effective editorial workflow. It was incredibly, incredibly hard to commission, manage, and edit multiple authors through WordPress. Ultimately, this frustration was one of the largest catalysts that lead to me starting to talk about and write about the idea for Ghost. (Silver lining)\n\nWhen you don't know an industry, it's very easy to spot a gap in it. It took us (largely people from a tech background) two years to fully understand the market we were entering. When we did, we realised that the gap we were trying to fill didn't actually exist. If you haven't been working in an industry, full time, for more than 24 months - it's pretty safe to say you probably don't understand it. Think carefully about that before you dive into your \"I can't believe nobody has done this yet\" startup idea.\n\nModerate success is worse than failure. This is the most important lesson that I learned from the entire venture, summed up perfectly by Dustin Curtis:\n\nIt took us forever to realise that we weren't actually as successful as we thought we were. I think the same is true for many others in this space.\n\nIt's not so much a question of what I'd do differently so much as it is a one of whether I'd do anything at all. Probably not.\n\nThere are interesting gaps in the travel market, but \"trip inspiration\" via social network, blog, or app is not one of them. If I had to focus on a space in the travel industry right now, it would be one of two choices:\n\nActivity based travel. There's a growing market of people who travel as a means to do an activity. They may not search for travel inspiration every day, but they do obsessively search for \"the best places to… [activity]\" every. Single. Day.  Eg. Kiteboarding, surfing, golf, rock climbing, skydiving, scuba diving, paragliding. The list goes on. These people have money, and they will travel to do these things.\n\nDestination based travel guides. Most travel bloggers right now market themselves as the brand, and the destinations they go to as the content. This doesn't work, because consumers don't research \"places Tom has been\" - they search for \"[place] I want to go\". A travel blog where the destination is the brand and the blogger is the content might work. A new-age, expert guide to a specific location could quite easily become the go-to resource for people researching that destination. A destination blog, rather than a travel blog.\n\nDespite not finding an audience, and ultimately closing down - the design and development work which I did on Travelllll.com remains one of my proudest accomplishments.\n\nIt was an incredibly powerful WordPress site with functionality that put it on a technical level equivalent to some of the biggest news/magazine blogs out there.\n\nToday I am making the Travelllll.com theme (which basically housed both the design and functionality of the entire site) available for free to everyone under the GPLv2 license.\n\nDownload it here on Github\n\nPlease note, however, that this is not a usable theme which you can simply drop onto any WordPress install. It is not user friendly - it is not set up to \"just work\" on any site. This is the theme in the exact state it was in when it was running T5. Some references are hard-coded, others require configuration. This theme is most suitable to WordPress developers looking for a base to start with when building a magazine/news site.\n\nIt also contains a lot of incredibly handy individual functions (in functions.php) which can be re-used individually. Some written by me, some written by others, and a few even written by a couple of the lead developers of WordPress.\n\nI hope some of our two years of hard work can live on and help someone else. It was a fun ride."}