{"title":"Postmortem Of My First Company (A Reposting)","favicon":"http://33.media.tumblr.com/avatar_092192e32fe2_128.png","description":"Postmortem Of My First Company (A Reposting) I was going through some old stuff in Evernote and came across the postmortem I wrote after shutting down my first company in 2009. In changing blogs and...","lang":"en","tags":[],"image":"http://assets.tumblr.com/images/og/text_200.png","videos":[{"src":"http://assets.tumblr.com/assets/html/like_iframe.html?_v=1af0c0fbf0ad9b4dc38445698d099106#name=keithbnowak&post_id=55830173333&color=black&rk=SNHUgafR","height":"16","width":"16"}],"text":"Postmortem Of My First Company (A Reposting)\n\nI was going through some old stuff in Evernote and came across the postmortem I wrote after shutting down my first company in 2009. In changing blogs and platforms over the years it somehow got dropped off at some point. Figured I’d repost it. It is less relevant now for the lessons learned (I hope I’ve internalized all that by now) and more interesting as a reference point for how much I’ve evolved as an entrepreneur. It’s also funny to see just how much culture/the internet has changed over the past four years. Much of what we thought was so important then, is no longer relevant at all.\n\nIn December 2009, I made the incredibly difficult decision to shutdown imercive. Three years, a lot of money, and all my passion had been invested in this company but it ultimately was not going to be the success I had envisioned. Although we failed in the end, along the journey I learned more than I ever could have imagined about startups, entrepreneurship and myself. The purpose of this postmortem is to thoroughly reflect on what went wrong so I, and perhaps others, will not make the same mistakes again.\n\nFor those unfamiliar with imercive, we were a social media marketing company that provided branded instant messaging applications as new touchpoints for consumer engagement. As the web has become more distributed, brands have had to respond by reaching out and connecting with their consumers in new places and in new ways. Examples of this include brands using Twitter profiles, Facebook apps, widgets, and a number of other approaches to distribute their content, message, and services to where consumers are spending time. With hundreds of millions of IM users, I saw an untapped opportunity for brands to extend their distributed web presence to IM and allow their consumers to add them as buddies. The thought was that this IM touchpoint would enable an entirely new level of consumer engagement and provide an extremely convenient way for users to interact with brands in a wide variety of ways including accessing information, receiving updates, and even making purchases. Additionally, we saw branded IM applications as a solution to the longstanding inability to adequately monetize IM despite the incredibly large number of users. Since people are on IM to chat and not to click on ads, we believed letting users chat with brands would be a perfect way to create a valuable advertising opportunity on IM.\n\nWe were able to make some good progress integrating our vision into the larger trend of distributed touchpoints for brands but in the end we were not able to generate enough traction before running out of capital. There are a number of different ways to classify our failure but the best way to think about it is that we got caught mid-pivot.\n\nLike most startups, where we started was not where we ended up. The first concept was to use IM as a new channel for placing orders from local restaurants. The thought was that IM could provide real-time order confirmation and updates to customers while further increasing efficiencies for the restaurants. We raised a $500,000 seed round for this idea and planned to prove the concept through a pilot program with local restaurants. Our ultimate goal was to partner with companies like SeamlessWeb.com and Point of Sale providers to incorporate a new ordering channel into their products. The pilot program we started with 20 restaurants in the Boston area ended up being much more expensive and taking considerably longer than anticipated. After just over a year of trying nearly every conceivable idea to make this pilot program work, we eventually concluded we were not getting the proof of concept we needed to continue with this strategy and needed to pivot.\n\nShortly after launching the company I began thinking bigger about my vision and the technology. This type of real-time engagement with users via their IM buddy lists seemed to be a powerful new marketing opportunity that could be bigger than just restaurant e-commerce. Therefore, our new strategy was to provide IM apps to any brand looking to create further engagement with their consumers in the places they are spending time. We modified our technology to be a very flexible and scalable platform from which we could launch any type of application, for any client, in any industry. We thought we could position our solution as helping brands create a comprehensive distributed touchpoint strategy by complementing their presences on Facebook and Twitter with a presence on IM. The plan was to partner with marketing agencies as well as sell directly to clients similar to the approach taken by providers of custom branded widgets, Facebook apps, and mobile apps. This strategy eventually produced some great results but it was a case of too little, too late.\n\nWhen we finally decided to pivot we had already spent most of the capital raised in our seed round. To properly go forward with our new strategy, we needed to raise more money. However, our current investors were not able to participate in another round and we did not have any demonstrable results or traction for our new strategy which made finding additional investors quite difficult. We were caught mid-pivot – half way between a strategy we knew wouldn’t work and one which we believed could be successful but was not able to be aggressively pursued. This was a very difficult place to be both professionally and personally. We were extremely frustrated at not being able to properly go after our new strategy and every day that passed without meaningful progress was one step closer to the failure of my first company. Even though we put everything we had into getting through this phase we were never able to make it through the pivot.\n\nLooking back there were many interconnected mistakes, decisions, and circumstances that contributed to us getting caught mid-pivot. The following is an attempt to identify and analyze these factors.\n\nI once read a characterization of startups by Dick Costolo, co-founder of FeedBurner, as going down many dark alleys only to find they are dead ends. In my opinion, dark alleys need to be navigated anywhere there are unknowns and a large possibility of making mistakes. This can include the overall business strategy, the product roadmap, coding decisions, and the marketing plan. The key is to realize which ones are dead ends quickly so you can try something else. Exploring each dark alley takes time and money so the number of mistakes that can be made is more or less fixed. There comes a point when you have run out of the time and money for more attempts. Getting through the dark alleys before it is too late requires concerted dedication to going through the process of attempting, learning, and correcting as quickly as possible. This may seem rather obvious but in the middle of running the company it always felt like we were moving a million miles per hour. There was always a feeling of energy and urgency. The last thing we needed to worry about was moving quickly. However, looking back we moved too slowly when it came to a few very important things.\n\nFor one, we stuck with the wrong strategy for too long. I think this was partly because it was hard to admit the idea wasn’t as good as I originally thought or that we couldn’t make it work. If we had been honest with ourselves earlier on we may have been able to pivot sooner and have enough capital left to properly execute the new strategy. I believe the biggest mistake I made as CEO of imercive was failing to pivot sooner.\n\nOn the software development side, we made a few mistakes that exacerbated the already slow and difficult process of creating something that has never been done before. The first version of the product was built by a contract developer as the result of inexperience and not fully understanding the importance of having a technical co-founder. Using a contract developer at this stage resulted in extensive delays in development which extended the time it took us to realize we were not pursuing the right strategy. We eventually brought on a CTO but a lot of time and money had already been wasted. Even after we hired a CTO and decided to pivot, product development took longer than it should have. At this point though, it was a resources issue. We could have moved significantly faster if we added a couple more developers but at the time that wasn’t an option for us.\n\nMarketing and sales should have also been started sooner than it was. While the technology was being modified for our new strategy I should have spent more time speaking with potential clients. This would have helped us focus our product roadmap based on what mattered most to the clients and would have also given me a list of developing sales leads once the product was ready. One reason for the marketing delay was fear of presenting a less than perfect product. However, it would have been far better to go out with a less impressive version in order to gain the invaluable insights only potential clients can provide. The thought at the time was only to show our technology when it was finally perfect but I know now that this is a terribly bad decision. Building a good product is obviously important but distribution is what really matters and this can only happen if you get out there and talk to potential customers.\n\nRamped up too quickly for the wrong strategy\n\nIncidentally, one area where we did move quickly was in ramping up to pursue of the wrong strategy. This cost us considerable time and money which we could have easily saved with a bit more patience and foresight. We were fortunate to have a relatively easy time raising our seed round so we had more than enough capital at that time. Instead of focusing first on proving the concept as quickly and inexpensively as possible, we made two unnecessary hires, created expensive marketing materials, and purchased hardware for a much larger pilot program than we were currently working on. In retrospect this money should have been conserved for when we really needed to ramp up after we identified and pivoted to a bigger and better opportunity.\n\nThe nature of our business model involved very long sales cycles because 1) we were working off budgets and campaigns that were planned months in advance, 2) we were trying to close deals with large companies that typically take a very long time to make decisions, and 3) we were providing custom solutions which required effort on the part of the client.\n\nThere wasn’t much we could do to change this but we could have been better at dealing with it. Ideally we would have been able to properly capitalize the company given the length of the sales cycles but unfortunately that was not possible. What would have been possible though was to avoid getting tied down by these long sales cycles by creating a self-serve product. This was always something we had on our product roadmap but we planned to build it once we had gotten traction by building custom applications.\n\nGiven our team and capital on hand we should have reversed this strategy. By building a basic self-serve product first we would have lowered the barrier to entry for potential clients and created an easier way to create a name for ourselves in the market. The main hesitation for making this shift was that we would be giving up the possibility of an immediate revenue stream. Even if the self-serve product caught on quickly it still would not have generated significant revenue immediately. The perceived benefit of selling custom applications was that we could propose larger costs and, if sold, would generate revenue immediately. At such a low burn rate one deal would have covered most of our expenses. This theory however didn’t end up being true since to close deals with Moviefone and Hershey’s we had to drop our prices so low that we barely broke even.\n\nIn order to properly pursue a self-serve strategy we would have had to release a product earlier on when we were more flexible with the timeline for generating revenue. Not making this decision is the second biggest mistake I made as CEO. I should have been able to see this was the right way to proceed as it is now so obvious but I guess the saying about not seeing the forest for the trees is a cliché for a reason. I think there is a tendency in a startup to focus so intensely on a particular goal or direction that sometimes big, obvious things are missed. Like most things, this balancing act is improved with experience and I know I will be much better at this the next time around.\n\nA market opportunity does not necessarily equate to a market need\n\nWhen starting imercive, I saw the lack of a branded IM solution as an indication that one was needed. I still believe that on a high level the idea makes sense but the market has clearly spoken and it apparently does not seem to share my views. That said, everyone I met with was very enthusiastic about the idea but much less so when it came to the actual implementation. I take this to mean that there is a difference between an interesting opportunity in the market and something that the market truly needs. The difficulty is that the only way to figure this out is to ask the market by actually releasing a product. No amount of customer surveys or reflection can provide the answer. As many others have said, the trick is to figure this out as quickly and cheaply as possible. We certainly failed on both the quickly and cheaply parts. I don’t think this means you should give up early or not try every conceivable idea to make your company successful, but simply that the sooner you figure out how/where to achieve product market fit or that this is not possible the better.\n\nAnother difficulty here is that being first and having no competition looks fantastic at first glance because you feel like you have discovered something no one else knows about. However, sometimes there is a reason no one else is around. What’s important to distinguish though is if you are pursuing a market opportunity that really isn’t needed or if you are actually first to figuring out a real market need. Any innovation is going to be first in a number of respects but some end up being really needed and others just remain interesting ideas. I don’t think there is any magic way to make this distinction because of the large number of factors and variables involved. Then again, this is one of the most exciting things about starting a company.\n\nEvery company has different funding requirements depending on variety of factors (idea, market, sales strategy, etc.). The proper amount of capital and the corresponding funding source (i.e. bootstrapping, angel, or VC) is extremely important. Getting this wrong makes it incredibly difficult, if not impossible, to even have a chance for success.\n\nBecause we couldn’t raise the capital we needed for our new strategy we had two choices: quit or bootstrap. Since quitting at that time wasn’t really an option we decided to bootstrap. Bootstrapping the company really taught me a lot about getting things done cheaply and sacrificing for a goal but it was not the proper way to fund a company such as ours. There were no salaries paid during this time (about 2 years) and in the end I even took a part time job and sold my car to help cover some of the bills. Despite all of our efforts and personal sacrifices, we were always going to be significantly underfunded for what we were trying to do.\n\nWe were competing with all the other ways brands could spend their marketing budgets and other companies providing distributed brand touchpoints had raised millions in venture capital, had large sales teams, and were attending all the important conferences. Even without all the right pieces in place we were able to close deals with Moviefone and Hershey’s and develop partnerships with AOL, OMD, DDB, Arnold, and Meebo. Although these were significant accomplishments for us at the time they would not be enough sustain the company.\n\nAlso, without money in the bank we were limited with the risks we could take. Everything had to be revenue generating immediately and when trying to sell a new idea this is a hard thing to ensure. It would have been great to give away our technology to a few big brands, develop case studies, and use this traction to convince other brands to pay us. We didn’t have the time to do this. Instead, we had to charge any potential client without any real proof that this would be money well spent. Clearly this was a big turn off.\n\nWhile it is impossible to say if we would have been able to raise the necessary capital, I think we would have had a much better chance of doing so if we had not made some critical mistakes in the fundraising process.\n\nFor our seed round we knew we didn’t have any clout that would help us raise money from big investors so we worked with a number of smaller, “friends and family” investors. This is a source of funding for many startups but it always helps to have one or two initial investors big enough to participate in the next round. When we pivoted, all of our initial investors wanted to help fund the new strategy but were not financially capable of doing so. We may not have been able to do so at the time but looking back I should have tried to get some larger investors on board or at least interested in the company earlier on.\n\nI only began reaching out to larger investors when we really needed some big money after we decided to pivot. I naively thought I could meet with a few venture capital firms, they would see value of the company, and invest the required capital in a relatively short period of time. While I am sure this does happen, a much better strategy would have been to begin building relationships with VC firms early on and keep them up to date on our progress. We spent months trying to raise a round while time continued to pass and our need for capital grew more urgent. If we started earlier, we would perhaps have been further along with some firms and able to raise money when we needed it.\n\nIn the end, even if we avoided the aforementioned problems, there were still strong external conditions playing against us. First, we were trying to innovate in an area that has been static for a long time. There have not been many new developments in how IM is used and as such people were not open to innovations on this channel (even the big IM providers). It was always difficult convincing marketers that they should be investing in a presence on IM because it was not seen as new or exciting. Even though IM is one of the first and largest social networks it has never been put on the same level as Facebook or Twitter despite our best efforts to evangelize its capabilities as a marketing channel.\n\nSecond, we began approaching marketing agencies and prospective clients with our new strategy just at the height of the recent financial crisis. Marketing budgets were being cut drastically and one of the first areas to be reduced or removed was new or experimental programs. This was just a case of bad timing that we could not have anticipated. If we had been better capitalized we may have been able to last through these hard times but as a bootstrapped company looking to grow organically our chances of success were significantly reduced as a result of the budget cuts.\n\nIt has certainly been tough to accept that we couldn’t make it but I am so thankful for being able to have this experience and for everyone who helped us along the way. Failure is a great teacher and I know I will never forget the lessons I have learned as a first time entrepreneur. This has been a very difficult journey but also incredibly fun at every step along the way. I am looking forward to applying the lessons I learned the hard way in my next company and in whatever challenges I face in the meantime.\n\nPlease enable JavaScript to view the comments powered by Disqus."}