{"title":"On-Q-ity, a Cancer Diagnostic Company: R.I.P.","favicon":"http://lifescivc.com/wp-content/themes/lifescivc/lifesciVC_favicon.ico","lang":"en","canonicalLink":"http://lifescivc.com/2013/04/on-q-ity-a-cancer-diagnostic-company-r-i-p/","tags":[],"image":null,"videos":[],"text":"Not every deal is a winner, and unfortunately On-Q-ity wasn’t.  After a few years of hammering away at its diagnostic business case, the board decided to wind the company down back in November and we are just completing the sale of the remaining intellectual property assets.  I’d prefer to be writing about great exits, like Avila or Stromedix, but think the lessons from deals that don’t go the way we hope are equally if not more instructive.  So where did On-Q-ity go wrong?\n\nLets start with some background.  On-Q-ity was formed in 2009 through the merger of two predecessor venture-backed diagnostic companies, Cellective Dx and DNAR (DNA Repair Inc).  This Series A round was $26M and had four VCs: Mohr Davidow Ventures led the round (and was the lead investor in the prior entities), and Atlas, Physic, and Bessemer all participated.  I looked back at my December 2009 investment memo, and these were the key reasons to invest:\n\n(a)   “Hot space at nexus of two exciting themes in cancer and personalized diagnostics”: DNA Repair pathway tissue-based biomarkers for drug response prediction in breast and lung cancer; and, a circulating tumor cell (CTC) capture and characterization platform.  These technologies had lots of potential to change the treatment paradigm in a number of cancers, and its fair to say that CTCs have only gotten more interesting over time\n\n(b)  “Strong team with a track record in building diagnostic businesses”, hailing from Genzyme Genetics, Myriad, Genomic Health, Dana Farber, etc… We also had a great board, including a former President of Affymetrix as the Chairman.  At the outset, it looked like a great team and syndicate for Dx startup.\n\n(c)   “Robust financials with attractive recapitalization” at a good valuation (the $31M invested in the prior two entities was recap’d into\n\n(d)  “Very strong intellectual property”, especially in CTCs, which actually got stronger over the past few years; and\n\n(e)   Perception of “multiple possible exit paths via either diagnostic or oncology-focused pharma M&A or possible IPO”.  Unfortunately none of these materialized.\n\nI also flagged a few potential risks in the 2009 memo: the biomarker technology needed clinical trial validation, CTCs could be a research-phase money pit before the market matured, execution against the aggressive plan was going to be tough, merging management teams and technologies under one roof is not easy, etc…   At the time, I judged most of those risks to be manageable.  Well, let’s just say I got the risks right but their magnitude wrong – these risks became the big factors that brought down the company.  Here’s the short story:\n\nBy mid-2010, only six months after the Series A came together, it was clear that the DNA repair biomarkers were going to be tough, as an early trial failed to reproduce the nice Kaplan-Meyer curves of the original academic work.  By late 2010/early 2011, two more larger trials read out negatively so we decided to terminate that effort.  But unfortunately those trials and the biomarker lab work required to support them consumed 60%+ of the capital in the Series A round.\n\nNot much had gone into the CTC platform in that first year and so early in 2011 the company refocused exclusively on CTCs and streamlined the team, but the clock was ticking.  As we dug in to the status of the CTC platform, it was very clear that lots more work needed to be done – the paper descriptions of what it was supposed to deliver didn’t map to the platform’s actual robustness (or lack thereof) at that time.  Antibodies that were supposedly functional turned out not to work, and several other things like this.  An early LabCorp partnership fizzled because of this realization.  Our new CSO and the R&D team rebuilt much of the platform and reagents from scratch, got it up and running in a reproducible and robust manner, validated it favorably against Veridex’ CTC approach with patient samples, and set us on sound technology footing.  It was an impressive technology turnaround, frankly.  But that took a year, and a very precious year.  We were out of money at the start of 2012.\n\nWe also had a revolving door in the management suite during 2010-2011: we lost or transitioned the original CBO, CFO, CSO, CMO, COO, CEO, another CSO, etc… Some of the changes happened fast – within the first 6-9 months – but we didn’t replace them fast enough.  Then as the company’s strategy shifted from near commercial (DNA repair biomarkers) back to R&D (CTC) in early 2011, additional changes to the senior team made sense.  It’s also fair to say the background and experience of some of the team didn’t map well to the high strategic entropy and lack of organizational support common in startup roles.  As you might expect, it’s very hard to stabilize a new technology platform while shifting leadership.\n\nAs 2012 started, we had to make some tough decisions.  We were running out of money in a few weeks and had a limited senior management team, but felt we had a technology that had finally gotten its sea legs and a very good R&D team.  MDV, Physic, and Atlas decided to do a small Series B to carry the company to a CTC partnership (Bessemer dropped out, which history now shows that was the smart move).  We recruited an entrepreneurial executive, Mike Stocum, to lead the company, and hired Foundation Ventures to help him run a strategic partnering process.  Together they did more than any board could ask.\n\nBut at the end of 2012, despite heroic efforts by the On-Q-ity team to keep the technology maturing and an extensive process for a potential strategic partner/acquirer, we were once again low on cash.  And this time we chose to wind down the company in an orderly fashion.  The final sale of assets is wrapping up this month.\n\nWhat are some of the lessons I’ve learned:\n\n* Crashing two Fords together doesn’t make a Porsche.  This is the obvious one.  Recap mergers aren’t easy, and bring all sorts of baggage that make the “attractive” valuation an illusion.  Trying to merge two really interesting diagnostic technologies embedded in two struggling, cash-burning businesses into one company and have it smoothly integrate was a very bad assumption.  The first year gave little airtime to the CTC technology, and we paid the price for it by being behind the eight-ball in the second year.\n\n* Tranche the capital.  I failed to follow my instinct here.  I remember pushing hard for tranching back in 2009 as the round came together, but ended up going along with the full raise against my better judgment (in part because the first $21M had already been wired).  I violated the axiom that if a technology can be validated on a smaller financing, it should be.  It gets back to our mantra at Atlas of Prove-Build-Scale.  Instead of raising a “Build-stage” $26M Series A without any tranche or milestone points, we should have broken up the capital to Prove the story first.  Sadly, we knew within months that the DNA Repair story was going to be an uphill battle.  I remember the late 1Q 2010 board meeting well: the initial trial data were far from clear, but clearly far from what we had all hoped for.\n\n* Team, team, team.  If we had in place a stable management team from the start, things might have been different.  There were questions about how to integrate the different management team members right at the start of the deal in fall 2009, and we ended up with the revolving door I mentioned.  This leadership flux kills startups, and certainly was a big part of the mortal wounds we had at On-Q-ity.\n\n* Getting the technology right, but the market-timing wrong, is still wrong, confirming cliche about the challenge of innovating.  The capture and characterization of CTCs will be an important part of oncology care in the next decade.  This I’m fairly sure of, and all the news from AACR earlier this week about “liquid biopsies” supports this premise.  But the reality is it’s a research-stage story right now, and in diagnostics (unlike drugs) it’s hard to get paid for research-stage stories.  We may have been right that CTCs are “hot” and will be important in the future, but we certainly didn’t have enough capital around the table to fund the story until the market caught up.  It will be great in 5-10 years to see CTCs evolve as a routine part of cancer care, though clearly bittersweet for those of us involved with On-Q-ity.\n\n* Diagnostics aren’t for the faint of heart and are a much tougher place to make returns today than other life science subsectors.  Despite the frothy commentary about personalized medicine and the dawn of diagnostics, it’s a very tough business that faces many of the risks and costs of drug R&D but without the upside.  It’s often not less capital intensive than therapeutics, faces similar “academic validation” concerns, is confronted by larger reimbursement and regulatory uncertainties, has commodity-oriented high volume, low price demands, and typically needs to get to commercialization before a material exit outcome.  All these things add up for a challenging investment sector.\n\nMy first total write-off in nine years of venture capital.  On-Q-ty, R.I.P."}