{"title":"I fucked up…","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"but I don't regret it.","lang":"en","canonicalLink":"https://medium.com/@barnettlklane/i-fucked-up-d4b39a515c5b","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*RoyhRtFmM4cyqMnpX9mE6A.gif","videos":[],"text":"This past week I decided to stop working on my latest venture, MyManual* (2 years old), in which I did about everything wrong you could do when starting a business;Spent more time worrying about patenting the software before I had customers.Hired numerous friends, then couldn't pay his or her wages.Went through 3 developers in 1 year due to my poor technical management skills.Then spent 6 months developing the application myself without active customers.and the list goes on…“In order to survive got to learn to live with regrets,\n\nOn the rise to the top many drop, don’t forget”- Jay-ZYet as I am working to pay off the never ending bills that this has caused, I can't help but try to see a positive from my past decisions;Networked with people whom I never would have met otherwise (YC Founders, Kairos Society, etc).Taught myself how to code in Ruby on Rails, and picking up Meteor.js.The most valuable lessons I learned are in the form of not repeating previous mistakes. By taking responsibility for each mistake one can change to stand a better chance next time around.It’s so common to see failure followed by depression for entrepreneurs but instead it can be followed by jumping back on, joining a team to learn more, or working on the next idea. Yes, I sure did cause a lot of damage to my credit and first few years of salary, but the only way to progress from my current standing is to keep pushing, learning, and improving.If given the opportunity to change my past, would I?My answer, ‘No, but will I more intelligently begin next time? Hell yes.’If you liked this post and wanna say hey or discuss anything startups; tweet me @barnettlklane, or send an email."}