{"title":"Someone else is building my failed start-up.","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"How I feel about it…","lang":"en","canonicalLink":"https://medium.com/@tomcarra/someone-else-is-building-my-failed-start-up-362826cc23c5","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*CXLzBwN21UCoJMu0XweYjQ.jpeg","videos":[],"text":"Someone else is building my failed start-up. In 2010 I was 20 and like many students, sport was the centre point of my university life. For some people it was the main reason to be at university. Many of my friends got up an unearthly hours in the morning to do a gym session, trained by the best fitness coaches around and travelling all around the country to represent their uni. It seemed that university sport was about as close as you could get to being a professional sports person, without being one.Yet the media coverage was non-existent. There wasn’t any apart from maybe the odd match report in the student paper. This idea lead to me creating UniSport, which went some way to becoming the online home of student sport. You could read, write and watch student sport from across the country. In less than 6 months we were working with 20 Universities, had a bit of money in the bank and ended up spending two years building a great community. In the end we averaged around 2,000 viewers per live match and over 200,000 people used the site.Ultimately we failed, for a number of reasons and I moved into The Eleven.Today, for the first time, I saw someone else had realised part of my vision by creating a place to watch student sport on the web.It feels weird. I kind of have this knot in my stomach whist I type, the one where you’re not really sure if it’s good or bad. This idea that started in my head and became real is now being built by someone else. The start-up that I worked on for 24/7 for two years, that kept me awake at night and left me in floods of tears once I finally let go.What happens if they’re successful? What happens if they build the product I dreamt of? What happens if they build it into a huge business?And you know what, whatever the outcome of these questions; I’ll be ok with. UniSport made me who I am today. It made me realise that you can create opportunities for yourself and meet amazing people. It made me fall in love with technology and start learning to code. It also took me to the lowest and highest points in my life so far. It allowed me to learn more about my self than I ever felt I could and most importantly, it stopped me going into corporate finance!I now realise the thing I love doing the most is building things. I’m lucky to work in an environment that allows me to develop my ideas with some hugely talented people everyday. I couldn’t be happier and more excited for the future.It feels odd that someone else is working on a similar start-up as I once had, but it’s not my start-up anymore. It’s theirs. In fact, their vision is probably completely different from what mine was. I let that go and I don’t have many regrets about that.Hell…I think I even want them to succeed. When I was a student, I wanted a place where I could watch university sport on the web so good luck to BUCS and AllUKSport. It’s their job to create that now. I hope they pull it off and if I can help by passing on what I learnt, just let me know.Someone else is building my failed start-up and I hope they make it a success."}