{"title":"Postmortem of a Venture-backed Startup","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"Lessons Learned from the rise and fall of @Sonar","lang":"en","canonicalLink":"https://medium.com/@brett1211/postmortem-of-a-venture-backed-startup-72c6f8bec7df","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/0*RXCE7nq5eOFcMUDx.png","videos":[],"text":"Lessons Learned from the rise and fall of @SonarFor those unfamiliar, Sonar Media Inc. was a mobile app created to help make the world a friendlier place. Our mobile app buzzed in your pocket when friends were near and ushered in a new wave of “Ambient Social Networking” companies. Downloaded by millions of people all over the world, Sonar was promoted by Apple and Google in 100+ countries, won numerous awards such as runner-up at TechCrunch Disrupt and Ad:Tech Best Mobile Startup, raised nearly $2,000,000 from prominent angels and VCs, and was featured on more than 300 publications including the New York Times, CNN, CNBC, TechCrunch, and TIME.And yet, we failed.We did lots of things right and lots of things wrong at Sonar. Below I do my best to share a few of our lessons learned.We launched Sonar with Facebook, Twitter, and Foursquare support. Shortly thereafter, users buffeted us with requests for Linkedin integration. Ostensibly, they wanted to use the app to meet fellow professionals.Eager to please, we rushed to add Linkedin. The net effect? Nada. My guess is that the people asking were not actual users, but rather people that “wanted to be” users. We had mistaken noise for signal.“I would use your product if only you had X feature” is a dangerous signal to follow. Users do their best to anticipate what they want before they’ve seen it but, like entrepreneurs, they are often wrong.Enterprise companies should validate demand by asking customers to put their money where their mouths are. Media and social networking companies should double down on analytics to find, observe, and build for actual user behavior.One of the most requested features was a “map like foursquare” for our check-ins. Instead, we appended a simple “@Sonar” to content that users shared from our app. Although we had designs for a map, we never got around to building one. We were too busy building the future of ambient social networking!Mistake. People didn’t like the bland “@Sonar” text string so they stopped sharing updates from Sonar. Their friends never engaged with our updates in the first place. Facebook noticed this and started hiding our posts. Instead of optimizing for actual user behavior, we spent countless whiteboarding sessions trying in vain to design an alternative.You are probably not the Steve Jobs of ______.Removing friction from existing user behaviors (e.g. checkins) almost always has a higher ROI than building castles in the sky (e.g. hypothesizing about your API). Find all the dead ends/local maxima in your current products before building new ones!We received conflicting advice from lots of smart people about which is more important. We focused on engagement, which we improved by orders of magnitude. No one cared.Growth is the only thing that matters if you are building a social network. Period. Engagement is great but you aren’t even going to get the meeting unless your top-line numbers reach a certain threshold (which is different for seed vs. series A vs. selling advertising).Things I Wish I Spent Less Time On“Focus is saying no to 1,000 good ideas.” — Steve JobsI realized the error of my customer acquisition strategy as I awkwardly made my way through a small Meetup I had just pitched. It was 11pm on a Tuesday, I was exhausted and still had real work to do once I got home. Yet there I was, in a shitty bar trying not to skewer anyone with my Sonar sign as I dodged person after person asking me to install THEIR app.Events are for research, business development, and hiring; NOT for getting to 10,000,000 downloads.When MTV, Kraft, Digitas, and the like reached out to us we weren’t sure what they wanted. It took us at least 10 meetings to realize that, rather than delivering us millions of their customers on a silver platter, they were keeping tabs on us so that they could get access to OUR audience if we ever took off!Be polite, but postpone brand and agency “intros” until you’ve built your own audience. If you build it, they will come (and pay).Corollary: Investors know this. You sound stupid when you talk about your impending “big deal” with “XYZ brand” that’s going to drive massive customer acquisition and revenue.In the winter of 2011, we signed a partnership w/ Wired magazine to demonstrate our technology by providing visitors of their Times Square popup store with personalized in-store product recommendations.That “small side project” cost us 6 weeks of development and delivered no appreciable benefit other than getting to hang out with the cool people at Wired.You do not have 20% time. Identify your top three priorities. Throw away numbers two and three.In the run up to SXSW 2012 when the insider media had fabricated Highlight as heir to the throne and some of our more fair weather investors had written us off, my confidence was against the ropes. We reordered our roadmap to rush out comparable features but were now BEHIND. I put on my best brave face but inside my gut was rotting away. I still remember thinking on the flight to Austin “fck, we had it, and now we are going to lose it.”Oops! Highlight never went anywhere but we definitely wasted a ton of energy and sleep “responding to the threat” when we should have been figuring out how to make our own business work.Be steady at the wheel. The only way one startup can kill another startup is by getting into the other’s head and leading them off a cliff.If you don’t believe me, try this proof. Are your competitors releasing a bunch of the same features that you have on your roadmap? Yes? Do you know what consumers want*? No? Great, then neither do your competitors. Get back to figuring out what users want!*Hint: If you did, you would already have traction.When the ambient social networking space iced over in the spring of 2012, Sonar’s controlling investors decided it was time to “flip the asset.” They connected us with a daily deals company looking for “Big Data” solutions. We stopped working on the app and devoted all of our resources to repacking our backend technology to solve BigCo’s problems. Instead of paring down expenses to extend our dwindling runway, we piled on hires and ramped up our infrastructure.The daily deals space imploded but we spent nearly nine months, dozens of meetings, and several hundred thousand dollars “selling” Sonar into a company that nearly went bankrupt.Companies don’t get sold, they get bought. The best way to get bought is to build something of value. That’s hard to do when you are trying to sell.We built Sonar out of an incubator that I helped launch in 2010. To be absolutely clear, the incubator was instrumental to getting Sonar off the ground and helped us considerably along the way. Unfortunately, there are a number of structural issues facing incubators and the operators they employ. I address some of these below.The decoupling of responsibility from control created ambiguity and confusion, tension and frustration for all parties. From day to day decisions such as negotiating an employment contract to company defining ones such as when to sell the firm, alignment was a constant challenge. Occasionally, we were simply at odds.Perhaps the most detrimental aspect of the incubator model was not its potential for hinderance but its facility as a crutch. As someone responsible for building and running a company that I ultimately didn’t control, it was far too easy to point a finger.In my opinion, the most tragic example came when our incubator sat on a financing that would have rebooted the company. After nearly a month at loggerheads, our would-be investors gave us 48 hours to “take it or leave it.” In hopes of saving the company, I made an ultimatum: we move forward together or I would have to walk away. No one budged, time elapsed, and our term sheet evaporated. I resigned as promised, blaming them for killing my baby.As John Burroughs said, “A man can fail many times, but he isn’t a failure until he begins to blame somebody else.” Avoid bad relationships like the plague but when you inevitably find yourself in a difficult partnership, don’t waste precious energy wailing against it. Make it work or move on quickly.“The essence of competitiveness is liberated when we make people believe that what they think and do is important – and then get out of their way while they do it.” — Jack WelchWe lost our first would-be hire, a fantastic Google engineer. While we were debating his contract, he was taking a job elsewhere. Conversely, we hired another, much less proven, engineer on the spot. While he ultimately wasn’t a great cultural fit and we definitely waited too long to part ways, he was instrumental in getting V1 out the door.If you are an experienced entrepreneur with lots of options, by all means, hold out. For most first time entrepreneurs, holding out risks never getting off the ground.In the beginning, established people probably won’t work with you. Prove yourself by finding diamonds in the rough, like yourself. With their help, you can level up your organization and convince the big fish to join.We built an amazing team at Sonar. Everyone was extremely smart, passionate, dedicated, and hardworking. We celebrated milestones with tequila. We hung at the beach. Even when times were tough, everyone pushed as far as they possibly could, and then some. I have big love for all of my former colleagues and am confident they feel similarly.That said, our culture was more of an emergent property than a deliberate choice. Sure, we had brainstorming sessions and posted goals prominently but most of our culture we absorbed from the people with whom we surrounded ourselves.Think of culture as a cofounder that is present when you are not. You are decisive, communicative, and respectful but it’s your culture that helps everyone know how to act when you are out of the room. Give that voice clarity and authority.The trick is to avoid hollow words. Since a startup’s culture ultimately mirrors that of its founder, maybe the best thing that you can do is work hard to get clear on who you are. Write that down and share it with your team. If you’ve been honest, every action you take will reinforce your values.“What we fight with is so small, and when we win, it makes us small. What we want is to be defeated, decisively, by successively greater things.” — Rainer Maria Rilke via Tim O’ReillyStartups don’t die when they run out of money, they die when their founders let go. I ultimately stepped away from Sonar when I came to the conclusion that, despite all that we had invested, everyone stood a better chance starting anew. It’s difficult to accept, but sometimes you have to concede a battle to win the war.I am indebted to the hundreds of people that invested their sweat, money, love, and/or time into Sonar, be it three years of labor or a casual phone call. Special thanks to my amazing team, faithful advisors & investors, and supportive family & friends. Finally, huge shout out to the millions of users that gave Sonar a shot. Your stories about meeting your boyfriend on Sonar made it all worthwhile.We started Sonar with a belief that everyone has the potential to be amazing and that technology can unlock that potential. My experience at Sonar has only strengthened my conviction. I can’t wait to bring everything I’ve learned to bear on what’s next."}