{"title":"Failed to delight","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"Post-mortem of my first startup. Part 1.","lang":"en","canonicalLink":"https://medium.com/@thomaspun/failed-to-delight-4de7ef031c3a","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*EFLSgk8epax-wwAl_6_plA.png","videos":[],"text":"Post-mortem of my first startup. Part 1.We decided to flip the switch on Delight at the end of this month and it officially marks the end of my first startup. Bittersweet moment.The vision of Delight was to build a new kind of mobile analytics: visual analytics. Traditional metrics tell you the what and we tell you the why by showing you the real interaction. We had some good initial response but we failed to take off. Here are some lessons we learned along the way.Price for the values your service delivers.\n\nOur most expensive monthly plan was US$300. Customers who churned never complained about the price. We just didn’t deliver up to their expectation.Customers pay for information, not raw data.\n\nAgain, it’s the value your service delivers. Customers are willing to pay a lot more for information and most are not interested in data. Your service should make your customers look intelligent in front of their stakeholders. It has always been on our roadmap to analyze the recordings so our users only need to watch the relevant ones. We never got to it though.Price your service to encourage engagement.\n\nWe originally priced by the number of recording credits. Since our customers had no control over the length of the recordings, most of them were very cautious on using up the credits. Plans based on the accumulated duration of recordings would have made much more sense for us and the number of subscription showed.Follow up with inactive users.\n\nThis is especially true when your service does not give intermediate values to your users. In our case, our users would need to install our iOS SDK, distribute the apps and wait for actual usage before they could gain any insights from their recordings. Our system should have been smarter about checking upon our users at various stages.Welcome email works well.\n\nWe got this idea from my YC batch mate Optimizely. Send an email to your new user and ask them about how they intend to use your service and where they heard about you. We got about 10% reply rate and gained insight on our target market and what pain points they wanted us to solve.Content marketing works well.\n\nMost of our traffic was from the mentions in other reputable blogs. These blogs have a long lasting effect. We continue to have new users from a blog post written well over a year.We didn’t pivot hard enough.\n\nAlthough Delight was born out of our own pain point when developing our second product, it was still nerve wracking telling the team the ship had to change course mid way. The company was founded on changing mobile video consumption and we ended up betting the company on building developer tools. Even though we saw promising signs early on, we waited too long to fully commit to it. The team was constantly distracted and didn’t know where the company was really heading.I’m extremely proud of the team and what we’ve achieved together. Although at the end our technical issues have stopped Delight from being used in a production environment, the ultimate reason on why we failed wasn’t the product nor the market.It was me. I failed. I gave up.It was my first startup and I was made a single founder a year after we started. I didn’t know how to handle the roller coaster ride and it took a toll on not only my physical and mental health but also my loved ones. So, I called it quits. More on that in Part 2."}