{"title":"Play by your own rules.","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"A little over a year ago I joined Facebook as a Product Manager. I work with the Pages, Location, and Events teams. As I…","lang":"en","canonicalLink":"https://medium.com/work-education/play-by-your-own-rules-6152adc41de9","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/0*VCw2VZRPQrxZqSHj.jpeg","videos":[],"text":"Play by your own rules.A little over a year ago I joined Facebook as a Product Manager. I work with the Pages, Location, and Events teams. As I’ve spent a decade of being the founder of three different companies, this has been a year of change for me. Along the way I’ve piled up a supply of stories (and lessons learned) I somehow feel compelled to document — but the reality is I'm crap at journaling. I just need to start when the story is fresh and close at hand.Today that means it’s easiest to talk about Gowalla, a startup at least a handful of you are familiar with. We built a few amazing things. We also had our fair share of disappointments. Of course, you might surmise that our disappointments ended up outnumbering our amazing things. I won't argue with that. It’s part of the game we play in Startup Land, fighting against the gravity that’s always working to pull our ideas brutally back to the ground.I would like to believe that these stories aren't just applicable to startup life, but to product creation in general. But since I'm no longer running my own company, I've gotta believe that, right?You fool! You fell victim to one of the classic blunders — the most famous of which is never get involved in a land war in Asia — but only slightly less well-known is this: Never go against a Sicilian when death is on the line! — VizziniIn January of 2008 some friends and I launched PackRat, an early social game on Facebook. Eight months later, in August, we gave PackRat a cash-backed virtual currency. By December we were turning over $200,000 in monthly revenue. Not too shabby for a team of eight.About the same time we began exploring themes for other game-like experiences to build. A few ideas were basically PackRat re-skinned for a different audience. Another was a quasi-real-time strategy that would reward you for polluting the world (I kid you not, it was going to be awesome). But only one of our ideas truly stood out as being unique.The first iPhone with GPS had just landed, so we were enthralled with the idea of mixing art, game-like incentives, and real-world locations to inspire people to go explore and share their favorite places and experiences. Eventually we would refine this goal as a way to see the world through the eyes of your friends. We believed this idea to be the craziest of the lot, so we set about on a rigid pace to launch it in time for SXSW (these were the the days you still had a chance of being heard).Of course, this idea was Gowalla.A week before launch I came across some interview with Dennis Crowley in which he described a new project that he and Naveen Selvadurai had been working on. It was called Foursquare.A week later Gowalla and Foursquare would launch on the same day.I remember sitting in Halcyon on 4th St. on the eve of SXSW as a few of us downloaded Foursquare to give it a spin. While it was, at the time, quite different in execution from Gowalla, the common presence of fresh terms like Check-ins, Pins, and Badges would be the first sign to the public that a new wave of location-based services had arrived.At launch, both apps had their distinct moments of strength and weakness. We thought Foursquare was crap, and believed the design nerds flocking to Gowalla validated our attitude. Gowalla also worked anywhere — we were the first to crowd-source a local database from scratch. Foursquare only worked in a dozen cities. In short, all else equal, we believed people would use our service because of its superior craft and availability.Of course all was not equal. Foursquare was not Dens' first rodeo (even prior to Dodgeball, Dens’ involvement with earlier location-based projects like Vindigo continues to impress me). Foursquare's first cut proved more accessible and less fussy to the common crowd than our own. And while Foursquare was initially only available in a dozen cities, a dense and deeply connected crowd in New York — many of them previous Dodgeball users — had already formed a strong base to build from. The New York media, thrilled that “the next Twitter” might come out of Manhattan, also proved to be a force.Since time to fix our flaws was in limited supply, the next six months turned into a footrace, one that would carve a rut difficult for us to get out of philosophically. We entered a check-ins arms race.We significantly backed off development of PackRat and bled its profits in order to speed up our pace.Foursquare would soon raise a round of funding from some of the brightest investors in the game. They began to publicize the number of people who were checked in every day, and consequently defined the metric that would be used to measure success in our space. In doing this, they created the game. Since we were the other major app at the time with a BFB labeled Check In the pressure was on to return in kind.On the heels of their financing we would launch a number of new social features along with support for Facebook Connect. Our growth took off. We started to close the gap a bit with regard to daily check-ins.Investors began to call. So did a small handful of companies who expressed interest in acquiring what we had built.In October of 2009 I flew from Austin to San Francisco. I remember calling Rachel after a few days and telling her that I wouldn’t be home for a bit. I ended up staying two weeks. I met with eighteen different venture firms, telling each our plan to scale (a post for another day). I left San Francisco with a small stack of term sheets, and soon we agreed to raise $8 million and change from a first-class group of investors.Money in the bank, we were ready to go to war. The hype was on. The network effects were at work.The growing public attention sparked by the investment became both a heaven and a hell. On one hand, during the course of Gowalla’s life we received more tech press coverage than is right and holy for any startup. On the other, I dare you to find a post about Gowalla that doesn't mention Foursquare.The Check-in Wars had begun and everybody knew it. The tech world wanted it some drama. We were happy to oblige.With SXSW right around the corner again, all the discussion centered on the perceived brawl that would go down in Austin. The “winner” would be measured by check-ins.We were the hometown underdogs. We had to show up. And we did. Both companies had sponsors. Both had swag. Both had parties.We put up incredible numbers, far beyond anything we had ever done before. We received a number of awards and honors related to the festival (Scott, if you’re reading this, it’s my turn to have the trophy back for a year). In short, we felt on top of the world.This is still one of my favorite memories from SXSW in 2010:SXSW set the rivalry in stone. Wired UK even memorialized the happenings in The Great Check-In Battle. Everyone knew the score, and how it was being kept. And for as well as we had done during SXSW, when the dust settled, outside of Austin we were still number two.A couple months later, Foursquare would raise $20 million from another crew of awesome investors, valuing their company well over $100 million. If you were to come up with a “check-in to post-money” ratio, the pricing of our approximate $8 million raise and their $20 million raise were right in line.Unfortunately, once your key metric is tied to cash value in the eyes of investors, it sucks to be number two. Your ceiling has been bolted in place. Your future capacity to raise cash or sell has a lid on it now.We felt that in order to survive we had to get our numbers up. We tried just about everything to juice growth, some ideas being more successful than others.Foursquare did a marketing deal with New York Times. We did one with Washington Post and USA Today.Foursquare built an Android client. We built an Android client. Foursquare had a Blackberry client. We needed a Blackberry client. Heaven forbid we lose those Blackberry users!In one of the many highlights of Gowalla, we crafted an amazing tie-in with Disney that was loved by both our community and theirs. Each of these endeavors cost us time and money. Unfortunately the relative payoff for us was simply less due to network effect.While Gowalla continued to grow, the trajectory was not what it needed to be. At least not in terms of winning the game we had chosen to play.We were the younger, prettier, but less popular sister of Foursquare. And even that had changed. In time, Foursquare had dramatically improved the design and experience of its service. This was no longer a defensible platform for us as a company.Around this time we knew that our path was in trouble. We would have to pull out the stops to change our game.The months that followed brought new product iterations from us. We gave people a way to check-in on both Facebook and Foursquare through Gowalla. It was very well received. But it was a lot like being Tweetdeck instead of Twitter. Tweetdeck might be cool, but let’s be honest, you’d rather be Twitter. We were still in the game of brokering check-ins, a game we couldn’t win.That said, I’m ridiculously proud of the product our team built during this time. It was revolutionary. We were Editor’s Choice in the iTunes Store. Featured by Google Play. Even the webOS folks at Palm loved us! Hardly a week passes today that someone doesn’t tell me how much they loved and now miss Gowalla. We built something special, but had chosen to measure our success in a way that kept us tied down.Our time was running out.By the time SXSW rolled around again in 2011, the hype surrounding our rivalry had started to fade as the tech community had began the search for The Next Big Thing™, this time anointing Group Messaging as the new hill to be conquered in place of Check-Ins.Truth be told, we didn’t really care about check-ins either. It was just the action verb we put on the orange button that performed our app’s primary function. What we really wanted was for people to see the world through the eyes of their friends.Now here’s the M. Night Shyamalan moment for you:It turns out there was another app that shared a similar vision called Burbn. They were building yet another check-in type service loaded with every feature but the kitchen sink. But early user feedback, coupled with a desire to avoid the check-in battle shitshow already in progress, led them to drop everything to focus on one simple feature: photos.They made the act of taking and sharing photos (many of which just happened to be location-tagged) fast, simple, and fun.They made their own rules. They called it Instagram.That whole see the world through the eyes of their friends thing?\n\nTurns out Instagram did a pretty good job of this.While we were busy playing tug-of-war over check-ins, someone else found a path to the goal with less friction.About a year after the launch of Instagram, Gowalla’s service would shut down and several of us would join Facebook. Others would move on to new endeavors of their own. Ironically a couple from the team would join Instagram.Of course there’s a lot more to the story of Gowalla. I hope to unpack other parts of the journey in time — growing a team, raising (and spending) money, what it was like to sell, etc. But of all the lessons I’ve learned through this journey, this one sticks out like a splinter.Play by your own rules.Listen to your users more than the press. Don’t get sucked into the gravity hole between you and your competition. Ruthlessly run your own path, not someone else’s.Today I’m at Facebook. It’s a special time to be at the company right now. We’re able to build unique products that few others can dream of. But those same challenges still present themselves: How do we choose our own path? Build to our own strengths? Avoid the gravity holes?These are the questions I chew on every morning."}