{"title":"3 Reasons Why My Tech Startup Failed","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"Lesson 1: Don’t Pursue Your Ideals","lang":"en","canonicalLink":"https://medium.com/@andershsi/3-reasons-why-my-tech-startup-failed-fa19919a565a","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*SR4IRPows6vx8zjNnRJ6iQ.jpeg","videos":[],"text":"Growing up everyone told me I could be whatever I wanted to be. At home, in high school, and in college, I was taught to forge strong ideals, and to pursue them with determination.\n\nI did, and that is the first reason why my tech startup failed.\n\nWe believed that our technology has caused us to literally put screens between us and the people around us. We have become a society of zombies. Walk down the street and everyone is walking with their heads down looking at their phones. Go into a restaurant and tables of friends sitting together will be in silence, each person staring at a light that they hold in their hands.\n\nWhen we meet up with people we are interrupted by notifications. Our conversations are fragmented, as we simultaneously talk to someone right there with us and to many other people who are nowhere near. Our interrupted conversations are shorter, and our ideas and feelings remain shallow and cursory as we hop from one topic to the next.\n\nEverybody now constantly carries technology to connect with others. We sought to harness this technology to inspire us to meet the right people from those around us, and to form deep and substantive relationships. Pursuing this ideal, we created Amiloom: Technology that Re-Connects Us Face-to-Face.\n\nIn most cases ideals are the opposite of market needs. Ideals are what you want. Market needs are what other people want. We pursued our ideals, and we ignored what other people actually want. Idealism is selfishness. Selling out to the market is generosity.\n\nMaybe your ideals are really beautiful, as we believe ours to be. Getting other people to even hear your idea, especially in a world with so much interruption, is not easy. Convincing other people that your ideals should be their ideals is extremely difficult. Instead of getting everyone to believe in your ideals, change your ideals to providing what everyone else needs. Sound difficult? Well, you can always try to pursue your ideals first like we did. Then you will know for yourself how much harder it is to change the whole world than it is to just change yourself.\n\nLesson 2: Marketing is More Important than Innovation\n\nYour product will not succeed unless people can understand what it does for them within 3 seconds by looking at a picture and reading 2 lines of text:\n\n“It’s an online directory of all the hot girls in my school!”\n\nMany ideas that are really novel just cannot be explained within 3 seconds. That creativity that we were praised for in elementary school and that has become so central to the way we think of ourselves… worthless.\n\nAmiloom is one of those ideas. Exactly what it is and what you can use it for just cannot be clearly explained in 3 seconds. When you see a picture of it you have no idea what it does.\n\nWe believe that Amiloom is an extremely innovative product better than anything currently available for helping you meet the people most likely to become a part of your life. Amiloom is a connected device that forms a network of people with common friends, shared tastes, and who only need to go as far as the device was handed to meet up with each other.\n\nThe problem is that no one knows this. When you see a picture of Amiloom you have no idea what it is. In 2 lines of text there is no way to explain both why and how it works. We have built it and are telling the world, but no one can hear us, few people understand us, and the masses are not coming to us.\n\nSteve Jobs truly was a genius. When he had a new product he invited the media into a big empty room. He wore black clothes. He told everyone that he was going to show them something truly new that was going to completely change their lives. Then he pulled out a new product and showed it to everyone, and explained it in detail to his captive audience, using just about as much time as he wanted. Does this mean that the products could not be explained in 3 seconds with a picture and 2 lines of text? No. “One thousand songs in your pocket.” “The internet in your pocket.” When all of those people left that room, they were able to get the whole world to know what they had been shown.\n\nSo before you create a product, really think about how you are going to explain to someone what your product is, how it works, and why they want it. If you cannot do this using a picture and 2 lines of text within 3 seconds, don’t waste your time and resources building what might be a great product that no one ever knows about, purchases, or uses.\n\nLesson 3: Don’t Drop Out of School or Quit your Job. You Really Will Need that Expertise\n\nIf you have an idea that solves a lot of other people’s needs and you can clearly explain it to them within 3 seconds, then you really will need to know how to build it.\n\nWhen we started Amiloom, we did not have a technical co-founder. Boy did we go for a ride. We did not know how to build the product we designed, which means that we could not create a complete plan for our business.\n\nI went to Shenzhen and found various development firms to help us develop our product. They said they could do it. I was not proficient enough to properly validate them. Ultimately, I just had to trust them. The first set failed and we wasted time and money. The second set failed again, and we wasted more time and more money.\n\nNot having a detailed plan, we did not know our real costs for our business, and we were not able to raise as much money as we needed. Using some of the money we raised for tuition fee for the school of hard knocks shrunk an already tiny probability of success.\n\nFinally I met Paul and we found a technical co-founder. We started building Amiloom right. The only problem was, after several failures in development, we did not have enough resources to complete development and to bring beta products to market.\n\nSteve Wozniak, Bill Gates, and Mark Zuckerberg all had the technical skills to build their businesses (enough so that they could even drop out of school). Mark Zuckerberg’s early partners did not. What happened to them?\n\nPick a skill and strive to be one of the best in the world at it, whether it is programming, marketing, or sales. I really wish that I had started to learn computer science when I was in high school. Focus your business on your true advantage.\n\nWith your expertise, you will be able to spot and evaluate real opportunities. You will learn your market. You will understand your competition. You will be able to assess talent, hire effectively, and manage your team. You will be able to create a clear plan that you can explain to investors, securing enough resources to execute your plan.\n\nYou can become an expert on your own, but it is much easier and less stressful to do this in an environment where people you can learn from surround you and pay you in part to learn. Become an expert on their dime.\n\nWhy I haven’t Completely Given Up Yet\n\nI wish I had learned these lessons before. I am sure that many people had told me these lessons along the way. I thought I was listening. For me it took walking the long and hard road myself to internalize these lessons. But I kept walking. I never gave up. If I had given up, I would not have taken away these lessons. I am in better shape to succeed than I was when I started.\n\nI do not believe that a tech startup fails when it runs out of money. A startup fails when the team gives up. Money will keep the team going, but the vision will keep the team from giving up, at least for a while. My team has really surprised me with their dedication to our vision.\n\nThere is always something else you can do that does not require money. Nowadays we have Kickstarter. We will keep pushing our ideals and our truly innovative technology on Kickstarter. We will see who understands the product and buys into our vision. If we do not reach our funding goal, the next thing to do will be to find the next opportunity. When we find the next opportunity, we will have more direction, clarity, and expertise than we have ever had before."}