{"title":"Allmyapps — Story of an Almost Successful French Startup","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"The Allmyapps’ story is the story of most startups: the ones that do not make it to the Unicorn club, but fought all the…","lang":"en","canonicalLink":"https://medium.com/@thibauld/allmyapps-story-of-an-almost-successful-french-startup-9666479871","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*EritNStdXxnp309ux1LdPw.jpeg","videos":[{"src":"/media/1518ca275f08b9338856fffacd774f18?maxWidth=425","height":"355","width":"425"}],"text":"Since a few months, I am a free man again. After 5 years of very hard work, Allmyapps was sold at the end of 2014. It has been an incredible journey, but it has also been an incredibly tough one. The story of Allmyapps is the story of most startups: the ones that do not make it to the Unicorn club, far from it, but still fought all they could trying to get there.\n\nAllmyapps started with a big and global ambition: to become the #1 App Store for Windows PC. Even though we eventually failed in our mission to become the #1 App Store for Windows PC, we’ve learned tremendously along the way and I think it would be a waste not to share this experience.\n\nThis post is the first step towards sharing this experience. However, being a very bad (and slow!) writer, don’t expect me to write lengthy posts anytime soon: Presentations are the maximum you can expect from me.\n\nIf you went through the slides, you may be wondering how do I feel a few months after this experience. Well, not bad at all actually! Even though, this adventure has not been a success money-wise, I still feel some sense of accomplishment for not having quit and for eventually having succeeded in selling the company.\n\nI would not have said that right after the sale though as it’s been pretty tough to switch overnight from full pressure, full activity, max adrenaline to… nothing. But after a few months of resting, enjoying relaxing time with my wife and taking some well-deserved vacations, I now feel readier than ever for my new venture!"}