{"title":"Lessons From My Failed Startup","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"Two years ago, I signed on as the third partner at a company called Saaspire. At the time, I had two goals: to build a s…","lang":"en","canonicalLink":"https://medium.com/@theseanoc/lessons-from-my-failed-startup-5e912a457276","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/0*ul7Ab2FW1okWuhYe.jpeg","videos":[],"text":"Two years ago, I signed on as the third partner at a company called Saaspire. At the time, I had two goals: to build a sustainable business and to learn. The business part didn't work out too well, but I did learn a quite a bit.\n\nOne of the things that made life at Saaspire interesting was that my partners and I often had differing opinions. Many times this was a good thing. For example, when working through the design of a new feature or product we would often come up with very different approaches which given time and discussion we could merge and mold into a final solution that was better than anything that we had individually come up with.\n\nOver time however, we started to have larger and larger disagreements. Most significantly, our disagreements expanded scope from product decisions to questions of direction for the company. Eventually we decided to split up and go our separate ways. One partner left to pursue his own endeavor while my remaining partner and I continued on with the Saaspire name. All things considered, the separation went smoothly and everybody left on good terms. That being said, the whole process and the disagreements leading up to it were a huge distraction that we sunk an incredible amount of time and money into.\n\nLesson learned: Make sure everybody is on the same page in regard to the company’s direction as early as possible. What do I mean by direction? Are you going to bootstrap the company or try to raise funding? How ambitious of a product are you looking to build? Are you going to focus on one product or create a suite of products? Obviously you can’t know all of the answers to these right away and things will change over time, but the sooner you can work them out, the happier everybody will be. Leaving any of these questions open for too long, especially due to an internal disagreement, will only burn up resources you don’t have and distract you from building your business.\n\nOne of the main points of contention that lead to our split was the question of focus. My partner who left, envisioned a suite of interoperating products built on a common platform. Initially this seemed like a great idea as it allowed us to play with different ideas and target different markets while leveraging a few core technologies.\n\nIn practice however this proved to be problematic. We were a three person company bootstrapping our products by doing consulting work. We didn’t have anywhere near the bandwidth to execute on this type of plan. Instead of having the benefits we envisioned, the platform created a massive overhead on our development work. We ended up over engineering our systems so they could support both today’s and tomorrow’s products. Similarly we ran into all kinds of weird user experience problems. We would try to design our initial application so that it would make sense in the context of the other applications that we had planned. Unfortunately, in the mean time the app seemed confusing and overly complicated to users who didn’t know or care about the planned suite.\n\nAfter the split, my remaining partner and I relentlessly cut down the scope of the product. After doing so, so many things became easier.\n\nBefore, if we gave somebody our elevator pitch they had no idea what our product did and we couldn’t really blame them. After, we could give the pitch, people would get it right away and they’d be really excited about it.\n\nBefore, our product iterations would take weeks if not months. It was virtually impossible for us to really learn from user feedback. After, we could iterate in days and we radically changed the product (for the better) several times based on user feedback.\n\nBefore, we couldn’t even sell our own consulting clients on really using our product. After, not only were our clients sold on using our product, we were getting traction with the outside world.\n\nOn virtually every level, the more we could limit our scope and focus, the better things worked.\n\nLesson Learned: Focus. Cut things down as much as you possibly can and then cut some more. There is so much you need to pay attention to and get right when creating a new business and a new product, the last thing you need to do is add to that list. The more you can cut things down, the easier everything will be to test, communicate, sell, and improve.\n\nAs I mentioned, the plan with Saaspire was to pay the bills with consulting work until we could sustain ourselves from product revenue or until we could raise a round of funding. While this approach has its merits, it is fantastically difficult to do well.\n\nFor a while this model worked pretty well for us. We had one or two long-term clients who we spent a bit less than half of our time working with and the rest of our time was mostly spent on product work. At times this was a frustrating setup in that progress on the product was painfully slow, but it worked and it was stable for a time.\n\nEventually, as always happens in consulting, our long-term client work dried up. We had saved up a decent amount from that consulting work so we didn’t need to urgently get new work in the door, but we did have to make a decision on what to do.\n\nAt the time we decided to spend a little time going after some small, short-term work to get some cash in the door but otherwise spend most of our time working on the product and trying to raise a round of angel/venture funding to allow us to work on product full time.\n\nUltimately this proved to be a fatal decision for the business. We went after funding because we needed it and not because it was the right time to go after funding. If we had instead spent the time sunk into fundraising into selling new long term clients and into growing the consulting business into something a bit more sustainable, we probably could have bootstrapped the product to eventually be self-sufficient if not profitable.\n\nLesson Learned: If you’re bootstraping, cashflow is king. If you want to possibly build a product while your revenue is coming from other sources, you have to get those sources stable before you can focus on the product.\n\nWe actually saw this bootstrapping problem coming way before it happened. We had plenty of time to correct course and focus our energy on building a stable consulting business before building the product.\n\nWhy didn’t we do it? We really didn’t want to. It was one of those situations where we had to decide what we wanted in life.\n\nIf our only priority in life was building a successful, independent business, building out a larger, more stable, consulting business absolutely would have been the right path to go down.\n\nUnfortunately, at that point both my partner and I were pretty burned out on the consulting game. While we had the skills needed to build a larger agency, we knew we would have been miserable doing so. It simply wasn’t something we wanted to invest the next two or three years of our lives doing.\n\nGiven the choice of building a larger consulting business and going back to “normal” jobs working for the man, the latter was much more appealing to us.\n\nAccordingly, we made a try at raising a round of funding as we felt we had a small chance at making it work. In the worst case scenario we’d still be in the position of shutting the business down but we would have learned a bunch and we’d be in a place were we’d feel we’d given it our all.\n\nIn the end, even though trying to raise a round of fundraising instead of continuing to bootstrap was fatal decision for the company, it is not one I regret.\n\nLesson Learned: What the “right thing to do” is and what the “right thing for you to do” are not always the same thing. Be honest with yourself and your partners about what you want and what will make you happy.\n\nIn this case I’m not talking about the place on the left coast but instead, the dangerous place between launch and traction.\n\nIn our effort to raise a round of funding, we made several mistakes. The biggest of which was to launch a product without being ready to fund it for however long it would take to show interesting levels of traction (e.g. people paying for our product).\n\nIn the investment game you can sell people on a story until you launch your product. Pre-launch you can potentially plant the seeds of something amazing and let people’s imagination run wild. Post-launch, you have something that knocks down that imagination back down to the ground, data. Once you have data, you have to be able to survive until you have something based in reality that is exciting for an investor. In our case, we probably would have needed to show low customer acquisition costs and high retention rates. In other cases, you might need to show the ability to form partnerships or collect data.\n\nTo be clear, I’m not saying that either approach to fundraising is better or worse than the other. I am saying that you need to clearly fit into one of those categories or be ready to pay the bills until you do.\n\nLesson Learned: Launch == Reality. Don’t launch until you’re ready to deal with reality for a while (and then some).\n\nThis was one of the most painful but also the most significant lessons to come out of my startup experience. You absolutely need to get your product right, but it is just one of several equally important things you need to get right to create a sustainable business.\n\nEven if you ignore the focus issues that we went through, we spent way too much time, energy, and attention on our product. It really hurts me to say that. I was super happy and proud of how our product turned out. It worked pretty well, looked good, was easy to use, and it solved problems for real people. Unfortuantely, there are so many other things that you also need to get right to build a viable business.\n\nIn our case our product was good, our business model was reasonable and well worked out, our marketing plan was terrible. It wasn’t until pretty late in the game that we really tried to figure out how we’d go about selling our thing to customers. More specifically how would we get in front of our customers in a way that we could afford but would still grab their attention. Given that we were targeting SMBs this is an infamously hard problem and turns out was what really needed to be novel about the business for it to be successful.\n\nTo make things worse we also didn’t look at the marketing problem until so late in our process that I suspect we would have had to make major changes to both the business plan and product to address the realities of the marketing situation. I say I suspect since we did this so late that we didn’t get far enough towards solving the marketing problem before we died to really know.\n\nLesson Learned: You have a fixed amount of time and attention. If you put too much of it towards any one of the things you need to get right (I’m looking at you product), you will fail at something else.\n\nIn the end, I look at my startup adventure as my version of grad school.\n\nOn the down side it was a ton of work, my relationships with friends and family suffered, and I picked up a non-trivial amount of debit.\n\nOn the plus side I learned a ton, I gained new perspective on the world, and I called it quits before any of the downsides became unrecoverable.\n\nToday I’m back into a much more “normal” job working as an engineer at bitly and I love it  (we’re hiring by the way) . Someday I’ll probably make another pass at buiding my own business but for now, it’s good to be doing something else."}