{"title":"Launching Sidestage After Failing At My First Startup","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"How I went from $1 million in seed funding, through shutting down my first company, to launching the second one.","lang":"en","canonicalLink":"https://medium.com/@schuylerd/launching-sidestage-after-failing-at-my-first-startup-6a1e0dac2c4d","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*H32UC_CwlcKbuT5oPv5CrQ.jpeg","videos":[],"text":"Launching Sidestage After Failing At My First StartupHow I went from $1 million in seed funding, through shutting down my first company, to launching the second one.When I started my first company, Moped, I didn’t think the day would come that I’d have to close it down. I was as naive as I was ambitious. Our vision was to revolutionize communication, making messaging and the infrastructure underneath it more web-friendly. Like other web apps, such as Facebook and Twitter, you could use Moped from any device. We had plans for an open API where other developers could integrate their apps into our messaging service, and had already completed best-in-class integrations with Dropbox, Foursquare and IFTTT, to name a few.I obsessed over Moped, and used it all the time to communicate with the people in my life, both for work and privately. I had moved my entire network over to Moped. If you wanted to get in touch with me, you had to Moped me. No matter where I was, which device I was on, my messages got to me. Looking back at my “Message life” then, it’s never been more in sync than when it was when Moped was around.We didn’t have any revenues, but I was convinced we would make it to a Series A. I had great answers to how we were different from Kik, Whatsapp, Facebook Messenger, HipChat, Skype and others. We had great investors, a great team and a great vision about the future of messaging on the Web. Still, we didn’t make it. Right thesis, totally wrong execution.You learn a lot more from failure than success. There are many reasons for Moped not working out, but the bottom line was that we didn’t build something that enough people wanted.When growth stagnated, we started building new features. At the time, we thought we were helping. But instead of focusing on why users weren’t coming back, we were trying to attract new users. We started costly development cycles that, in the end, won us some users, but, unfortunately, not enough to make a real impact on the company.When you have no revenue, users are like currency for your company. We didn’t have enough of it to get new investors excited about financing us. In the end, 6Wunderkinder scooped up Moped, the product, but I had to let people go and my beloved messaging service was shut down.After the initial disappointment, the prospect of new beginnings was intriguing, if not exciting. But, I didn’t know what I was going to do because I didn’t know what I wanted to do. When you’re building a startup you hardly have time to think about much else, especially a future in which that startup is not part of your life.Eventually, I found my heading. And in doing so, I found a vision, a team and a company that I am more excited about than anything else I’ve ever done. I have a hard time believing that patience is a virtue, but I do think time is a great tool if you use it wisely.After Moped I got away, got some perspective, thanked my investors, and had a long think about what I wanted to do next. Through this process I launched my second startup, Sidestage.After Moped I took some time off from working. For the first time in two years I didn’t have to worry about payroll, didn’t have products to map out, and didn’t have meetings to take. Building and running a company is exhausting, and even though I didn’t realize it, I needed a break.My girlfriend and I decided to get away. We didn’t exactly visit the most peaceful places on Earth, but the change of pace was good. While traveling, I didn’t take my laptop or iPad, didn’t read TechCrunch and, to be honest, didn’t think much about anything. I was on vacation. I did, however, read a few books, though, nothing to do with tech or startups.When we got back, I had a long think about what to do next. Should I find a job, go back to school or start another company? For me, starting over meant having a clean slate. I thought, here’s the chance to apply everything I’ve learned at Moped towards something new. I could reinvent myself. It felt like having a new lease on life. And after a long two months of thinking, researching, and talking with lots of people, I was convinced of starting a new company.I had been rather disconnected from the startup world as Moped was winding down, so I was eager to reconnect with people with whom I had not been in touch. Since Moped was fairly visible within the Berlin startup scene, it’s easy to go from an email to a meeting. I set up a ton of face-to-face meetings with investors, other entrepreneurs and friends in the industry.Through these meetings, though it was not at all my intention, I found angel investors who were interested in investing in me, despite, and possibly because of, my experience with Moped.Moped raised $1 million from some known investors in California, New York and Germany. It’s important not to lose contact with people who have, at some point, believed in you and your company. I made sure that I got around to meeting with and thanking my investors, and also talked a little bit with them about what I wanted to do next.I learned a lot from Eric Hippeau, Steve Schlafman, John Borthwick, Nick Chirls, Topher Conway, David Lee, Robert Pollack, Ciaran O’Leary, Jeff Pulver, Dr. Christian Stredicke, Wolfgang Bauer and Simon Schaefer — all of whom invested in me Moped.With Sidestage, I challenged myself on why I wanted to build a company and what I personally cared about. I wanted to work on something that other people would care about, too, and that I could explain to my 80-year-old grandmother in Alabama.You would think that it’s obvious for entrepreneurs to think things through thoroughly before launching their startups. (I assure you, this is a best-case scenario for many.) A lot of products, and Moped was included in these, are born out of pivots (e.g. Instagram and Twitter), or some other circumstances. Startups are about survival. You do whatever it takes to survive.As Sidestage started developing from an idea to a prototype, and as I started sharing what I was working on with with others, my excitement and passion grew. And with that came the feeling of confidence of knowing not just what I was doing, but why I was doing it.I joke that finding a co-founder is like marriage. It’s not easy, and there’s no formula. Still, I had been trying to swing the odds in my favor by scouring Angel List, connecting with people in Berlin who were interested in building something new. I also enlisted my angel investors to help. I came across someone who I had some mutual friends with, and we hit it off right away.Starting a second company is a lot easier, and faster, than starting the first. I felt like I’d done it before, because I had. I had a little bit of experience behind me. When you are a second- or third-time founder, it just feels different. You feel it, and other people notice it. It’s a good feeling.Today, we’re officially launching Sidestage, my second startup. In short, we’re a community marketplace for finding musicians to play private parties, events and performances.Whether it’s a wedding singer, a DJ for a party, or a classical string quartet, Sidestage connects people with musicians, at any price point. We want to make it easier for musicians to earn money by making it easier for them to get hired.We’re currently operating in Berlin, a city that’s no stranger to great music, from techno DJs to classical orchestras. Our goal is to launch in other cities by the end of this year. On our website, you can sign up to be notified when we launch near you.To learn more, and to find musicians that can be booked today, visit www.sidestage.com.Starting over isn’t easy. It’s hard and humbling. Since most startups don’t work out, more founders fail first than succeed. But all of that doesn’t deter entrepreneurs from trying, either for the first time or all over again.When you read about a successful exit, you don’t see “This was his fourth company.” That’s because when you make it, no one cares about your failures. Failure, though important, doesn’t define you.In founding Sidestage, I’ve found more meaning and purpose in what I’m doing than ever before. I’ve taken all my real-world, practical experience and applied that towards what I’m now doing. I’ve never felt more comfortable in my own skin.My advice to entrepreneurs who didn’t exactly succeed in their first go? Start up again. Start everything all over. I promise you, the passion you felt before, you will feel it again, even more so. All you have to do is get away, get perspective and restart.Thanks for taking the time to read my post. If it was interesting to you, I’d love to hear about it. Write me an email, schuyler@sidestage.com or ping me on Twitter, @schuylerdeerman."}