{"title":"Case Study of a Failed Startup","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"The Lead Up ¶\n\nMy sophomore year of college I was a neuroscience major and my plan was to unlock the secrets of the mind…","lang":"en","canonicalLink":"https://medium.com/@adamzerner/case-study-of-a-failed-startup-37db342df2bf","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*k7jEiCbgsg1BiTZ6W0aaWQ.jpeg","videos":[{"src":"/media/e932aa8067fe406a8709bb8f1a56479c?maxWidth=640","height":"480","width":"640"}],"text":"My sophomore year of college I was a neuroscience major and my plan was to unlock the secrets of the mind and universe. Then I realized that the path of grad school, professor, grants, and incremental research wouldn’t be a great way to pursue this goal. At the same time, I read Paul Graham’s essay on How to Start a Startup. I felt a strong sense of “I could do this!” and “making a lot of money from a startup and using it to do something good” would be a better way of pursuing my goals of doing something important.Throughout sophomore year I read all I could about startups, and about things like finance, marketing, strategy, economics, design, technology etc. The following summer I started learning some HTML, CSS, JS and PHP, but didn’t make much progress (I also started a very early version of the website that I’m writing this post about).The following year I thought about starting the startup during the year, but decided not to. It was a busy year with classes, and a good opportunity to be social and to be a college student. I still spent a decent amount of time thinking about the startup and learning about related stuff.Finally, the summer after my junior year I began the journey of starting a startup.Pain point: it’s really hard to choose a college right now because you hardly have any information. There are student reviews, but the questions they address are way too broad (“What are the academics like?”).Solution: “What do applicants want to know?” Break that question down into it’s components, and get current students to address them. (I also wanted to provide more objective data).Hypothesis: I think that there will be a lot of users if…Enough schools are covered such that a user could expect to find some schools he’s interested in on the site.The content is detailed enough that it’s useful, and plentiful enough that it’s trustworthy.Execution: The biggest component here is to get people to answer questions. I thought there was a decent chance that people would do so voluntarily after I ask them on Facebook and Reddit. But if that didn’t work, I did some rough calculations and was confident that I wouldn’t have to pay that much money to get the answers I needed.I could write for hours about this, but I’ll be brief:Colleges, high schools and student organizations didn’t help me.It was difficult to incentivize people to answer questions. I spent a lot of time messing with different structures and amounts of money.Investors weren’t attracted to something without traction.I actually got a meeting with one investor who said he liked the idea and would be interested in investing if I got some traction. We talked and agreed that it’d be a good idea for me to do a pilot program at the Ivy League schools.I paid $1/answer + Facebook advertising + $10 per referral and got 5000 answers at the Ivy League schools. 98% of the answers came from 6/8 schools though :/.I spent 2 weeks cold calling college counselors saying, “Hey I’ve got free student reviews of Ivy League schools. Check it out, let me know what you think, and sign up here if you want to be notified when I get more schools.” Almost all of them ignored me.Roughly in order of importance, I’ll describe my mistakes.I overestimated the likelihood that I successfully raise money. The way I saw it:P(success | resources) is very high. P(success | resources) depends on P(answers | resources), P(users | answers) and P(revenue | users).I had successfully gotten answers at 3 trial schools, so I thought that this was good evidence for P(answers | resources). In retrospect, this was way too overconfident of me.I thought that P(users | answers) was high because my intuition that users wanted more detailed information was strong.As for P(revenue | users), a) my competitors made tens of millions of dollars a year, and b) I thought the mismatch between the value I offered and what I’d charge was high enough that high schools would pay to provide their students access to the content. In retrospect, I think I underestimated the difficulty of selling to government(-like entities).An investors decision to invest should depend on P(success | resources). To the investor, P(resources) = 1 because the investor would be providing the resources.I thought that there was a solid chance that investors would agree that P(success | resources) is high enough to make an investment worthwhile.I know that not everyone thinks like this, but I thought that given all the investors out there, chances are I’d find someone that does.I should have had a better intuitive sense that people really don’t think like this.I really should have done more research into what P(resources) really is. I think that I suffered notably from confirmation bias here. I should have given much more consideration to the possibility that P(resources) is low.I should have responded more quickly to the trouble I was having raising money. It should have been a sign for me to update my beliefs more than I had.I underestimated people’s distrust and reluctance to try unfamiliar products. Self explanatory.I underestimated the importance of design. People told me that the design was iffy. I had a strong intuitive sense that the value the site offered was mostly determined by the information, and that it’d take a really bad design to notably influence this. I didn’t think the design was close to that point. I thought that it had a moderately unprofessional feel, but that it was reasonably usable and the aesthetic quality was alright.I still agree with a lot of that… but I was addressing the wrong question. The question isn’t “How much value am I offering to a user that is currently on the site”. The question is, “How do I get a user to give it a shot in the first place”. People associate bad design with bad quality, and often won’t give bad design a fair chance. That is a fact that I didn’t account for enough in my analysis of the design of my site. Partly because I didn’t understand users enough, and partly because I spent too much time winning arguments against weak opponents and not enough time thinking up and arguing against the strongest counter arguments I could find.I underestimated the difficulty of the coding. I was bad at coding. I had a vague understanding of HTML/CSS/JS and had started the site right after spending a few weeks learning Rails. I figured, “Oh, I just need to get a few basic things down, and then once I get traction I could outsource the coding.” In reality, the code was harder than I expected and I spent way too much time trying to hack stuff together.I was hesitant to make this an individual point because it’s very much related to my overestimate of P(success)… but I still underestimated the amount of code I’d have to write. Looking back, I definitely should have had the sense to consult with someone on how difficult the code would be relative to what my abilities at the time were.I spent too much time messing with incentive structures. I spent months trying to find an incentive structure that worked well. I increased the amount I’d incentivize very slowly and experimented in series (one after another). This took way too long. I should have realized that smaller amounts of money weren’t working and I should have experimented in parallel. Doing each of these things would have been a bit more costly, and I was hesitant to spend money, but I think that the time it would have saved me would have made it easily worth it.I should have been more committed to getting an MVP working. I spent a lot of time asking people for advice, and “focus on an MVP” was the main thing they told me. I thought that my minimally viable product would have to meet the conditions in my hypothesis above, which were: 1) enough colleges such that a user would expect to find schools he’s looking for, and 2) enough content to be useful. I thought that 1 ~ 300 schools and 2 ~ 10 answers per question. This would have taken a couple hundred thousand dollars to pay for.When people told me to test a smaller MVP of this, I thought about it and didn’t really think there was anything that was both smaller and viable. I interpreted peoples’ insistence on a smaller MVP as (to an extent) blindly following a heuristic that they don’t understand (they really didn’t seem to understand the viable part). I still think that people (to an extent) blindly follow the heuristic and don’t really understand the viable part.My position now is that:There does exist a product that is smaller, yet still viable.I didn’t look hard enough for this.I was frustrated with peoples’ lack of understanding of MVPs. This lead to my suffering from the reversed stupidity fallacy, which played an embarrassingly large role in my not looking hard enough for a smaller MVP.It would have been hard, but if I was pushy enough I probably could have found some local high schools to pay me to collect data for them (in the form of student reviews). This probably should have been my starting point, depending on what the evidence said about P(resources) and P(success | !resources)… because if either of those were high enough I may have been able to skip the MVP step and gone more directly to building a bigger viable product.I (probably) overestimated the difficulty of dealing with the government. I didn’t come across particularly strong evidence for this after having failed, it’s just that the conclusion I reach now is different when I reflect on what I know. There were however two experiences I had that added to this:I thought that colleges may provide some help with getting people to answer questions, but they didn’t. Same with high schools and student organizations.I couldn’t even reach any guidance counselors after my pilot program. If I can’t reach them, how would I eventually sell to them?I overestimated peoples’ desire to help someone starting a startup and trying to do something good. This will probably sound naive, but I don’t think it is. I thought that people would have some sort of respect for what I’m doing and want to help out. For example, the high school guidance counselors I tried to contact, maybe the default is for them to operate in a bureaucratic way, but I had thought there was a decent chance that they’d think, “Oh cool, look at this kid trying to start a startup, good for him! Hm, he’s actually trying to do something that would be pretty useful. Let me check it out.”And I when I asked people from my high school to answer questions and spread the word a bit, I thought that a bunch of them would have respect for what I’m doing and want to help out. Almost no one did, which I found to be quite selfish of them. I don’t think my initial expectations were too unreasonable given what I had known, but my beliefs have since been updated."}