{"title":"My startup failed, and this is what it feels like…","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"We had users and traction, then we fell off a cliff. My 4 year emotional rollercoaster just came to an end.","lang":"en","canonicalLink":"https://medium.com/female-founders/my-startup-failed-and-this-is-what-it-feels-like-c5d64b3ae96b","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*zDIcMHGCvFn2rZqJB62LAw.jpeg","videos":[],"text":"My startup failed, and this is what it feels like…We had users and traction, then we fell off a cliff. My 4 year emotional rollercoaster just came to an end.Over 90% of tech startups fail, but I never thought my baby, 99dresses, would be one of them.If there is one thing that doing a startup has taught me, it’s that I am much more resilient than I could have ever imagined. Looking back, when I started 99dresses fresh out of high school I was very naive and had zero idea what I was doing. In fact, I didn’t even know what a startup was! I just knew I wanted to solve a problem I personally experienced: having a closet full of clothes but still nothing to wear.Since then I’ve survived being stabbed in the back by cofounders, investment rounds falling through, massive technology fuckups that brought sales to a halt, visa problems, lack of money, lack of traction, lack of a team, hiring the wrong people, firing people I didn’t want to fire, lack of product-market fit, and everything else in between.And yet I failed. I won many battles but I lost the war.I take complete responsibility for this failure. Were other people involved in 99dresses? Of course. Was any of this their fault? Absolutely not.The startup press glorify hardship. They glorify the Airbnbs who sold breakfast cereal to survive, and then turned their idea into a multi-billion dollar business. You rarely hear the raw stories of startups that persevered but ultimately failed — the emotional roller coaster of the founders, and why their startups didn’t work out.As things were looking bleak at 99dresses I started seeking out these stories, desperately hoping for someone — anyone — to relate to. Failing is lonely and isolating. Every time I’d scroll through my Facebook feed all my startup friends were launching new products on Techcrunch, announcing their new fundraising rounds or acquisition, and posting photos of their happy teams. Ask any founder how they’re doing and you’ll hear something positive. Whether that’s the truth or not, that’s what we’re trained to say.I found postmortems of startups outlining what didn’t work and why the company went under, but I was hard pressed to find anything that talked about the emotional side of failure — how it actually feels to invest many years of your life and your blood, sweat and tears, only for your startup to fall head first off a cliff. Maybe it’s because most founders are men, and men generally don’t like talking about their feelings. Maybe it’s because failure is embarrassing.I don’t know why this is the case, but here is my contribution to the cause: my story. This is what failure feels like. I hope it helps.Where it all began…Many startup folk say that failure should be celebrated. “Fail fast, fail early, fail often!” they all chant, trying to put a positive spin on the most excruciating pain any founder could experience.Let me tell you — failure fucking sucks. If I would have failed fast, early and often then I would have given up 99dresses years ago when, in 2011, I travelled to my parent’s place in the countryside of Australia, locked myself away in my room and cried for what seemed like an entire week. I had launched 99dresses in Australia 9 months earlier and received some great traction, but I was losing momentum due to technology problems that I didn’t understand and battling a whole host of other issues.I felt like I was drowning in a black ocean, and I couldn’t see any light at the surface. I didn’t know which way to swim.At the same time the Australian press would continue to approach me for interviews. The fact that I was a teenage girl working on a startup in a male dominated industry seemed to garner a lot of attention, and I’d take the interviews that came my way because that was my job. It was my job to be positive and paint a happy picture for the media, who seemed to talk about me as if I was some kind of entrepreneurial wunderkind because of my age and the fact that I had breasts.This didn’t help my impostor syndrome — the constant feeling that everybody was always giving me way too much credit. I remember one reporter saying “you must be so proud of what you have achieved” and I was completely stumped by that statement because I’d never actually thought about it. Was I proud? What had I actually achieved? We had some traction, sure, but we also had many problems that needed solving. I was just waiting for the day when everyone would figure out that I’m not that extraordinary.“But you’re taking a massive risk! That’s so brave!” they’d say. I never thought so. The biggest risk in my eyes was going to university, getting a stable job, and sliding into a comfortable life. There’s nothing wrong with that, but I knew it wasn’t me.Plus, the worst that could happen if I failed was that I’d end up living with my parents. I think the really brave founders are the ones who will be out on the street if they fuck it up, and still do it anyway. It’s easy to take risks if you have nothing to lose.My mother said “Nikki, are you sure that you really want to do this? It is so much pressure for a 19 year old to take on. No one will think less of you if you decide this isn’t what you want”. My parents are my number one supporters but my mum hated seeing me in so much pain, even if it was character building.But despite the horrible sinking feeling in my stomach, and the fact that I had no money left, and the fact that I had no stable team, and massive product problems, and was feeling burnt out, and had no idea how to overcome any of the aforementioned obstacles, and felt completely alone in it all, I persevered.I didn’t fail then. I couldn’t fail. This was my baby, and if it was going to fail it would be over my dead body.I became numb to the pain, and despite waking up for weeks on end with no glimmer of hope and no desire to get out of bed, I still made myself sit at my desk and work.Eventually, things took a turn for the better.When you’re at your lowest, the only way forward is upI applied for a university team business planning competition with a $10k prize, paid a friend $500 of the prize money to be on my ‘team’ so I could qualify to enter, wrote a winning business plan and took out first place. That was enough money to buy me a plane ticket and some accommodation to the US.I met my friend and advisor, Matt, who took me under his wing and helped me more than I could ever have hoped. My developer was admitted to hospital with a very serious illness and dropped out of the company, but I replaced him with 2 co-founders. I got into Y Combinator and headed to Silicon Valley — startup Mecca for a starry eyed young founder like I was — for 5 months. We rebuilt the 99dresses product and launched it in the US. We were getting traction. I signed a $1.2 million seed round with a group of investors on a valuation cap that I honestly thought was ridiculously high.And then, all of a sudden, we weren’t.Another trip down the emotional rollercoasterI had to fly back to Australia to get a working visa as soon as the funding paperwork was signed, and the next day my two “co-founders” decided to tell me they were leaving the company without even a hint of warning.The $1.2 million hadn’t hit our account yet, but even if it had I would have felt uncomfortable accepting it with no team in place to execute my vision. I would have looked like a fraud and an idiot anyway — what kind of founder announces to her investors that she suddenly has no team the day after she takes their money? And furthermore, how could I not have seen this coming? I was completely blindsided.I went over to Matt’s office, and he proceeded to pour vodka down my throat whilst telling me I was much better off without them. Like most of Matt’s lessons it was hard to see that then, but he was right.The next day I rang up our lead investor who decided to pull out of the round. Then another investor fell off. Everything I worked so hard for was crumbling to pieces. If only I’d closed everyone individually, instead of agreeing to round up at least $1mil to get the lead on board. But then I realized that these “co-founders” would have left anyway, leaving me in this same position.I was stuck back in Australia still with a big vision, but as a single, non-tech founder with no team, no product (I needed these co-founders to keep the product running), no US visa and just some money that I’d gotten from being a YC company.I remember my sister taking me for a walk after it all happened. She sat me down in a park overlooking Sydney harbor at night time and made me listen to ‘Shake it out’ by Florence and the Machine. She told me I’d bounce back, that I’d overcome this like I always did. I wasn’t sure I believed her, but I knew I’d survived worse. This ended up becoming my motivational song that I would listen to when times were tough, because it reminded me that I could surmount huge obstacles if I wanted to.I didn’t fail then. I just started again.There were 5 investors who invested in me, despite all of this. They believed in me when I was having trouble believing in myself, but I couldn’t show them that — that’s the cardinal sin of any entrepreneur. Always be confident. Always be smiling. Always stay positive. Sell, sell, sell!I remember one investor sending me an email saying “Shit happens. Take the money and go sort it out.” Another told me to go make him some crack for women.My cap got sliced in half, but at least I wasn’t broke again.So I closed $595k and started looking for a new co-founder. Problem was, I didn’t trust anyone. Not after what my previous co-founders had just put me through.But then I met Marcin, who quit his corporate IT job and joined me in an office we referred to as ‘The Cave’ because it was cheap and nasty and had no natural light. I remember he came in on his first day, and midway through a conversation my chair completely collapsed. The next day he brought in his own chair. I was very jealous.We rebuilt 99dresses again and launched it in the US which was proving to be ridiculously hard when we weren’t physically in the US and having to handle some stock and seed a community from another continent. We were having trouble getting traction. The market had moved on, competitors had flooded the space and the product we had built just didn’t provide enough value in comparison.Add to that the fact that we were building a 2 sided marketplace, and you might get a sense for how tough things were. The US market is huge, hyper-competitive and way harder to crack than the Australian one. We were frustrated by our lack of progress, and the product I’d promised our investors just wasn’t working.I caught a plane to the US and talked to as many women in our target market as I could. We interviewed more customers. We discovered a very clear set of problems that explained why our product just wasn’t working in the US market.I rang up the team in Australia, and told them, quite bluntly, that we needed to chuck everything out and approach the problem from a different perspective. I presented a new idea for a product that seemed to resonate with the girls I was talking to. The team did not take it well, and I definitely communicated the change very poorly. I almost got on an early flight home because I felt a mutiny brewing — we were throwing out many months of hard work. This wasn’t my finest moment as a leader.Despite this, the team rallied together. We threw out our website and concentrated entirely on mobile. We had a mobile website prototype in front of users within a week and iterated based on that before building out the native version.We hustled to get anyone we could to try out our beta app. We must have emailed thousands of bloggers, and some ended up giving it a go. Items were being traded, and girls were paying us money. This new thing was working! We couldn’t wait to launch it in the US, but we needed to physically move there first in order to do things properly.Problem was, we didn’t have any visas. You see, it’s very easy to get into the US as an Australian if you have a degree in a specialized field, which I did not. Marcin had to wait it out to first become an Australian citizen with his wife, then get his E3 visa. However, right before joining 99dresses his wife had fallen pregnant with their first child, which they needed to give birth to in Australia 9 months later. Marcin was then tasked with moving his wife and baby halfway across the world to chase our startup dreams. Needless to say, he’s a very brave man.I, on the other hand, was faced with my next big challenge: proving that I was ‘an alien of extraordinary ability’ that was worthy of living and working in the US without a degree (after all, I gave up my scholarship and dropped out of university when I got into Y Combinator). After about 7 months of working on my petition, I was ecstatic and incredibly grateful when I got approved for an O1 visa.I practically skipped over to the US consulate in Sydney for my appointment, where I was to pick up the visa. Instead, I was interviewed by a lady who took an obvious immediate disliking to me. She told me she was putting me through extra processing, so I wouldn’t be getting my visa that day. She told me it was random. She told me it would take 2 weeks.I later found out this processing was not random — it was reserved for potential terrorists, and could take up to several years.As an entrepreneur I HATE feeling helpless. I’m used to taking action on something and producing some kind of result. I like being in control. In this instance I felt completely helpless, and my startup was at the mercy of a government worker on a power trip.We were already running behind on launching this app in the US, and the consulate had my passport. I couldn’t get out of Australia. The consulate made me jump through hoop after hoop, and a few months later I still didn’t have my visa. It got to the point where I had to call the consulate hotline every single day and split test different types of crying (machine-gun bursts of sobs vs. long sad silences vs. loud ugly cries) on the operators (males were much more receptive to helping out), and occasionally I’d get lucky and have one of them put in a report for me. I hated doing it, but it was the only way to push things forward.I finally got my visa, and took the next flight I could get out of Australia with four suitcases — 2 full of clothes, 1 full of shoes and another with all my electronics and miscellaneous items. The contents of these suitcases just about summed up my life.I’d achieved my dream of moving to NYC, and I was living in a shoebox. It was all I could afford on my startup salary.Soon after, my 25 year old sister and 19 year old brother both bought gorgeous apartments in Sydney. Whilst I was absolutely thrilled for them, I also couldn’t help feeling a little jealous as I sat in my tiny convertible bedroom with no windows. If this all didn’t work out I’d be financially left with nothing, whilst my siblings were off investing in their financial future. That didn’t really scare me — I’ve realized that money isn’t a huge motivator for me — but it did flare my competitive side. We probably all compare ourselves to others way more than we should…After hiring a few people and finding an office in NYC we were ready to launch. We solved the chicken-and-egg problem using techniques that we promised never to speak of again because they squarely sat on the grey/black spectrum of naughtiness. If there was a line, we definitely crossed it. We had to. These hacks were harmless to others, so I figured it was only a problem if we got caught.Our plan worked better and faster than I’d budgeted. Within 3 months we were doing over 1,000 trades a week, and bringing in revenue on every trade. We continued to grow.Our app store reviews were overwhelmingly positive. Obsession did not begin to describe how some girls treated 99dresses. Within a few short months several power users had spent over $1000 each and traded hundreds of individual items. We steadily grew our stock turnover rate from 17% to 50% — that was 2-3x better than our competitors. Everyday I’d be wearing a new outfit that I’d received off the app. Our retention rates were really exciting. If my investors had wanted crack for women, then that is what we had created.Based on the way we were growing, we thought we could get cash-flow positive before our funding ran out.I had 99 problems and our runway was one…But then growth started to slow down. The average value of items listed steadily declined and our fees were based on this value, so although we were growing transaction volume our revenue wasn’t budging. We started to see some holes in the business model. Whilst our retention was great, we worried about our activation rate.In an attempt to save ourselves we made one more pivot; this would turn out to be our last one. The pivot made complete logical sense based on all of our research, but introducing it to our community was a nightmare. There was mutiny within the app. While our top line metrics shot up in a massive way, our one metric that mattered — transactions — plummeted.Meanwhile, I had approached our existing investors about getting a bridge. I knew we had something really special with amazing potential, if we just had enough runway to give it an extra push. I also knew we weren’t perfectly poised to raise a bridge round, unless our existing investors were going to pony up the cash. We’d been in the market a while, and although we had to overcome a number of setbacks to get out here, that didn’t seem to matter too much to external investors. Bridge rounds just aren’t that sexy.We only had one institutional investor in our previous funding round, and I was so relieved when they told me they wanted to lead this bridge. Boom! It looked like we were going to live to see another day.I sent through the due diligence documents and worked with them to answer all their questions.They were taking longer than anticipated to get back to me so we could get the deal done and move on. Then one Wednesday I got a call from them, and the line was kind of crackly. However, it sounded like they not only wanted to lead, but they actually wanted to fill up the entire round! Relief flooded through my body. I was so nervous.And the rest of the conversation explained why they would not be doing that. My stomach dropped. I knew they were our best shot of getting the money, and some of the angels who had previously invested were interested in coming in but only if I could get a VC to lead it, probably for some oversight. We now had very little cash left, and very little time to find someone else.Turns out, under closer scrutiny some of the other partners in the firm didn’t like how competitive the market was. 99dresses was squarely focused on trading cheaper fast fashion (fast fashion is really hard to re-sell for cash), but all the competition were mainly focussed on buying & selling designer fashion. Despite our differentiation, the space is crowded and the competitors are well funded to the tune of tens of millions of dollars each.I felt my voice crack whilst I was talking back on the phone. I was trying so hard to hold it together and be professional, but I could barely speak without it being obvious I was crying. Damn emotions! I was embarrassed.It was night time and I walked over to Marcin’s home in tears, fully expecting him to take the safe and responsible route of deciding to get another job. He had a family to support, and I felt an extraordinary amount of guilt for putting him in that position.Instead, Marcin surprised me. He wasn’t willing to give up that easily. None of the team were. I was taking on this massive burden and internalizing everything, when in actual fact my team was prepared to fight to the end alongside me. We made a plan for cutting our costs to extend our runway whilst we tried to get some more cash in the door.The next day I gave notice on our office, and let someone go. We were already a very lean operation, but now the work of 2 was being done by 1 person on operations, and we shifted our focus to only the most essential tasks to buy us more time.I didn’t tell many people about what was happening. You’re not supposed to talk about this shit. If someone asks how your startup is doing, you fire off some kind of positive phrase like a reflex. My friend gave me a hug and told me to go read ‘The Hard Thing About Hard Things’ by Ben Horowitz. I bought the book and sat in a coffee shop that Saturday afternoon reading it through. I identified so much with the struggle — I’d been through it many times before whilst aboard this emotional rollercoaster.I realized something: I was fucking tired — physically and emotionally. I wasn’t sleeping properly. I hadn’t been on a proper holiday since our ‘schoolies’ beach celebration straight after I finished high school in 2009. The holidays I had tried to go on just ended up being long strategy sessions in my head to figure out my next move whilst lying beside a pool. All I could think about was this damn startup and it was completely consuming me.I had no bandwidth for anything else. When someone asked what hobbies I had outside of work, I’d laugh. I’d recently started having mini panic attacks whilst I was doing ordinary things, like taking a shower or doing my hair. I felt like a shitty friend. I couldn’t even contemplate having a relationship (I tried that before, but yet again this startup won out over him). I wasn’t sure how much longer I could do this.My mother told me to trust my gut. If my gut told me that I didn’t have faith in the business, then there is no shame in winding down the company and moving onto something more productive instead of raising more money. I’d learned an awful lot in the past few years.I told my mum I didn’t trust my gut when it came to this. My gut was telling me to quit. Problem was, my gut had told me that before in my darkest hours and I still pulled through. If I had trusted my gut then I would have quit years ago.I knew the only way this was going to die was if we were killed. I am not a quitter. I owed it to myself, my team, my investors and the 99dresses community to see this through.I continued approaching investors without luck. I’d be invited to cocktail parties full of VCs where I’d don my painful sky-high heels because I’d split tested heels vs. flats, and for some reason a 5'11 woman in 7 inch heels commands more talking time and attention from investors than one in the comfy flat booties I wear to work. Apparently height gives you presence. Once or twice I’d have an investor asking if I knew what an angel was, or if I also modelled because of my height, or some other unintentionally patronizing comment that I doubt any guy would be subjected to. I learned to take it all in my high-heeled stride.I kept hearing the same thing from these investors. “That’s a very interesting business, but we’ll either put in the first money or a series A. We don’t do in between. I’d love to keep in touch though, and see you progress to a series A where we might be able to help. Oh, and why aren’t you getting this bridge from your current investors?”I remember one day Marcin joked that I was a control freak, and I was really surprised. I’d never perceived myself that way — I just liked things done a certain way and to a certain standard that matched the vision in my head. When it came to non-99dresses related stuff, I thought I was pretty chill.Over the past few weeks leading up to this event I did start to get a sense for what he was talking about, though. I wasn’t a control freak in that I was obsessed with controlling outcomes — I was a control freak who just needed to be in control of the inputs.This became more obvious as everything started looking more and more hopeless at work. I started eating much healthier, strictly cutting out wheat, sugar and anything processed. To take a mental break I would read about bio-hacking, which is incidentally all about understanding and controlling how inputs effect your body. I told myself this would give me more energy to hustle, but really I think I just had to feel like I had control over something — anything — when my startup’s fate felt so out of my control.With a few weeks of cash left, Marcin and I agreed to use our remaining time to shut down the app gracefully for the sake of ourselves and the community. I came into the office that day prepared to have a hard conversation with him, but we both looked at each other and knew it was over. There were some tears, and I was grateful to have a curtain of long dark hair to hide my bloodshot eyes behind as I walked through our co-working space. I felt physically sick all day, and my stomach wouldn’t let me keep any food down. I lost my appetite for the rest of the week.My first instinct was to apologize — to Marcin, to my team, to my investors, to the loyal community we’d built. I felt shame, guilt, embarrassment — like a shepherd who’d led her sheep off a cliff when it was my responsibility to keep them safe. I logically knew that I shouldn’t feel these things, but emotions aren’t always logical.In fact, I didn’t really know what I should be feeling. I’d been working on this company ever since I finished high school, so 99dresses was all I’d ever known. It was a huge part of my identity — I was “that 99dresses girl”. Who was I without this startup? I had no idea. Just an ordinary girl, I guess.My friends invited me out to drink away my sorrows and get my mind off things, but I just didn’t feel like it. I was scared I’d meet someone new and they’d ask me what I do, and I wouldn’t know how to answer. I was also embarrassed because I couldn’t afford to pay for anything superfluous anymore — I still don’t know how I’m going to pay rent at the end of the month. As a woman going out in NYC my nights were normally cheap because cute guys would buy me drinks, but I am not the kind of woman who expects that. I’m independent. If I couldn’t pay for myself then I wasn’t going out at all.I wasn’t depressed so much as disappointed. I tried so fucking hard, and I still couldn’t make it work. There are many things I would have done differently were I to do this all again, but Marcin and I agreed not to get sucked into the ‘shoulda woulda coulda’ trap. “No regrets”, he said. We both learned some hard lessons from our mistakes, but it also made me realize how much luck and timing are often huge factors in success and failure.The next day a report came out by a startup with a very similar model to us, but in a different vertical. We’d traded 3x more items than them in our first 8 months of the US app being live, had 2.5x more members and had a business model in place — all with a team half their size. They’d gone on to raise a sizable series A; we’d failed. Our investors said we did a lot with the money we had.It’s easier to accept defeat if you try and try and try but don’t get anywhere. You call it a failed experiment. The failure is easy to justify.It’s incredibly frustrating to try and try and try, and when you finally start to get some good traction you fall off a cliff. Our business still had problems, sure, but so does every other startup.So this is where the story comes to a close. My friends all ask me if I’m fine, and I honestly think that I am. It’s been a wild ride, but it’s time to move on.A cruel consequence of my failure is losing the US visa I worked so hard to obtain. Once I stop being the CEO of 99dresses I technically have 10 days to sell all my possessions, pack my bags, say goodbye to my amazing team, my friends and the life I’ve been building here, and leave.That being said, I’m excited to start a new chapter. As much as I love startups, it’s somewhat liberating to have no responsibilities to anyone but myself — no team, no investors, no customers to look after. Maybe now I can be a normal 22 year old for a while: indulge my wanderlust, make some bad decisions, try something new.I’ll be taking some time out to recharge whilst living with my parents in a country town of 2,000 people where the internet is slow and there is no Seamless. I hope I survive. Honestly, I’ll probably get bored within a week and start working on a new idea. I already have a few.When I started 99dresses I was going to go big or go home. It’s been a great adventure, but now I’m going home.So that’s it. That’s my story of what failure feels like. I hope reading it was as helpful to you as writing it was cathartic to me.Most startups fail, and yet this industry doesn’t talk about failure nearly enough. I’d encourage anyone who has failed to write about how it felt, as I can’t tell you how much that would have helped me in those final months & weeks. I just wanted someone to relate to. Instead, I was left feeling isolated and ashamed.In fact, I thought it might be therapeutic to curate a collection of stories from founders who have failed and put them together in a book. It might be a little project for me whilst I take some time off, and I’m sure it would be helpful to someone in my current position.If you want to get involved or contribute your story then shoot me an email. My email address is nikki @ 99dresses dot com (yep, I’m going to need a new email too — still haven’t sorted that out yet).I thought I’d end this post by publicly thanking everyone who has been a part of the 99dresses journey.To my co-founder, Marcin — there is no one I would have rather had by my side through this experience. The sacrifices you made to make this all happen are nothing short of inspiring. If Zoe was old enough to say anything other than “this!”, I’m sure she’d tell you how proud she is of her dad. I’m going to miss your terrible jokes.To the team, past and present — thank you so much for all of your hard work, perseverance and loyalty. Chandra and Oguz, you guys are amazing. I loved coming in to work every day because you always made it fun. I’m going to miss you all immensely. When I do another startup I’ll be coming after you guys again :pTo the wives, Natalie & Semiha — I’m sure it’s not easy having your husband involved in a startup. You were both so supportive of the long hours, sacrifices and emotional ups and downs, so thank you.To my family — you guys have always been my #1 supporters. A special thanks to my mum for putting up with me, even when I was a stressed out and horrible daughter. You’re the strongest woman I know, and I hope one day to be as bad-ass as you.To my friends — I couldn’t have done this without your support. You celebrated my highs and comforted me in my lows, and for that I’ll always be grateful.To Matt — You’re the reason I got this far in the first place. If it weren’t for you I probably would have failed in 2011.To my investors — thank you for believing in my vision and trusting me to fulfill it, even through the rough patches. I really do appreciate it.To our community — without you, we’d be nothing. Thank you for loving 99dresses, and spreading the word. Many of you I now consider friends, and I’m so grateful for your support and loyalty.Ok, that’s it. It’s over. Now it’s time for a nice long sleep."}