{"title":"My Startup Failed","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"Lessons learned from a first-time founder in the startup trenches","lang":"en","canonicalLink":"https://medium.com/@jasonhuertas/my-startup-failed-6c54bd68c654","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*HaQJD0B4hvy3kHssD3Xxtw.jpeg","videos":[],"text":"Lessons learned from a first-time founder in the startup trenches“Hi, I’m Jason from Critica.” That is how I introduced myself for the past year and a half. My startup was my identity. And now it is no more.My first startup failed. As a founder, and especially as the CEO, that was a tough pill to swallow. Because, at the end of the day, it was my responsibility to steer the ship.This article is meant to be the final page of my Critica chapter. But more importantly, I want to share the biggest lessons I learned coming out of it all, so that other entrepreneurs can strive where I stumbled.My two cofounders and I wanted to change the way we interact on websites. We pictured annotated websites, with lively debates happening everywhere, and related websites all connected to each other on one platform — Critica. We built a Chrome browser extension that allowed anyone to share their opinion on any website.Just by seeing our demo on the White House’s website, which does not allow public comments, got us and many others excited. We could democratize the entire Web, giving anyone the power to share their voice anywhere online.We quit our jobs, lived off our savings, worked out of Berkeley’s CET, and then moved to San Mateo when we got an investment from the Boost VC accelerator (Tribe 4, Summer 2014). We were moving full speed ahead. We were going to shake up this thing called the Internet.What They Don’t Say About FailureYou’ll hear the phrase “Fail fast” or “It’s good to fail”. Which is true. You can’t learn without failing. But what they don’t tell you is just how utterly devastating failure actually is for an entrepreneur. To sacrifice your personal relationships, finances, and health to the dream, and to still come up short. How could this happen to me? It was a very frustrating and dark place to be in.But if you should find yourself in that situation, remember that others have been there before you. They have bounced back, and so can you.An email I received from a friend who had a failed startup:“Most surprising thing to me was how long it took to get my s*** together afterwards… Probably not the most inspirational statement, but it’s the truth.”To hear a fellow entrepreneur say those words was the helping hand that I needed to finally slap me out of my misery.We were all first-time founders at Critica, and pretty much just out of college. And most first-time entrepreneurs don’t listen to advice very well (especially first-time CEOs — I know I didn’t). The trait that makes you believe that you can be the statistical anomaly is actually the same trait that gives you blinders when you are in the startup trenches for the first time. You think that you know it all. After all, you’re already successful in your mind, so who cares what others have to say? Fight that urge every day…You know nothing.Pay attention to the people who have been in the trenches before you. Not all advice is created equal, and knowing which advice to take is very hard. But even though they may not necessarily be right, you should at least consider their advice. They are trying to prevent you from falling where they have fallen before. Since my startup failed, I have returned to my mentors, to let them know how much I appreciated their advice, and how much I wish I had listened to them earlier.Your Idea Is Not SpecialAnnotating the web is not a new concept. This idea has been tried going as far back as the early 90s — back when the three of us were enjoying our nap time in kindergarten. Google even tried it, and it didn’t work. Now that doesn’t mean it will never work (I still believe it will). But with my first-time founder blinders on, it didn’t matter that others failed, those people were not us — we were better, and we were going to succeed.I didn’t dive deep and learn from others who have tried and failed at executing the idea. There were definitely key learnings that I picked up along the way, after we had already built the product. I could have easily learned the same things before we wrote even a single line of code. And that would have vastly changed our focus, and saved us a lot of time.At v1, you already have a product that people are using. Your problem is growth. You can do user research on your existing users to figure out which new features you can build to get traction.At v0, you have no users. Your assumption should be that nobody wants your product. If you have that mindset, then you focus your time on finding who (if anyone) wants the thing that you have mustered up in your head. And along the way, you adapt and tweak the original idea. Before you build anything.Reid Hoffman says this perfectly after his first startup’s failure, before he founded LinkedIn. And Peter Thiel, founder of PayPal, just wrote an entire book on this concept.My biggest mistake was believing that we were in the v1 paradigm, when we were always in v0. We spent months and thousands of lines of code building out feature after feature of a product that had no users — the “build it and they will come” mentality.We built a product before understanding the real user need. I now look back at that mistake, and I can’t believe that I fell into that trap.The ‘Zombie Award’ is given to the team at Boost that always seemed to be working in the office. Critica received that award, and I can tell you that it was well-deserved.I remember the daze of the 16–20 hour days, 7 days a week. The chugging of Red Bulls, coffee and soda to stay awake. Saying goodnight to someone only to greet them in the morning from the same spot they left us in.It was a bit insane looking back. But I believed that the bags under my eyes were the mark of a real entrepreneur. I felt that if I wasn’t falling asleep at my desk, I was not working hard enough to be playing with the big boys in startup land. And while that perception is definitely out there, it is 100% wrong. If you’re focusing all your time on the wrong things, you end up going nowhere, burning out.I have the Zombie award on my desk now. It’s a stark reminder that the more hours you work, doesn’t necessarily correlate to a successful outcome. To the Zombie founders out there — STOP! It’s easy to get caught up in the bushes moving towards a cliff that you can’t see until it’s too late. Focus on the right things. Get some sleep. Get out of the office. Have a personal life. You’ll be better off for it. And you won’t have others making fun of you while you pass out in your chair.It got so bad that I was immune to the Red Bulls.Most startups fail for one of two reasons. They run out of money, or they have some sort of founder breakup. Often times, the first leads to the second.There’s this perception that people are just handing out wads of cash here in Silicon Valley. That is not true. If you are all first-time founders just out of college, you are an unproven team. Which means that you need significant user traction to prove to investors that you have a company worth investing in. We did not have that traction. And so we ran out of money. My cofounders and I couldn’t pay our bills.Here’s what my personal bank account looked like at the end…Going into the negative was definitely a first for me. I hope to never be at that point again. But even if I should have to, it’s not so bad. Many people are afraid of the financial risk of building a startup. That risk is clearly a real thing, but even if you should experience hitting that financial bottom, the world won’t end. Life goes on, even if you’re broke.To my two cofounders, Alex and Bryan. We were college buds long before we started a company, and after what we just went through together, I know that we will be friends for many years to come.I’m honored that you both had the faith in me to forego large Bay Area engineer salaries and be with me day-in and day-out. When you’re in the trenches, the soldiers to your right and left are the people that keep you going forward. And you guys kept me going.To our investors at Boost VC— Adam and Brayton — thanks for taking a chance on three first-time founders. When most people said ‘No’, you both said ‘Yes’. I will never forget that.To the countless entrepreneurs and mentors who took the time to give us advice and help, thank you. Paying it forward is a real ethos in the tech world; it’s built into the fabric of Silicon Valley, and we experienced that first-hand.To our early users (the very few of you), thanks for taking a chance and bearing with us as we tried to figure things out on the fly.To my friends and family, thanks for all your support and understanding while I chased the dream. I know it seemed as if I fell off the face of the Earth for the last year and a half. I’m back now — a little battered and bruised — but back nonetheless.A founder sent me the following poem after I told him about Critica’s failure. It really helped me to bounce back. This is now posted at my desk, right next to the Zombie award. To the entrepreneurs out there — remember these words.The Man in the ArenaIt is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat.So now it’s time for our next adventures. Alex and I are lucky enough to get to keep working together. We are now at a startup that is working on a similar vision as we had for Critica — making websites more interactive. Bryan ended up at a fellow Boost Tribe 4 company.I’ll be in the startup trenches as a founder again. I just don’t know when that will be. What I do know is that I won’t make the same mistakes the next time around. The startup game is all about learning until you get it right. After all, you only have to be right once.Help get this in front of other entrepreneurs — Hit ‘Recommend’ below."}