{"title":"Another catchy headline why you should read this article about how my startup failed","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"Last month we announced the closing of orat.io. Orat.io was a PRO and CON discussion platform and plugin for bloggers an…","lang":"en","canonicalLink":"https://medium.com/@3x14159265/another-catchy-headline-why-you-should-read-this-article-how-my-startup-failed-ef58e3993a1b","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*QVa8X9xc5F7_ARz6N0IWOg.png","videos":[],"text":"Last month we announced the closing of orat.io. Orat.io was a PRO and CON discussion platform and plugin for bloggers and publishers.\n\nMy colleague Bernhard and I started our company as a hobby project in Summer 2013 beside our studies. After running the orat.io platform for about 1 year, we decided to build a widget, so bloggers and publishers can integrate our discussions in their website. In spring 2014 we join the Axel Springer Plug and Play Accelerator.\n\nIt was a great journey we went through. I talked to a lot of great people, got a lot of (good and bad) feedback and learned a lot while building my first startup.\n\nNevertheless, there are a lot of reasons, why our startup eventually didn’t work out. I summarized some of our main pitfalls and learnings we had. All of these reasons are very subjectively and may not be true or appropriate for a different product or industry.\n\nReplacing an existing product is much harder than introducting a new product. The risk of replacing an already working product/plugin is too high for many companies, especially if the company can’t benefit (= get more revenue) directly from it.\n\nWith a discussion plugin like orat.io, which aimed to raise revenue implicitly through user engagement and brand building, companies couldn’t see a raise of revenue in first place.\n\nWe totally underestimated the time we needed for sales and support. Especially when it comes to big corporates (like media houses), sales will take much more longer than expected.\n\nTo make an easier transition when replacing their existing comment section, we offered a 30 day free trial. For most customers we needed about 1 month for upfront “sales” (most of the time is figuring out who is the person in charge for such a decision), so that customers are willing to give it a try. After the 30 day trial period, most companies needed about 1–2 month to evaluate the outcome and ask their manager for budgets. That ended up in ~3–4 months acquisition time, which is way too much for a startup with only 25k in funding and a 6 month runtime.\n\nWhen launching your product, it’s very important to decide on which customers to focus on. In our case we had to decide, if we want to focus on bloggers or corporates. Since bloggers are hard to monetize, we decided to go for corporates and media houses. This was probably not the best decision, since bloggers are hard to monetize, but they are adopting new technologies or tools way more easily.\n\nYou can build the best and most performant software ever, still no one bats an eye. The only thing which is important is your product, not your codebase. You can have the shittiest codebase on earth, if people love your product, it’s ok. Unfortunately it doesn’t work the other way round. Therefore use your time to talk to (potential) customers instead of improving your software, especially when joining an accelerator. This will also be your biggest benefit for the future, even when your startup fails.\n\nNone of these reasons is an excuse that orat.io didn’t work out, rather it was a crucial learning. Nevertheless it was a great experience which I didn’t regret and at some point in the future I’ll definitely find a new project to work on again. For now, I’m happy that I had the possibility to join SmartHires (a YC backed company) in it’s early stage to help them with my “wisdom” and “software witchcraft” ;).\n\nIf want to talk or just like this post, ping/follow me on twitter , where I tweet (or rant) about software development, startups and random daily stuff."}