{"title":"99 Problems But A Bit Ain’t One","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"I’ve been told that Silicon Valley rewards failure. I’ve been told to ‘Fail Fast, Fail Often.’ I’ve also been told that …","lang":"en","canonicalLink":"https://medium.com/adventures-in-consumer-technology/99-problems-but-a-bit-aint-one-why-my-startup-failed-9367978a6bf3","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/1*7W1DIzk_mNA_ZnV0yb2akQ.jpeg","videos":[],"text":"99 Problems But A Bit Ain’t One: Why My Startup FailedI’ve been told that Silicon Valley rewards failure. I’ve been told to ‘Fail Fast, Fail Often.’ I’ve also noticed that writing a philosophical post-mortem is a good way to earn credibility and drive traffic for your next startup.I’ll try my best at #3 but let me first provide a little feedback on what was Emjoyment, and why a ‘bit’, ie code, was not one of the reasons we failed. First, here are the five W’s on us:I graduated from Penn in 2012. I began my career as a miserable investment banking analyst, who escaped to rainbow-colored halls of Google. Then, I pursued a side project all the way to its grave.What was it?Emjoyment was Tinder for Jobs. Essentially, a jobseeker was presented with roles at companies and simply had to swipe right to indicate his or her interest or lack thereof. If the employer was mutually interested, the two parties would be connected.When did it take place?Where did it take place?Why did it happen?I felt stuck in my first job, so I wanted to create a simple platform to help others get ‘unstuck.’Oh, and why did it fail?Good question, here’s 99 reasons but a bit ain’t one (inspired by Rolf Dobelli’s “The Art of Thinking Clearly” and, of course, Jay-Z).Survivorship Bias: +90% of startups will die, but not this one.Swimmer’s Body Illusion: I read the gospel — The Lean Startup, Traction, Hooked, and More. Whiteboarded. Stayed up late. Wore sandals. Looked in the mirror…and was still a Business Guy trying to learn the ropes.Clustering Illusion: We got +1,000 users with just a single Reddit post. Acquiring jobseekers will be easy. It wasn’t.Social Proof: “We have to launch at TechCrunch Disrupt. Everyone does that.” Hmm…that was expensive.Reciprocity: Has anyone ever told you to never accept a free drink? Be wary of those offering free help to grow your startup. Major time drain.Confirmation Bias: “Our retention isn’t abysmal.” Look at this small cohort of users. Great success!Authority Bias: “Guys, we need to create a toothbrush product.” Larry Page said so. Does anyone use AirBnB everyday? Do the ‘employed’ think about their next job everyday? Probably not, oops.Contrast Effect: Compared to Indeed.com, Emjoyment was a supermodel. But then again, would Prada compare itself to Forever 21?Availability Bias: We picked a market focus where we knew the most people. Warning — things don’t happen more frequently just cause we can think of them more easily.The It’ll-Get-Worse-Before-It-Gets-Better Fallacy: Let’s give it some time before we make a change. Employer engagement could turn around. Nope, never did.Story Bias: Because it’s 85 degrees out, people are probably at the beach and, therefore, not thinking about jobs #NiceStoryBroHindsight Bias: But you never made these mistakes with your own startup, right?Overconfidence Effect: A VC from Sequoia warned us that he had never encountered a job matching algorithm that worked. I guessed he hadn’t seen ours yet.Chauffeur Knowledge: If someone asks you how you vet your job seekers and your answer is a ‘proprietary algorithm based on billions of data points’, and your team collectively has zero years of recruitment experience, then that person will probably think you are full of s#!t.Sunk Cost Fallacy: Maybe, we can tweak our code to be the Tinder for Tinder apps…?Illusion of Control: We vetted all our jobseekers to give employers a better experience. Their experience didn’t change.Incentive Super-Response Tendency: Don’t ask a barber if you need a haircut, and never ask a lawyer if you need [insert anything].Regression to Mean: Things can only get better from here. This is true if your closest competitor gets a TC Article the same day you hit the iOS app store.Outcome Bias: The Lean Startup tells us to be data-driven, and so we were with our initial sample size of 100 homogeneous Penn friends. Not smart.Paradox of Choice: If you’re like me, the menu at Cheesecake Factory is the most intimidating thing you’ve ever seen. We ignored this fact when we instructed users to complete this sentence “I’m a ____.”Liking Bias: When you’re the non-technical co-founder who doesn’t know what a LAN party is, you can become the odd-man-out. This is problematic when we conflate ideas with people.Endowment Effect: Emjoyment was our cute, awkwardly-named baby. How much would we have sold it for? Maybe a billion.Coincidence: It must’ve been a coincidence that LinkedIn launched a standalone job search app in June 2014. Not true.Groupthink: “We got to build an Android app quickly.” We built it, and we never launched it.Scarcity Error: One day, my co-founder brought home two adopted cats. This must’ve been at play. The cats didn’t work hard enough.Base-Rate Neglect: Elon Musk went to Penn. I went to Penn. Probability in my favor.The Anchor: Tinder worked for dating, so it’ll work for jobs.Induction: “If you work hard in this life, you will be rewarded. If you take shortcuts, you get cut short.” — Rev Run. It worked in school, so it must be true for startups. Not necessarily.Loss Aversion: I told my team let’s just not do anything stupid. Not the best mantra for promoting creativity.Social Loafing: When we were just a team of three, I reached out to twice the number of employers as when we were a team of seven.Exponential Growth: “When it comes to growth rates, do not trust your intuition.”Fundamental Attribution Error: I guess this post is a good example. I like to think ‘we’ failed…but maybe y’all failed us.False Causality: Were users more active when they got a ‘match’? Or did they get a ‘match’ because they were more active?Forecast Illusion: Listen up, Tinder for jobs is the future. I predicted Uber before it blew up. But didn’t I also guess that Yelp would cease to exist by 2014? Just ignore that.False-Consensus Effect: We wanted to swipe to apply to jobs, so everyone must want to. False.Omission Bias: Ugh… this is getting hard. Probably better if I omit 40 through 99. Those are just the minor problems.If you made it this far, sorry #15 — “the sunk cost fallacy”— got us too.Seriously, thanks for taking the time to read.If you want to see what we are up to next. Subscribe to our Early Access list at campuskudos.com."}