{"title":"Bookish is a failing startup that could fundamentally change digital publishing","favicon":"https://dnqgz544uhbo8.cloudfront.net/_/fp/icons/favicon.n7eHNqdWyHhbTLN2-3a-6g.ico","description":"Full disclosure: I was a software developer for Bookish from March 2011 to August 2012. ¶\n\nI don’t know what is going to…","lang":"en","canonicalLink":"https://medium.com/@lazyvalue/bookish-is-a-failing-startup-that-could-fundamentally-change-digital-publishing-d6cbe96c0bd8","tags":[],"image":"https://d262ilb51hltx0.cloudfront.net/max/800/0*waKTxuktGsLcNXKi.jpg","videos":[],"text":"Full disclosure: I was a software developer for Bookish from March 2011 to August 2012.\n\nI don’t know what is going to come of that not-that-hip and not-so-new publishing startup, Bookish. The company, a joint venture between three publishing giants (Penguin, Simon and Schuster, Hachette), describes itself as a new destination to connect readers with books. After three years of development, three CEOs, many many product managers, and about ten months live, I’m not sure how the website accomplishes that goal. Despite its troubled history and a currently sad, undesirable product, with a change in focus Bookish can deliver on its promise to readers and become a star of the publishing industry. If the company stopped being a shallow container for banner ads, I think it could significantly change the way online distribution of books works, and how we interact with digital book content.\n\nToday, you can visit the website for a catalog of in-print books currently for sale in the North American English-speaking market. A small subset of these are available to buy through a slow and tedious e-commerce experience from Baker and Taylor.\n\nBookish also offers up an editorial section with articles telling you what dieting books you need to read for that one weird old tip for a flat stomach, or even worse, pieces that embarrassingly flail around tying pop culture to literary classics.\n\nThere is one neat, novel feature. You can type in your favorite books and authors to get a recommendation of what you should read next. The engine behind this feature produces results of wildly variable quality. Some inputs produce accurate results and great discoveries. With others, either no recommendation exists or the returned suggestions are distant cousins in a loosely organized genre.\n\nThe Bookish website amounts to little more than a brochureware showcase for whatever pop books its backers are trying to push this month. It is an empty advertising website. For every feature that might compel you to visit, multiple websites do it far better, and each has been around for much longer. Nothing beats the e-commerce experience of Amazon.com, which pairs the convenience of one click overnight delivery shipping with the option to buy any of the other crap for which you might go to Wal-Mart. LibraryThing is a community comprised of people with an endless depth of passion for books, generating content and recommendations based on more analysis and meaning than any machine can produce. Lastly, you can go, well, literally anywhere if you want better editorial content.\n\nThe reason why I am critical of Bookish is because it can be so much more. Reviews, product search, and recommendations are just a few small problems in the domain of digital publishing. There are still so many other interesting products and applications to build. If Bookish wants to connect readers with books, it has many directions to go. With a large amount of capital, amazing industry connections, and a forward-thinking approach with respect to technology, this company could change everything.\n\nRetailers like Amazon, Apple and Google completely own digital distribution of ebooks. These digital retailers dictate formats, price (?), promotional materials, and consumer experience.Ebook purchases are not interoperable among vendors. An ebook purchased from Apple will not work on a Kindle or a Nook. Consumers are locked into silos built by digital retailers, brand allegiance is forced by incompatible formats. Would you buy a DVD if it only worked with one brand of player? Walled gardens created by vendors by definition lock out others, such as technology products developed by publishers, so it is strategic and necessary for Bookish to care about this problem.To achieve profitability, Bookish must expand its audience by offering unique services and content.A few companies are enhancing the digital book experience with feature extraction, media embedding and referencing, really amazing annotations and sharing features, in-book search across your library, and other ideas I never would have dreamed up. Bookish, representatives of the publishing industry, should be leading these innovations.\n\nThere is an almost impossibly high barrier to entry for physical retail. This is especially true when competing against behemoths like Amazon and Barnes & Noble. Starting a digital distribution business is not free, but it has a miniscule fraction of the startup cost of opening a chain of brick and mortar retailers. Bookish has the capital and the publishing connections. Vendor lock-in aside, there is no monetary or logistical reason why Bookish cannoth be a competing retailer of digital goods such as ebooks and audio books. Bookish simply has not created a compelling incentive — through features, price, exclusive content, or convenience — for consumers to switch vendors.\n\nConsumer-vendor lockin in digital goods is a growing problem which individual vendors have no motive to solve. Google and Amazon are interested in increasing their individual slices of the market instead of sharing customers. Bookish could never compete directly in a market segmented by proprietary technologies. But Bookish could significantly influence and participate strongly in such a market if it forced an open format (with support for DRM) that all vendors must implement. Standards bodies for digital formats have existed for decades. The technology and digital rights management solutions to create a set of protocols for interoperability between vendors, software, and devices are available today.\n\nBookish should develop an open standard for digital books based on EPUB3, partnered with a reasonable DRM format. It should also develop a standard set of protocols for digital book purchasing, lending, and renting.\n\nBookish’s partners should then publish the majority of new digital books and digital audio books only in this format. Vendors who want access to this content would then be required to implement readers for this format, and protocols for interoperable purchasing.\n\nBookish would then be free to participate in a market that was previously inaccessible.\n\nJust as importantly, by dictating the standard, it would be able to exert significant influence over the product form of ebooks in the future.\n\nIn most cases, Bookish would be first to market in implementing this standard and the features it describes, giving consumers a reason to choose Bookish over other retailers.\n\nThis situation would also make it trivially easy for Bookish to make a profitable Software as a Service offering, by provisioning for a fee the services of digital book publishing and sales, to publishers and retailers who do not want to operate their own servers. Through this Software as a Service model, driven by the open standard and protocol, Bookish would enable independent booksellers and retailers to enter the arena of digital distribution.\n\nLastly, controlling this format would help Bookish forge necessary relationships with major vendors such as Google, Apple, and Amazon. Bookish could become profitable without chasing a monopoly itself.\n\nBookish, because of its technology expertise and partnerships with large, influential publishers, is in a unique position to exercise this strategy with a high chance of success. It would be difficult to make an anti-trust case against Bookish or its publisher partners, because by the very nature of the open standard they are promoting, they are breaking down monopolies and fostering free market competition."}