{"title":"Cusoy: A Postmortem","lang":"en","canonicalLink":"http://melissatsang.com/2014/01/15/cusoy-a-postmortem/","tags":[],"image":null,"videos":[],"text":"It’s hard to believe that it’s been exactly six months since I first penned my post What can you do in six months? that began this startup journey in the first place (see Six Month Challenge for a table of contents of my past weekly updates).\n\nThis is the conclusion of the hardest yet most fulfilling six months of my life, so far.\n\nToday I’m going to write a post-mortem about my startup called Cusoy, a curated restaurant finder for people who are gluten-free (from gluten intolerance, celiac disease or as a healthy lifestyle choice) and/or have food allergies.\n\nI. Why I started Cusoy\n\nII. What I accomplished\n\nIII. Why I shut it down (alternatively, what I would’ve needed to continue)\n\nI’ve always wanted to start my own company and saw everything up until this point as preparation for this dream.\n\nIt came at a time of excellent market timing and opportunity.\n\nIt resonated with its intended demographic of users.\n\nIt came during a time when I had the financial and life means to pursue it.\n\nIt originated from a cause I deeply believe in: health and wellness.\n\nI am gluten intolerant and this was a big pain point for me of finding “safe” restaurants when I went out to eat with family and friends, and more importantly, beyond “safe” restaurants, “safe” menu items I could actually eat without getting sick afterwards.\n\nI didn’t find a good solution out there outside of a variety of solutions: calling the restaurant, asking the waiter/kitchen manager, scrolling Yelp to find one or two comments (if any) mentioning gluten free or Googling. I thought, there must be a better way.\n\nYes, Yelp has a tag for “gluten free” but it only has 44 restaurants in San Francisco with that tag (do it yourself if you don’t believe me and NYC actually has double the number of restaurants tagged gluten-free), which is a very low and deceiving number.\n\nMore importantly, it does a terrible job of giving people like me actual relevant information for gluten free: Does the restaurant train its staff? Do they have separate cutters for their gluten free pizza? Are they flexible and accommodating? Do they have a separate gluten free menu? What ingredients do they use? etc.\n\nMoreover, if a restaurant is gluten free and if I am gluten free, dairy free and soy free, what exactly can I eat? What do other people with dietary restrictions like me recommend? I wanted to collect all of that information.\n\nGluten-free apps out there now like Find Me Gluten Free are just okay and barely adequate, but still don’t give me relevant detailed information like I mentioned above. It’s almost completely useless to me — my own research is much more valuable.\n\nAt the same time, the difficulty lies in having accurate menu information and getting information (that I mentioned above) in a way that, while it doesn’t scale, is extremely valuable to the user.\n\n2. It came at a time of excellent market timing and opportunity.\n\nThere are two groups of users: those who have to eat gluten free because of gluten intolerance or celiac disease, and those who choose to do so as a healthy lifestyle choice — with both groups high in number and growing.\n\n* In January 2013, the NPD Group released findings that 1 in 3 Americans are trying to cut down or avoid gluten (over 100+ million Americans).\n\n* In 2012 alone, over 200 million restaurant visits occurred with consumers ordering food described on the menu as gluten-free.\n\n* Moreover, there are 3 million people in the U.S. who have celiac disease, 18 million estimated to have gluten intolerance (though many do not know it) and 15 million with other related food allergies (dairy, soy, wheat, nuts, etc).\n\nThat’s a quick snapshot for those who are not familiar with gluten free and may think it’s some “small niche” with no opportunity at all. Not to mention that San Francisco and the Bay Area is the perfect starting point — SF is the foodiest city in the country and the Bay Area demographic is extremely health-conscious.\n\n3. It resonated with its intended demographic of users.\n\nI took a week to validate this idea with my users and consistently reached out to potential users for additional feedback, resulting in over 100+ quality customer research surveys. Many complained about this problem and were happy to hear I was working on a solution to help them.\n\n4. It came during a time when I had the financial and life means to pursue it.\n\nI am 23, single, no debt or student loans with 6+ months of financial runway. I completely bootstrapped Cusoy from my savings and did not have any other distractions or obligations.\n\n5. It originated from a cause I deeply believe in: health and wellness.\n\nPeople don’t realize the immense importance of proper diet and nutrition. What you eat affects everything, especially your health (not to mention your energy, productivity, etc). The contribution of your diet to serious medical problems and digestive health is often overlooked in favor of complex procedures and prescribing complicated drugs with a lot of side effects. What if we started helping people at the base of the pyramid of having symptoms, rather than the end-stage of the disease?\n\n* Successfully validated a market need that also solved a personal pain point\n\n* Researched gluten free via books, medical lectures and conversations with healthcare professionals\n\n* Designed a 3-week email experiment to study user interest vs. intent to purchase\n\n* Scheduled 6 meetings with Rock Health over the course of 5 months for product/application feedback\n\n* Invited to pitch practice with Greylock Partners and learned how to best pitch Cusoy for seed funding\n\n* Consulted an informal advisory board of current tech employees, former and present entrepreneurs\n\nI felt that Cusoy did succeed in solving the initial problem I set out to solve, but ultimately it was difficult for me to generate money from it (or at least see a clear, predictable way to sustainability).\n\nIII. WHY I SHUT IT DOWN (ALTERNATIVELY, WHAT I WOULD’VE NEEDED TO CONTINUE)\n\nFour reasons (in order of least to most important):\n\nNo longer aligned with my personal goals anymore\n\nNo clear or predictable way to sustainability (B2C is extremely, extremely hard to monetize)\n\nIt’s really hard to do a startup by yourself, especially if you’re a non-technical founder. No kidding, right? However, being non-technical wasn’t my excuse since WordPress came to the rescue and I basically bought the development through using cost-effective themes.\n\nRather, it was overwhelming both physically, mentally and emotionally — morale wise, it was incredibly exhausting. Without anyone else to keep me accountable or really caring about Cusoy as much as I did, it was hard to deal with all my self-doubt and still persevere on when I was essentially my own cheerleader.\n\nI was juggling many things at once — including manually adding restaurants (this was my biggest gripe), sourcing new restaurants, talking to restaurants and users, sourcing new users, reaching out to restaurants, etc. It was just too much work for myself, with little hopes of generating even a dollar in revenue.\n\nAt the very least, I would’ve liked a sales/marketing/business cofounder who would’ve helped to hustle with restaurant outreach, content marketing and so forth. At this point, I didn’t need a technical cofounder since I could handle it myself (for the time being).\n\nWhat about trying to find other people?\n\nI tried Meetup groups and a couple Hacker and Founder lunches and even met another founder working on a food-related startup. I had a meeting with a potential front-end developer from Reddit, and then also met with a potential user from Meetup who actually made a gluten free app four years ago but shut it down. Ultimately, over time, these meetings didn’t pan out.\n\nOver time, I realized the right match would’ve been a developer who also was facing problems eating out while gluten-free.\n\nI also realized finding a technical cofounder is not just trying to find a cofounder that matches you in terms of complementary skills (do they know Ruby on Rails? node.js? etc), but also having the same values, vision, work style, expectations, etc. It’s exactly what you’ve heard — akin to a sexless marriage with the startup as the baby of the relationship.\n\nMoreover, it’s difficult to compete with sky-high salaries and perks engineers already enjoy from working at Google, Twitter, Facebook, etc. when I couldn’t offer a salary, funding or even also strong numbers of product/market fit (or better yet, paying customers or revenues of some sort). I didn’t come across as many who faced this sort of problem of eating out while gluten free, so it was difficult for them to understand and thus find it an interesting project. Not to mention everyone seems to be working on their own projects as well.\n\nI didn’t expect this to happen overnight but went back and forth in terms of how much time I was “wasting” trying to meet other people vs. working on the product itself.\n\nMy hypothesis of five metrics of finding a technical cofounder\n\nI was thinking about this and after talking to some engineer friends, came up with five metrics that cofounders (especially technical ones) care about when they think about partnering up with a non-technical founder.\n\nThese are not in any particular order:\n\nIs the founder technical (or at least trying to learn how to code?); the founder’s background/domain expertise\n\nIf the project is personally interesting / challenging to them\n\nI’m definitely keeping this in mind as one of my goals for 2014 is to find a technical cofounder for my next venture, this time in B2B SaaS.\n\nSince Cusoy is not revenue-first, I was completely bootstrapping from my savings and it was difficult to keep going without watching my money dwindle without much to show for it.\n\nWhat about trying to apply for funding or contacting investors?\n\nI did, with Rock Health. I went to six different office hour sessions over five months with them and applied to their most recent batch, but unfortunately did not get in due to their concerns that Cusoy’s nature would be very difficult to scale and grow and that I needed another cofounder to help shoulder the work. Not to mention Rock Health is extremely competitive, with 99% of their portfolio being B2B enterprise companies, and hardly any B2C ones like Cusoy.\n\nI could’ve tried to reach out to angel investors who are personally interested in the food / health and wellness space, but again, since I was the one doing everything, I didn’t see trying to get funding as a productive use of my time (outside of working on the product and talking to users). Apparently, a rule of thumb suggests that 1/60 actually invest.\n\nTo make it worthwhile to look for funding meant I would need strong growth/traction numbers (like 10%+ MoM) that proved product-market fit to make a compelling case, which I would need more manpower help to get (see: no team). It was kind of a self-perpetuating problem.\n\nI had great early traction with my beta testers very early on, but I felt really burned out and demotivated shortly thereafter… not because Cusoy wasn’t doing well, but that I had increasingly come to the realization that it just didn’t fit with my personal goals anymore and left me physically and emotionally exhausted.\n\n3. No longer aligned with my personal goals\n\nOver time, I realized Cusoy is not meant to be a small-scale, one-person venture.\n\nI don’t know what I expected going in (certainly not everything that has transpired since), but for some reason I naively thought the money part would take care of itself and that somehow by some magical force of willpower, Cusoy would become self-sustaining without the need for investors.\n\nI wasn’t so much concerned that Cusoy’s growth didn’t skyrocket to thousands or hundreds of thousands of users, but more so that it was indeed providing value and that I could perhaps take it to a point where it would become ramen profitable and I could just organically grow the product, team etc from there.\n\nCusoy has the incredible potential to become an organically grown gluten-free brand and community, not simply just a curated restaurant finder. Once I owned the gluten free space, I would have expanded to vegetarians and vegans, Paleo and the like. You can get an idea of how big Cusoy could get (dream big, right?) and particularly given the perfect market timing and opportunity right now.\n\nWhat were my personal goals and how did they change over time?\n\nIn the beginning, I wanted to build a beautifully designed product with a great user experience that helped solve a personal problem, but more importantly, also a problem other users had.\n\nOver time, I realized I wanted to build a beautifully designed product with a great user experience that helped solve a personal problem for me and for other users… that also generates revenue.\n\nI didn’t want a startup, but an actual business that generates revenue, and Cusoy would not fulfill that personal goal for me without a full-time team, 1-2+ years of funding, multiple years of hard work (3-5+ years at the very least?) trying to answer the if/when questions of whether or not Cusoy could make money (very expensive questions too, might I add — not only in money but time, my most valuable asset).\n\nWhile I know there might be a possibility I could hustle incredibly hard and try to set up partnerships, the time investment required far outweighed the already incredibly slim chances of generating revenue.\n\nCusoy ultimately no longer aligned with my personal goals.\n\n4. No clear or predictable way to sustainability (B2C is extremely, extremely hard to monetize)\n\nThis is probably the #1 reason that really was the straw that broke the camel’s back.\n\nI left the most important reason for last.\n\nIf I didn’t have a team or funding but had clear and predictable ways to sustainability, I would have persevered with Cusoy. Absolutely, no holds barred.\n\nBack in October, I read this TC piece on how the percentage of free apps in the App Store will grow to 91-93%. Wow.\n\nActually, as recently as two days ago, Gartner predicted that 94.5% of apps will be free by 2017.\n\nIt makes total sense — if you think about the increasing consumer expectations of free apps and free content. It’s incredibly hard to convince a user to pay even $0.99 (less than a cup of coffee) for an app, since there are many free alternatives available that make it difficult to overcome the friction for consumers to pay.\n\nThis posed an interesting dilemma since I was both the developer and also a user myself of Cusoy, and I certainly would not have paid to use Cusoy. Cusoy is too similar to Yelp, and consumers don’t pay to use Yelp, they don’t even need an account to use Yelp. Obviously, Yelp charges the businesses in order to make money.\n\nWhat about charging restaurants? Partnering with OpenTable and taking a cut of reservations, etc?\n\nOf course, I thought about this, but without strong user numbers and growth to prove to restaurants that Cusoy was in fact responsible for 10 extra reservations at XYZ restaurant last Friday night, it would be hard to convince them to advertise with Cusoy.\n\nBottom line: I needed strong user growth numbers and concrete evidence before I would have leverage to use when talking to restaurants to advertise and partner with Cusoy. I couldn’t get those numbers yet working by myself (especially with no team or funding).\n\nI even played with a certain pricing model — of $1-9/month pay-as-you-go and at-your-discretion payment plan. For instance, if one month you decided to try cooking yourself at home, it may be worth $1 to you a certain month. Then another month, if you’re traveling to San Francisco and are not familiar with the restaurants that are gluten free, you might use it 5 times over the course of a week — and it may be worth $9 to you (a tiny cost at the expected value of not getting sick).\n\nBut even that was an uphill battle and left a sour taste in my mouth — is it right to charge users when they are helping to generate content for Cusoy?\n\nWhat is the crux here?\n\nMonetizing user-generated content is really, really hard. Especially for Cusoy, where it heavily relies on users to crowdsource information and generate new restaurant additions, it doesn’t encourage or incentivize users to do so if they have to pay to use Cusoy.\n\nIt’s interesting too — because it’s kind of a brute force, numbers game with Cusoy. If you think about it, Yelp has 117 million monthly unique visitors but I’d wager only 1% of users actually post reviews, and just a slightly higher percentage actually register as users (not sure how many active registered users there are, though).\n\nWith Cusoy, it is powered by my manual research and vetting of restaurants but heavily relies on active and registered users to post reviews, rate restaurants and even submit restaurants to list.\n\nI would need incredibly high numbers of users since only 1% of them would actually register and contribute back to Cusoy rather than passively consume its content. Again, this goes back to needing another cofounder, team and even funding to make this a reality.\n\nWhy is it so hard to monetize B2C startups?\n\nThis past fall 2013, it was also painful to see a lot of B2C startups shut down — from Forkly, Everpix and Sonar to Flud, Cue and Tutorspree. They shut down for various reasons, but mainly either not being able to reach product/market fit or becoming profitable.\n\nI got a taste of it myself with Cusoy as my personal experience.\n\nB2C is really, really hard to monetize and thus hard to succeed in the long run. Unless you can find a big enough pain point — or go into a deep niche problem, it’s very tough to convince users to pay you.\n\nIn contrast, the inconvenient truth is: if you run a B2B startup you’re more likely to succeed.\n\nOverall, Cusoy served as a great lesson in startups for me and I don’t regret doing it for a second, in spite of its failure to take off or generate revenue.\n\nRead more about my new B2B SaaS venture for 2014.\n\nThanks to Dennis and Connie for editing initial drafts.\n\nP.S. I’d love to meet you on Twitter here.\n\nAnd if you enjoyed this post, please consider sharing it on FB or Twitter."}