{"title":"The idea of giving up is worse than of it killing me: How $150,000 post-it came to be?","favicon":"/favicon.ico","description":"","keywords":"","lang":"en","tags":[],"image":null,"videos":[],"text":"The whole thing started with an innocent promise of two naive teenagers. It was in August 2004, our last summer at primary school, when Premek and I started with our first project – a movie website Coming Soon Planet.\n\n\"We can only succeed if we create a service that will be used by a Honza in the Czech Republic, a John in New York, and a Yuēhàn in Hong Kong. A service that will push the limits of the impossible and that will give everyone something they won't be able to imagine their lives without and they will be willing to pay for it accordingly.\" That was our promise.\n\nBut when we weren't able to fulfill it even by the third project three years later, I started to realize that we are in a boxing ring that works by the rules we do not understand.\n\nAnother four years later, in 2010, it seemed like I haven't moved a single inch forward and behind us were seven unsuccessful projects and seven years of our lives.\n\n\"This is not fair,\" I say to myself, \"being locked up between four walls, day and night. My parents don't give me money, I don't go out and at the same time the guys that went out drinking every weekend for the past seven years are better off than we are. What are we doing wrong?\" I was really hopeless.\n\n\"If we want to win the war, we can't give up after one lost battle. Even if it would be seven battles,\" says Premek holding The Art of War.\n\nSo I get up, shake it off, and breathe deeply. We enter the ring for the eight time, still without any rules.\n\nPremek and I are trying to figure out what will our next project be. Whatever it will be, we need money for it. The last seven years have drained our accounts down to zero.\n\nWe come across a solution – Kickstarter. It's a platform for ideas financed by fans. \"This is it!\" we agree enthusiastically, though we do not know what do we want to collect the money for yet.\n\n\"For US projects only.\" The painful right hook from Kickstarter hits our jaws.\n\n\"This can't be the only service out there?\" I ask confidently. So we look for other similar services, but to our surprise, we can't find any. It seems like we found a market that is not even a half a year old. So Premek then suggests: \"We can do our own service, but without any limitations.\"\n\n\"That's a nice idea, but it still doesn't solve our problem. We don't have money for this,\" I add. So we make a choice to do what we have never done before in our lives.\n\nWe get $500,000 from an investor for an idea\n\nFebuary 2011, month two\n\nBecause that is all we've got. Just an idea. No prototype, no takers, nothing. But we know one thing for certain. \"No more compromises. Either we get the money for what we want to do, or we won't do anything.\" we agree. But how?\n\nAnd like every good startup, we start with a domain. We learn that we need a name for our domain. And for the name, we need an analysis and an identity. After a month of coming up with a visual identity, we finally get it: Starthead. Of course that was an absolute waste of time. We should have focused on searching for customers, not coming up with a name.\n\nAs the next thing, we create a brochure (czech only) of why group financing makes sense. We send it to our list of investors. Responses start to fill our inbox and I am starting to realize that I'm gonna cry into my pillow today.\n\nWill we survive the clash with reality?\n\nApril 2011, month four\n\n\"The ideas are pointless. The team and realization are the most important!\", says the investors' mantra.\n\n\"But why aren't they interested in who we are, why are we doing this and what are we trying to achieve?\" With amazement in my face, I read the fifth response that deals with the idea, but not with the team. \"Let's get to the people. This doesn't work,\" I suggest.\n\nWe ecclesiastically go to the first startup scene meeting in Prague, to the opening of the StarupYard. This story describes the situation of that day probably the best.\n\nTen minutes after the beginning, a guy in a motorbike outfit comes into the room. He heads to the last free chair in the front row. He takes the last seat and pulls up his iPhone and he focuses on nothing else for the rest of the propagation. It's hard to say what he's doing with it, but it's apparent what he's not doing. He's not paying attention to any startup that is presented three feet in front of him. He just laughs into the silence from time to time. Who knows what he's laughing about. \"Why the hell does he even go to this kind of events, if he's not interested in them?\" I wonder.\n\nSoon after that I discover that it's an investor. And I just don't get it. \"This is the startup scene full of stars, hackers, motherfucking pterodactyls, where everybody helps one another?\" This is more like Hunger Games. A few idiots fight for their lives while the guys at top are having fun.\"\n\nI'm coming back to Brno with really mixed feelings. And when this repeats at other three events, I'm starting to realize that this isn't the way go.\n\nWhat follows is a month of meeting with investors in person. We spend four days a week in Prague by now, but without any result. The group with the best approach was surprisingly BlackLex (David Dostal and Przemyslaw Kuffel), that we heard about for the first time, and then Miton, that everyone knows very well (with Ondra Raska, Milan Zemanek, Tomas Matejcek, and Michal Jirak). But not even they were interested enouhg to be willing to invest in us. Only one guy, Mara, who has more teeth than as cetacean, stands between us and total hopelessness.\n\n\"While racing, I accidentally found a guy who would want to invest in you.\" says Mara like it's nothing. And one week after that, I'm asked a question that is supposed to change how I feel about the past seven years of no progress.\n\nWill you move to Prague?\n\nJune 2011, month six\n\nWhat came before this question was Mara's pitch for his friend from PPF, who a minute later added: \"Nice idea, but we don't invest below a million euro.\"\n\nHard to say if that really was the issue or if he just wasn't interested, but it was at least something. A chief technology officer of an IT company in Prague was sitting at the next table. \"This sounds interesting. Can you tell me more?\" he asks. And Mara gives him my email and phone number.\n\nA few days after that, we're going to Prague where the key question is asked by the investors: \"If we agree to this, will you move to Prague?\"\n\n\"Better than sitting and just doing nothing,\" we agree and accept the terms that we thought were absolutely appropriate:\n\n* 60 % belongs to the investors, 40 % belongs to us. The voting rights are divided by four (Premek, I, and two investors). That is the price for just an idea without a functioning project.\n\n* We will get paid when we make a profit. Expenses are approved by the investor. Later on we realized that was a big mistake.\n\n* We start in 90 days. A deadline that looked absolutely doable until the team came along.\n\n* They will assign a development team to us.\n\n* We will programme in Java that Premek doesn't know how to work in. Java in this case was a complete overkill.\n\n12 hours later, we are not living in Brno anymore, but in Prague with promised $500,000. We are sitting in the conference room waiting for a team that we don't have a task for and only after that I notice a certificate that is pinned on the wall.\n\nThe team arrives and I find out that the lack of task doesn't matter. Everyone works agilely. Waterfall is punk. This is no place for punkers. The development is agile, the coffee is agile, the markers on the flip chart are agile. This is the lair of agile enthusiasts. I'm starting to understand why there is an OMG on the wall.\n\nPremek discovers that on July 29th, Warsaw holds the TechCrunch Ad Hoc Meetup for 70 people. With the words \"this is our best chance to ever get to TC,\" he immediately signs us in. It was close. Five minutes later, everything was taken.\n\nHow we didn't get to the TechCrunch\n\nJuly 2011, month seven\n\nThe ink is still wet when I leave the printing office with a hundred business cards and got into the car. It's 10:42 and we are heading from Brno to Warsaw, where we need to be at six p.m.\n\nWe are passing through the border half an hour earlier, when we realize that Polish highways start to resemble a Hot Wheels track.\n\n\"Did you see the sign?\" I ask. I'm starting to understand that those are not Hot Wheels tracks but disassembled bridges that are waiting to be repaired.\n\n\"Ouch,\" echoes through the car. And over the horizon, we see what we know very well from Czech highways.\n\nWe lose three hours in traffic jam and restrictions. \"We won't make it!\" I hysterically yell in the car 21 kilometers outside Warsaw and 10 minutes before the Meetup starts.\n\nHour and a half later, with a pack of business cards in one hand and despair in the other, we enter the café.\n\n\"Is anybody still here?\" I ask. Nobody has a tag and everybody is talking to each other. But then something occurred to me.\n\nI go to a bathroom to wash my hands. In a minute, I am back and loosening my shoelaces. I stand up on a chair in my socks and I shrilly whistle with my fingers. The barista lowers the music volume. And then, with the attention of the whole room, I start: \"Hi guys. I'm Michal from Starthead. I'm so sorry that we're late...\"\n\nThere was only one problem. I thought of this on the way back.\n\nWe actually just entered the room, took a look around, and with the words \"Fuck this, shall we go home?\" we left minutes later. I don't need to remind you that we drove there for nine hours with nine more ahead of us.\n\nThe hundred business cards has now changed into a token of shame and we sat into the still worm seats of our car. On the way back, I kept thinking about one thing: \"Is this behavior of a person that wants to change the World?\"\n\nIt was a 20 hour drive for a two minute lesson. And we didn't even know what is waiting for us in Prague next week.\n\nLaunching an American company and a bank account from Czechia\n\nAugust 2011, month eight\n\n\"We want to fly over to the States and set up an Inc. so that we can open a bank account,\" Premek explains to the investors. But the idea of a trip for five thousand dollars doesn't work for them.\n\nI realized that from the $500,000, we only control the five zeros. \"Can you send me a chart with all of the expenses?\" And I'm trying to take back the control over the number five. \"I'll tell Marta to set it up,\" says one of the investors.\n\nI begin to suspect that the agile approach is more of an anarchy. But what about the bank account?\n\nCrowdfunding startup without a history from the Eastern Europe is the same thing for banks as sex for the Pope. Every single one refuses us. Even PayPal responses once every two weeks. This is horror.\n\nWho would have thought that setting up an account and company would be such a problem, even though we have the money. Yeah, no... Your skills won't progress with larger amount of money. And what is worse, the 90 days deadline for the development is coming to an end. Now is the time of launching our service.\n\nThe chicken or the egg\n\nSeptember 2011, ninth month\n\nBut we have nothing to launch.\n\nThe biggest problem? We can't manage to get projects. They don't want to come to us, because we don't have any fans that would finance their ideas. And the fans? They don't take interest in us, because we don't have projects they could look at.\n\nHow to fix this?\n\n\"We're gonna make an awesome pre-registration website!\", says my elegant solution. Something like fixing a glass with a hammer.\n\nAfter a week of a trash full of torn ideas and a pint of tiers, my enthusiasm turns into despair. Until one day, we change our office for a café and Mara gets an idea.\n\nIt was a great idea. But as it usually is, the execution is more important.\n\nA month later, we launch our pre-registration and hope for dozens of projects that will come to us.\n\nThe only thing that came was one big fat ugly Zero. No project.\n\nAt ten o'clock, I finally understand how much I failed with my solution. Mara brings a bottle of vine to calm us all down. And I realize that we have not only no project, but on top of that no corkscrew.\n\n\"I have had enough of this shit!\", I shout to calm down because of the vine that was supposed to calm me down in the first place. \"How the fuck am I supposed to open a bottle of vine without a corkscrew?\" I ask a kitchen unit in hopes that one of the drawers will give me the answer.\n\nAnd it did, surprisingly.\n\nWork with what you have, not with what you want to have\n\nOctober 2011, month ten\n\nIt wasn't exactly a kitchen unit, more like Premek from the next room. I'm searching through the apartment when I discover what treasures have here.\n\nI confusedly run around an open cupboard when I notice a hanger.\n\n\"That metal hook must hold in the wood some way.\" I say to myself. I'm starting to twist it and... look at that. A screw! Just like McGywer, I pick up the bottle and the hook from the hanger, I screw it into the cork, I pull and... The cork is still in the bottle and the hook is on the other side of the room.\n\nWith the face of a berserker that is ready to destroy everything in his path, I think of one last thing. Turn the hook in 45 degrees so that it wouldn't tear out.\n\nThe cork is out! And suddenly I understood it.\n\nCouldn't we get the projects the same way?\n\nNovember 2011, month eleven\n\nThe next week, I patiently look for and write to a hundred of designers that I chose on Behance. I modify each template for each email. And it works! 40 new mails wait for me the next day. And three of them ask for adding their project!\n\nBut one of the responses startled me. It's from Oscar, the boss of galleries on Behance. He must have been one of the designers I wrote to. He likes what we do and he likes our identity. They tweet about us and offer cooperation.\n\n\"The light at the end of the tunnel!\" I wake up Premek at three in the morning and add: \"It's a shame that we're not in NYC. I could meet him right away.\"\n\n\"Maybe I have a solution,\" says Premek the next morning and sends an application to the Techstars incubator.\n\nBut we don't have a chance without a recommendation.\n\n\"I think that Robin was in Techstars,\" I say uncertainly and write an email to him. On Friday, two days before the end of application acceptance perion, he replies: \"Yeah, sure. I can recommend you.\"\n\nNow we have two days to make two videos that must be better than hundreds of others. I have never shot or edited anything, and I don't even own a camera. We can't shoot this in Prague, not to mention editing it. In Brno, we don't have the room. And on top of all that, it's weekend and everyone is gone. So how the hell are we supposed to get this done?\n\nThe light at the end of the tunnel starts to resemble the light of train that's going to hit us.\n\nFrom 1,480 applications from all around the World, David Tisch noticed us... somehow\n\nJanuary 2013, month thirteen\n\nOn Saturday afternoon, we are already shooting with a borrowed camera. We don't have to wait long for the first problem. \"Looks like I shot the past two hours in one take. Sorry, Let's try it again,\" I confess. It starts to be clear that this video won't be of an astounding quality. We drop out dead tired at three in the morning.\n\n\"Can we use anything out of this?\" asks Premek when leaving.\n\n\"I hope so,\" I reply and fall asleep on the way to the shower.\n\nI get up four hours later with one question on my mind. \"How the fuck do you edit a video?\" I remember this as one 16 hours long panic attack that ended on Monday at one in the morning. \"How should I export this in higher resolution? Shit, this should be enough,\" I add and this time fall asleep on my keyboard.\n\nIn another six hours, with a huge sleep deficit, we head off to Prague to get ready for a private beta version. It still works somewhat on 50%. Only in the evening, when we finish up filling in an application, we realize that the access is only through IP. It's 12 minutes to midnight, the programmers can't change it and Premek doesn't have the resources. \"Hope it won't be such a problem. If they are interested, they can let us know that they want to see more.\" Then we send the application.\n\n\"Dude, we really did it!\" I shout in disbelief and relief after such a crazy weekend.\n\nThree months later, an interview with David Tisch (the founder of TechStars) is published, when this part caught our eyes.\n\n\"No way. He didn't confused as with Chechnya!\" A really massive success we celebrated bz opening a bottle of cyanide.\n\nMeanwhile an email from the investors lands into my inbox. Well look at that. It's the cost table we asked for half a year ago.\n\n\"This cost $150,000?\" My heart stops.\n\n\"That's the standard price. And it's without the additional margin,\" argue the investors.\n\nI don't understand why I didn't paid attention to this sooner. We have to change something. This doesn't work.\n\nWe've got dozens of creative people with ideas, but we don't have a single finished project. The biggest obstacle is the preparation that takes authors four weeks. Because they have to:\n\nFind out the cost of the idea realization.\n\nCalculate the price of rewards so that they could raise the money for their production and realization of the idea.\n\nAnd they must ensure the production with the rewards delivery.\n\nWe aren't able to find people that already have all this. However we have lots of people that want to find out the real interest in their idea for minimum effort.\n\n\"Let's do Starthead 2.0,\" suggests Premek and continues: \"a creative shares his idea. We deliver the fans. For example, If there are 20 of them that will hit the like button, it will unlock the author the possibility to fill out more information. And that would progress to the financing itself. At the end, he will have enough fans to collect enough money,\" he concludes his solution.\n\n\"We will increase the product success rate, we let fans to moderate the whole thing, and we will create something that doesn't exists. This is elegant,\" I add.\n\n\"But we have to start over. We will programme it ourselves with our own team in our own offices,\" finishes Premek the thing we both now know is a Pivot.\n\nWhat do the investors say?\n\nApril 2012, month sixteen\n\n\"Out of the question! Think of something else.\"\n\nSo again, more clearly and on board with the agile markers. Perhaps we wrongly described the beauty of our solution.\n\n\"No, we won't be doing this. Go with what we have now. It would be a waste of money,\" the investors dictate.\n\n\"You don't seriously want us to just copy Kickstarter?\" Premek asks uncomprehendingly.\n\n\"That's what we gave you the money for,\" answers one of the investors with a totally serious face.\n\n\"We aren't doing this to copy something. We want to succeed,\" I explain.\n\n\"We have no reason to back this up. You are the ones coming up with nonsense,\" the investors close the debate and one of them leaves the room.\n\nI lean over to Premek and ask:\n\nIs all of this still worth it?\n\nMay 2012, month seventeen\n\n\"It's not,\" he replies.\n\nSo we end the collaboration. The investor keeps the application and we leave with the name, identity, and $14,000 in debt.\n\nWe start over working on Starthead 2.0, the way we described it to the investors, this time from Brno as a lean startup, but with no money. We run the alfa application just five weeks in.\n\n\"Nothing that Evernote can't do,\" says every other comment. And I'm starting to realize that we aren't dealing with the real problem.\n\nIt took us three years until we got to the successful phase as we described it to the investors. I'm going to Premek and suggest a drastic solution. \"We end Starthead and take a two week break from all this. We need it.\" Premek just nods.\n\nOur eighth round has definitely finished. We even have a tombstone. A $150,000 post-it. And we didn't even use it, we left it to my brother's startup.\n\nOur break didn't even last for four days when Premek wrote to me a sentence that we both know very well. The one that triggered an avalanche of endorphins in ours idea-junkie brains again.\n\n\"I know what will be our next project!\"\n\nWe lock ourselves for a week in an apartment where we worked from dawn to dusk on a website with only one goal: to find out how interesting our idea would be for people by just a pre-registration. We launch it two weeks later and the number of collected emails is growing.\n\n\"Is this it?\" Full of hope, we watch the counter. Now we just have to develop it. Again.\n\nBut one has to ask. Wouldn't it be better to finally admit to ourselves that we simply don't have what it takes? That we should find a stable job and spare ourselves further failure? A few collected emails don't mean anything. Shouldn't we just reconcile that a dream will stay a dream instead of just embarrassing ourselves for the ninth time?\n\nAnd then I finally got it. That the idea of giving up is worse than it killing me.\n\nSo I get up, shake it off, and breathe deeply. We enter the ring for the ninth time.\n\nAddition: 13th February 2014, after seventeen months I decided to step back and leave WeLoveMail. Because I want to make three more steps ahead. My opinions have started to dramatically differentiate from the ones of the rest of the team. So it was time to do the best thing you can do in this situation for the benefit of the company – leave it to those who give their heart into it. The project continues under the leadership of Premek and Honza, who are absolutely devoted to the idea. My devotion now belongs to other projects and I'm looking forward to telling you about them. I'm reaching for the stars, figuratively and literally. This time organically and through small victories. Otherwise, nothing will change. The idea of me giving up still scares me more than the idea of it killing me. Thank you for your support, that you gave me a large amount of. I deeply appreciate it!\n\nWow! On January 9th, 2015 the article read 11 000 unique readers (+ 3 000 next week) and everything started single post on Hacker News and then Jeff Atwood. I'm astonished! Huge thank you to all of you. And to Vasek and Marketa for a quick translation from czech language."}