{"title":"My Startup Failed. Fuck.","favicon":"http://31.media.tumblr.com/avatar_37147afc5a01_128.png","description":"My Startup Failed. Fuck. I finally said it, my startup failed. Fuck. I felt like I was coming out of the closet when I first stated it aloud to my co-founder. We both knew for months it was not...","lang":"en","tags":[],"image":"http://assets.tumblr.com/images/og/text_200.png","videos":[],"text":"I finally said it, my startup failed. Fuck. I felt like I was coming out of the closet when I first stated it aloud to my co-founder. We both knew for months it was not working out, but we never explicitly defined our situation as a failed one. Now that the elephant in the room has a name, we’ll call him “Dumbo” which stands for “Didn’t Understand Markets Brain Outline”.  That right there was our main problem. Our market demographic was musicians, and although a few of us had worked around the industry, we concluded recently we were not music SALES domain experts.\n\nThe product was a flash sale platform for musicians to release their music using dynamic pricing (zillionears.com).  To us, this software was a no brainer for musicians to use. The artists get to engage their fans while enticing their community to share with friends. So we talked to a few artists who said they thought it was a cool idea. BOOM! Our idea had been validated! After that moment we basically stopped talking to artists for a year and built (and rebuilt) the software until we thought it was acceptable.\n\nOur first beta test was a disaster when Amazon (who was our payment processor) suspended our account for not complying with money transfer issues. Fans were able to participate in the sale, but we were unable to capture their billing. We ended up paying the artist out of our own pocket and giving everyone his music for free (and we never told him that happened until now).\n\nFrom that beta test we found out that our software needed to be rewritten to comply with Amazons terms. More importantly though, people really didn’t really LIKE anything about our product. No one that used the service thought it was that cool. In fact, some people that participated in the sale didn’t even like our “dynamic pricing” system. They were trying to support the artist, so saving a few dollars didn’t excite them. They could easily have just gotten his music for free elsewhere.\n\nWe should have packed it up early right then, but we felt like we had already gone too far to quit. We rebuilt (and re-designed) the majority of the software, got approved by Amazon, and reached out to over 1,700 artists (each individually through different platforms). We got between 1 and 10 artists interested. Again, this just screams “PUT IT OUT OF ITS MISERY!” But we kept going. Finally the day came for our second beta (which was totally gonna kick ass for sure). The artist we had on board set up his sale page and was ready to go. Only problem is he totally misunderstood what our software was all about. Once he found out about the dynamic pricing he tells us “I think I am just going to release with another platform.” FUCK! Are you serious????\n\nAfter that we spent another month slowly letting it linger in our day to day lives. We went for one last ditch effort to make a press release, but couldn’t get a single artist (out of the 1,700+ we talked to) to run a sale. My co-founder called me to tell me this news. I asked him “Would you like to use my gun?” I was referring to the scene in The Social Network where Zuckerberg’s lawyer asks Saverin “Would you like to use my pen?” to manipulatively sign his shares over. I, of course, was referring to shooting this fucking company in the head and moving on with our lives! He agreed. We took Zillionears out back, and shot it in the head. It felt good.\n\nAlthough our company did not succeed the way we would have hoped for, we all learned more in the past year than we had in college. Our insights and experiences have been invaluable. For each of my future posts I will go into detail about the things I learned while on this journey, and how to apply the knowledge to future startups so you can avoid ending up in a room with “Dumbo”!\n\nHit me up on twitter! I just got on there. I love to talk to folks about startup experiences! @nemrow"}