{"title":"Totsy burns through $34 million, lays off its 83 employees, selling assets","favicon":"http://0.gravatar.com/blavatar/2cfdce2f9487bb9105a1ac197d4e831f?s=16","description":"New York-based flash sales site Totsy is laying off its staff of 83 employees. The company, which had 110 employees last year and 4 million email subscribers, has entered liquidation, hiring the investment bank Consensus Advisors to sell off its assets, which includes the member list and $2 million ...","keywords":"tech, daily deals, ecommerce, erin griffith, flash sales, layoffs, new york, pandodaily, totsy","lang":"en","canonicalLink":"http://pando.com/2013/05/22/totsy-burns-through-34-million-lays-off-its-83-employees-selling-assets/","tags":[],"image":"https://pandodaily.files.wordpress.com/2013/05/original.jpg","videos":[],"text":"New York-based flash sales site Totsy is laying off its staff of 83 employees. The company, which had 110 employees last year and 4 million email subscribers, has entered liquidation, hiring the investment bank Consensus Advisors to sell off its assets, which includes the member list and $2 million worth of inventory.\n\nAccording to sale documents obtained by PandoDaily, the company hit $16.9 million in revenue last year and never turned a profit on its flash sales. It lost $22.9 million in 2012 and projects a loss of $16.8 million this year. Totsy converted 10.8 percent of its email subscribers to customers over the last 24 months, a figure which was smaller in 2012. (For context, that’s not great. Ecomom, a comparable business which also shut down, had a conversion rate of 28 percent, according to liquidation documents.)\n\nAnecdotally, Totsy didn’t seem to have glowing reviews from mom bloggers either. News of the layoffs was first sleuthed out via regulatory filing by Crain’s New York.\n\nTotsy, founded in 2009, replaced founding CEO Guillaume Gauthereau in April. But as it was seeking to raise more capital, investors Rho Capital Partners and DFG Gotham Ventures proved unwilling to throw good money after bad — Totsy had raised $34 million across three rounds of funding. Sale documents reveal that investors injected an unannounced $11 million into the company in November 2012, just three months after Totsy’s $17.6 million Series B.\n\nTotsy built its membership list by purchasing names and email addresses through two acquisitions. In 2010, the company acquired 82,000 names from bTrendie, a site it wound down. In January 2013, the company acquired 2.4 million names from Mamapedia for $895,000. Given the news of the layoffs, the email list will likely be all that survives the company.\n\nEcommerce is a resource-intensive business which involves lots of risk in taking on inventory. Beyond that, flash sales sites as a category have lost their luster. For example, Gilt Groupe went through a rocky period of layoffs and restructuring, although my understanding is that the company has righted the ship and should file for its long-anticipated IPO any day now. Lot18 has gone through several rounds of layoffs, eventually pivoting from one fad commerce business model (flash sales) to another (subscriptions). Rue La La laid off 65 employees when its parent company GSI merged with eBay; the company recently replaced its CEO. Smaller players have quietly shut their doors and sold their customer lists to the dominant market players.\n\nDespite the shakeout, a few winners have somehow managed to survive the backlash and thrive. OneKingsLane, Zulily, and Fab are often held up as shining examples of flash sales done right, perhaps because they’ve diversified away from the category. The artificial deadline of a limited, one-time-only sale seems to work for some, but when it doesn’t, it’s a disaster.\n\nTotsy’s site, which is still operating, is a membership-only flash sale site targeted at moms with an eco-friendly bent. It was a direct competitor of Seattle’s Zulily, which appears to be thriving. Zulily has raised $135 million in VC funds; the latest was at an eye-popping $1 billion valuation on $500 million in annual revenue.\n\nTotsy and Consensus did not respond to messages."}