{"title":"STARTUP FAILURE","favicon":"http://33.media.tumblr.com/avatar_bcae3ad0014e_128.png","description":"STARTUP FAILURE: how it feels Blogging to a following of what is probably no more a few friends, colleagues and business acquaintances is in essence either self-promotion or - in this case - a public...","lang":"en","tags":[],"image":"http://assets.tumblr.com/images/og/text_200.png","videos":[],"text":"Blogging to a following of what is probably no more a few friends, colleagues and business acquaintances is in essence either self-promotion or - in this case - a public therapy session. I’m hoping, however, that an entrepreneur or two might find this post and see that the grief and suffering they’re feeling does not make them the only sobbing loser in the world.\n\nMy startup, Admazely, has gone bankrupt. It has failed. It’s over. Done. We ran out of funding and didn’t manage to raise more money.\n\nI’m not writing this to get pity from anyone. Or to get even with anyone. Or to out anyone. Except for myself. Let me be very very clear: the failure that I’m writing about here is mine and mine alone. Were other people involved? Absolutely. Did their actions influence the outcome of Admazely? Sure. Was it their responsibility? Hell no! In the epic words of former Secretary of Defence, Søren Gade, the buck stops here.\n\nI’ll try and find the energy to do a more analytical post mortem with root-cause analysis and everything at a later stage. But right now, I want to share how my failure felt. And feels.\n\nAdmazely began informally in early 2011. Officailly, I began working on it in May (on a spare-time and hobby basis it was a few months earlier but my definition of when you start working on a startup is when you start doing it full time).\n\nMy eventual cofounders, David and Sylwia, joined in August. Fourth and final cofounder, Søren, made his commitment in March 2012.\n\nAnd we formally filed for bankruptcy in May 2013.\n\nThis is the story of how that ride felt. What it feels like to fail.\n\nFirst signs\n\nHaving a startup is an emotional roller coaster from the outset. Constant worry about finding cofounders, potential competitors, raising money, designing a product, building it, marketing it, finding a sustainable business model.\n\nTo me, the basic feelings associated with it are very similar to what I’ve experienced in previous jobs. I’m an “all in” kind of person, so I’ve felt a lot of responsibility towards my employers and my career in the past. But let me assure you that it pales in comparison to having my own startup. It’s the same basic emotions but they get amplified by a factor of thousand.\n\nI have interviewed hundreds of candidates for positions before founding Admazely. And sure, it’s been really frustrating when I couldn’t find the right person for the job. Or I’d be excited when I finally did. But interviewing people that I desperately wanted to be a good fit for Admazely, only to find out they weren’t good enough was misery. Finally finding someone, asking them to join and be rejected gave reason to fundamental self-doubt. Am I not the mythological founder that rock star people are eager to join and work for free for a fraction of the company?\n\nBut it’s also insane joy. When those amazing candidates agreed to join despite more lucrative offers from companies I admire and respect, I was exhilarated to the point of shouting and performing those celebratory scenes you only do when you’re pretty sure no one is watching.\n\nWhere am I going without this? Well, in the general direction that you get a little bit numb to pain. You teach yourself to shake it off as quickly as possible and move on. When a lot of shit happened in a short period of time, I’d go into a state of mild stress and depression. But I’d have to force myself out of it. That led to this slight numbness which in turn led to a certain degree of insensitivity to signals from the outside. Because I was forcing myself to ignore them in order to not go under in pain, stress and anxiety.\n\nAnd that slight numbness meant that I probably wasn’t seeing any first signs of failure.\n\nI obviously knew that we were fighting a multi-front war. We had a cash-out-date approaching from day one (end of April 2013). We had product problems. We had sales and marketing problems. We had people problems. We had process problems. Startups have problems. It’s a grind - that’s the nature of it.\n\nSo retrospectively I don’t think that I was seeing any obstacles that I couldn’t overcome.\n\nEmotinal distraction\n\nIn February 2012 my wife, Kia, and I learned that she was expecting our first child. She was due in early October. Preparing for a baby takes up some emotional bandwidth. As it should. I’m pretty sure Kia thinks that it didn’t take up as much as it should have. Even writing the section headline “emotional distraction” makes me feel a little guilty. Was my son a distraction to my startup? I told myself I could just add bandwidth but that turned out to be false. So preparing for a baby diverted my focus a little. But actually it was just a little.\n\nKia gave birth on September 27 and that’s when the actual diversion of attention happened. For the last three months of 2012 I was doing a shitty job of being founder and CEO of Admazely. And an even shittier job of being a father and a husband. The latter is not the point of this post so I’ll leave it out. It’s probably the one I’ll feel more guilty about in the long run. The former, however, made me pretty aware that I started being one step behind on many things. I felt it and my colleagues felt it. It felt like failing at the micro level. It was a tough time.\n\nDuring the Christmas holidays I decided to get one step ahead again and I kicked off 2013 with an all-hands meeting setting a stronger direction and honing up to my mistakes in the previous three months. The team responded really well. They all knew it and could feel that we’d been getting lost due to my lack of leadership. And the next 45 days were some of the most amazing in the two years that I was doing Admazely.\n\nThe big blow\n\nAs mentioned, our cash-out-date was approaching. We’d joined the Accelerace program based on a recommendation from our chairman and representative of our lead investor, SEED Capital. The program does a lot of good things. The reason we joined was that it has a loan option for program alumni companies. The people in the program has to recommend you, you jump through a few hoops, you pitch and negotiate and finally you present to their equivalent of the infamous partner meeting - the Investment Committee.\n\nWe had done all of it and everything was teed up for the Investment Committee presentation. The program manager, Jesper, endorsed us vigorously, the program consultant, Christian, who had worked with us was an enthusiastic ambassador. We had spoken bilaterally to most of the people on the committee and had received confirmation that they would support our loan application. SEED Capital had agreed to syndicate the loan, further endorsing it. Our chairman was on the Investment Committee (yeah that definitely could be seen as a conflict of interest but that wasn’t my headache) and had spoken to most of the members.\n\nI had all of my ducks in a row so to speak. Or so I thought.\n\nI went to present on Tuesday February 6 with confidence and less than two months of cash in the bank. It was snowing yet thawing. A disgusting day, typical Danish winter.\n\nMy presentation was ok. The mandatory Q&A afterwards was horrible. The only two people in the room that we hadn’t gotten prior support from were skeptical to say the least. As I left the room I was shattered. And as my contact at Accelerace didn’t call me later on that day I knew where it was going. My chairman didn’t either. Not a good sign. I left messages and they didn’t return my calls.\n\nIn the afternoon I had a speaking engagement in the other end of the country, pitching to a huge room full of potential customers. It was an absurd experience. I was crumbling on the inside but had to pose confidently. I had invited to of our customers to also speak at the event and after dropping them off I sat in the rental car staring at air. Crying. Feelings of fear, anger, self-righteousness and uncertainty overwhelmed me.\n\nA million thoughts were racing through my mind. Guilt towards Kia for asking her to let me jeopardize our personal finances and then failing to pay back on her trust. Self-doubt. But it all just got worse from there on.\n\nWhen Christian called Wednesday afternoon I knew the outline of the conversation before picking up the phone. I was oddly emotionally detached as we talked. Still kind of shell-shocked.\n\nThe worst part at this stage was telling my team the news. I had been 100% transparent about our cash situation and our process with Accelerace so they were expecting good news. I waited until Monday at the weekly all-hands. I should have spoken to them faster. Most of them knew me well enough to know what was up based on my mood and body language in the days leading up.\n\nI told them that I would hustle to find other investors but that realistically it took more than the month-and-a-half of cash that we had left. Two and a half if we were all prepared to work up until a payday that we all knew would lead to bankruptcy, not pay. We all were, of course.\n\nPiling on\n\nDecember through March we were killing it in our sales team. After a lot of iteration we had finally gotten a small team in place that were converting leads into customers. The two core people on that team were Harriet and Nate, both Kiwis. A core element in my Hail Mary fundraising strategy was that we were finally getting sales traction and that we had found a model to build an international customer base through tele sales. Most Danish startups begin selling locally and then expand from there. We had chosen a pretty bold strategy (against the advice from our board) and gone for ‘instantly global’, meaning the bulk of our effort was in calling the UK. And for that you need native English speaking sales people. Hence my praise of Harriet and Nate (and Sophia, our Aussie sales supporter). We spend three months achieving what a successful startup like Trustpilot reportedly spent almost a year doing: making steady sales progress in the UK.\n\nMid-February - roughly two weeks after having our funding plan dissolve before my eyes - Harriet and Nate received news that they would not be granted permanent work visa in Denmark and were to leave the country within 30 days.\n\nIt felt like the most unfair thing that could possibly happen at that point in time. I had less than two months to raise about 3 mdkk with a pitch that now had zero chance of delivering if an investor should decide to invest. I remember closing my eyes when I got the news, laughing manically for like 10 seconds while just feeling dizzy. Harriet, Nate, Sophia and our “growth hacker”, Daniel, had been busting their asses off for the last few months trying to crack the code to making it all work. And right there and then someone in SKAT decided that what Harriet and Nate were doing did “not qualify as the kind of work that a Danish citizen could not perform equally well”.\n\nWhat. The Fuck?!? I just couldn’t believe it. The eloquence, snappy responses, mastering of nuances within the language that makes a really talented sales rep is based on intimate knowledge of said language. Their skill set were not some that a Danish sales guy could pick up from learning English in school or even living abroad for a short while. I was flabbergasted. And I wanted to scream. But even at that point I felt the need to keep a straight face to the rest of the team. I’m pretty sure I didn’t manage. If only half the despair I was feeling shone through, I’m pretty sure my colleagues felt like packing up their shit and leave right there and then.\n\nThey didn’t. Maybe they should have.\n\nAs I thought things couldn’t get any worse, our CTO and cofounder, David, pulled me aside one day and told me that he and his fiance were moving back to Stockholm. It had been a long time coming. His fiance couldn’t get settled in Malmö and wanted to go back. David had been postponing the decision but had finally chosen not to jeopardize his relationship. A good decision and one in which I support him 100% as a friend. As a cofounder - I found his timing to be the worst possible.\n\nAnyone who have seen a cofounder leave their startup knows the feelings flying through my head at that point. Betrayal, sorrow, shock. Loneliness. Until that very moment it had felt as if David was the one person that would stay with me until the very end. But that wasn’t the case now. The weight on my shoulders already felt heavy but it just got a lot heavier. And I knew that even if we did manage to raise more money, we couldn’t realistically continue our upwards trajectory. Development speed would decrease dramatically and the driving force in getting shit done would be gone. No sales team and no CTO.\n\nI still struggled to keep a straight face to the rest of the team, to my board, to customers and suppliers and to potential investors. And it seems I half-managed. But only half-managed. I didn’t crumble completely on the surface but underneath it was the most taxing time of my life.\n\nI probably went and pitched somewhere between 10 and 20 potential angel investors after this point. And my pitch got weaker and weaker. Because I had lost faith myself. I remember one meeting in particular that our chairman, Niels Vejrup from SEED Capital had helped tee up. It was with Jesper Buch and Ditlev Bredahl who had been dancing in the shadows for a while and were now ready to talk. It was a Skype call and I had tried to prep for the meeting. Tried to find ways to frame our situation that would appeal to their hands-on approach to angel investing. Especially Jesper is known for investing heavily in the team and the founder(s). Which would -under normal circumstances - be great news. I’ve pretty consistently gotten good feedback from both VCs and angels. But this time I sucked in a major way. As I was pitching I knew I sucked. I felt like a dog that has been beaten to the point of scared submission. And I acted the role of a loser. Because I utterly felt like one. That meeting was an image of how I felt at the time and how my performance suffered from it.\n\nAnyway - the list of potential investors got shorter and shorter as I got the 'thanks but no thanks’ emails and calls.\n\nBankruptcy\n\nWe had a board meeting on May 14th 2013 where we formally decided to file for bankruptcy. I filed the paperwork, helped the lawyer, etc.\n\nThe morning after filing the papers, we all cleared out the office. Not much was said except for the occasional half-hearted joke trying to lighten the mood. We agreed to meet for a piss-up a couple of weeks later when the smoke had cleared.\n\nIt was two weeks of extremely ambivalent emotions.\n\nOn one hand I was crushed. Watching two years of my life go down the drain cannot be described to someone who hasn’t felt it.\n\nBut on the other hand I felt tremendous relief. Finally, it was over. Having known where it was heading and trying to stop us falling off a cliff was unbelievably tough. Fighting with all I had knowing that our faith was in the hands of someone else and that we needed something in the proximity of a miracle. Albert Camus writes in his self-proclaimed main work, The Myth of Sisyphus, that Sisyphus is only set free as he accepts and embraces the absurdity of his destiny. I tried to do that but didn’t manage.\n\nWhen I had filed the papers and we were officially bankrupt and I wasn’t allowed to touch anything I felt relief. Relief that my struggle was over. Relief that finally I didn’t have to get up in the morning, put on a brave face and lie to everyone around me.\n\nAnd I felt shame. Immense shame BECAUSE I felt relieved. I was supposed to only be devastated. I was supposed to not have given up. The common narrative of startup founders is the one in which the founder overcomes. Where he endangers the financial health of himself and his family. Where his 20 credit cards are maxed out when he finally gets funded. I felt ashamed that I had given up too soon. That I had kept my promise to my wife and not gone beyond the financial limit that we had originally agreed. Ashamed that I had only spent half our life savings on my failure and not all of it. Logically it’s nonsense but the narrative that’s been created around startup life - one that I have bought into as well - is one of relentless pursuit.\n\nSure, we had endured some hardship. Our first office space had leaky windows and no heating. Our desks were old garden furniture that I had borrowed from a friend of mine. We didn’t pay any rent, instead I would clean the kitchen of the shared office space that we were in. To cut personal living cost for us all, we ate lunch leftovers from one of the more established companies in the building and in return I did the dishes for the entire building. David rented a scrappy room in Malmö and occasionally took a weekend trip to Malmö to see his girlfriend. It wasn’t that we were too posh to endure hardship.\n\nBut it still felt as if we should have done more. And shame still consumes a lot of my emotional bandwidth when I think back on Admazely.\n\nAftermath\n\nI guess shame was also a major driver of my behavior in the past few months. I was afraid to admit my failure to the world. Afraid to tell people that we had gone bust. Publicly admitting it was like crossing into a whole new dimension. I had a lot of psychological equity invested in my identity as a startup founder. Now, I was just a bum without a job.\n\nMy friends would tell me to give it time and think about what I wanted to do. Don’t rush it, they said. Well, there were more perspectives to it than that.\n\nFirst off, there was nothing else I wanted to do. Maybe another startup at some point. But right there and then the idea of taking a job was inconceivable. I waded through job sites and talked to people and I simply could not get excited about anything.\n\nSecondly, there was the responsibility to my family. I hadn’t gotten a salary for a couple of months and my wife was on maternity leave - which despite Danish welfare left us with a gross monthly household income of around 14,000 Danish kroner. In other words, we were once again digging into our savings to pay the bills. So I needed to get off my ass and generate some kind of cash flow.\n\nRight around that time Martin Bochineck who was an angel investor and sat on the board of Admazely called me. He had had a front row seat when I lost a chunk of his money. Martin is one of the most decent and gracious people I have ever come across in my business life. I have witnessed it first hand and I have numerous accounts from others who have had similar experiences. Martin has a moral integrity that is extremely rare. I owe a lot to him as he helped me cope both during and after my failure.\n\nHe offered to pay me a salary equivalent to my CEO salary in Admazely (which admittedly was pretty negligible) to come in and “help him out with stuff for a few months” while the dust settled. I had my doubts since I simply didn’t feel as if I had anything to offer at that point in time. But I eventually accepted. And that’s how I’ve ended up at Magnetix. It’s a great place with very talented people. My role here has become more permanent. I do what I did five or six years ago, handling client accounts and overseeing projects. It’s familiar ground and something I know I do well. It’s something I can do without investing my soul in it and still excel.\n\nWill I be doing this the next five or ten years? Probably not. But for the time being, it’s nice being around smart people doing great work. It’s a privilege to be part of a very successful company. To be able to contribute at a pace that suits where I’m at emotionally.\n\nFailure sucks monumentally. For a founder failing it needs to be ok to talk about how much it sucks. Both the small failures along the way and the huge ones that are definitive. Failure hurts emotionally. If it doesn’t, you’re either not really invested or simply a shallow person lacking the ability to reflect on what you’re doing. My failure has cost people money, it has put people’s personal relationships at risk, it has put people’s financial situations at risk and it has cost a lot of my personal credibility. I don’t celebrate failure, i hate failure.\n\nI’m still recovering from my failure. Some nights, suffering from occasional insomnia, I still sit alone in the living room thinking about what I could and should have done. My failure still haunts me and I suspect it will for a long time.\n\nIf you’re a founder and you find yourself in a similar situation, feel free to get in touch. Drop me an email, ping me on Twitter or give me a call. I’ll be happy to spend an hour talking about how I cope (sometimes denial is an underrated survival strategy) and see if anything I’ve done might help you."}