{"title":"Couldery Shouldery","favicon":"http://33.media.tumblr.com/avatar_2c2bb88522ce_128.png","description":"Couldery Shouldery From the Truman Presidential Library by Marshall Astor We’re commencing an “orderly shutdown” of Lookery. We made the decision as late as possible without forgoing our...","keywords":"@rafer #involvements","lang":"en","tags":[],"image":"http://farm2.static.flickr.com/1184/704662937_b5b019b63a_m.jpg","videos":[],"text":"From the Truman Presidential Library by Marshall Astor\n\nWe’re commencing an “orderly shutdown” of Lookery. We made the decision as late as possible without forgoing our responsibilities to the various stakeholders, including and especially orderly disengagement from our customers. We’re honored by their attention and support and regret that we couldn’t have served them even better and for much, much longer.\n\nI left Wouldery out of the post title as it’s not relevant. The only information of value is what other choices were readily available to us and which ones I look back on with uncertainty. This is probably not my last public postmortem on the lessons learned, but I owe everyone near-immediate disclosure on the things I can put my finger on now. I’m trying to keep a stiff upper lip during this process. Please avert your eyes if I falter.\n\nAs co-founder and CEO of Lookery, the buck stops with me and no one else. I hope to have the opportunity to work again with each and every one of the dozen people who worked at Lookery since it was founded in July 2007. I hope I did as well by them as they did by Lookery and by me. Please take this post as a recommendation of each and all of them and never hesitate to get in touch with me for details. The huge majority of them went well beyond the call of duty to try and make the company succeed.\n\nSo did Allen Morgan, the outside Director that represented the Preferred investors. There’s no way we could have gotten this far or known how to behave well in the face of adversity without his guidance. He represented a great batch of angel investors on our Board and was one of the main reasons that they were so supportive of the company whenever I asked for anything. In May and June of this year, most of them agreed to participate in an inside round to keep us running through the next series of milestones. I cancelled the transaction a month ago, as I could not be as confident of reaching those milestones as ‘good faith’ requires.\n\nBefore delving into our market and product choices, I need to address our fundraising overall. On forming the company, David and I decided to pursue a low-cap model, postponing institutional investor involvement for the foreseeable future. It really sucks to be here right now, but I think it was the right call. Resigning politely at someone else’s behest, as I’ve done twice before, did not improve any of the stakeholders prospects in either case. Unless Lookery reached an expansion stage, where the sales model was known and repeatable, I’m ever-more convinced that raising institutional capital would not have increased our chances of creating value for the existing shareholders. The company would have survived longer, but that’s not the goal.\n\nGoing low-cap, David and I were careful to create a parsimonious and headcount-spare operation. Operating virtually was not a problem, nor was cutting corners on travel, schwag, and office rent. And, I’ll still only work on cloud-hosted businesses. Those parts of Lookery were appropriate, repeatable, and did not bring us to this point. We did invest too much in building market share in the original ad-network business in the first half of 2008, but that error was a symptom rather than the disease.\n\nMoving on to our specific coulda-shoulda product and market choices, there are three key moments at which a different and defensible decision might have made all the difference. In chronological order, the sins Lookery committed under my leadership were continuing our dependency on a large partner (March 2008), not knowing when to cut bait on a failing asset (September 2008), and building ahead of the market (December 2008). I and we made any number of other mistakes, but all the rest were correctable. Avoiding even one of the three big errors might have been enough to get us over the hump.\n\nI believe David and I started Lookery in July 2007 in the right way and for the right reasons. Based partially on my F8-launch work for LendingClub (a company I’m thrilled to know) David and I decided to quickly offer a no-frills banner network for Facebook app publishers. We went from commitment to live service in well under two weeks using AWS and OpenAds, pulled in Rex Dixon almost immediately to manage the publishers and Todd Sawicki soon thereafter as we needed a real ad pro. Both David and I had been keen observers of, and vendors to, the online ad business from the outside, and Todd was the online advertising insider that completed the early team. By March 1, 2008, we were getting pretty close to a billion impressions a week, had moved the ad ops to Atlas, started spec’ing Lookery’s targeting technology, and closed out a $1M convertible note financing that had been rolling in since October.\n\nSo far so good on using an ephemeral opportunity to create a company, but this is where I place Coulda-Shoulda #1. We exposed ourselves to a huge single point of failure called Facebook. I’ve ranted for years about how bad an idea it is for startups to be mobile-carrier dependent. In retrospect, there is no difference between Verizon Wireless and Facebook in this context. To succeed in that kind of environment requires any number of resources. One of them is clearly significant outside financing, which we’d explicitly chosen to do without. We could have and should have used the proceeds of the convertible note to get out from under Facebook’s thumb rather to invest further in the Facebook Platform.\n\nCoulda-Shoulda #2. Predictably and reasonably, Facebook acted in their own interest rather than ours. Their Summer 2008 redesign supported Facebook’s goals elegantly but hurt our publishers and us in ways that became clear just weeks after we’d raised another ~$2M. At this point, we made a mistake endemic to startup people. We followed our natural inclination as problem solvers rather than getting out while the getting was good. If we’d sold the ad network the minute we understood that we could no longer make it successful, we would have saved a couple hundred thousand dollars in working capital. Plus, the ad network would have fetched three to five times its low-six figure sale price less than 60 days later. That’s a million dollar mistake I made in a very short period of time. I should understand sunk costs better than this.\n\nTo give credit where it’s due, Todd closed the sale of the Lookery ad network to AdKnowledge in less than two weeks from the moment we decided it had to go. I was off promoting Lookery’s targeting system to European demographic data sources and social networks and was not even in the country during those two weeks.\n\nCoulda-Shoulda #3. Once we sold the ad network, I fell into a bad old habit – persuading my team to build something before the market was ready for it. Oren usually saves me from myself in this regard, but I didn’t pull him away from Mashery for the day or two necessary to diagnose the problem. Mashery is doing so well that I clearly could have. Lookery’s Profile SaaS/universal cookie mechanism is far more economic and effective than cookie exchange systems in a world where ad media and targeting data are separate commodities. That world is a year or more in the future.\n\nThis is the fourth blog post that I can find from a Lookery exec in which the primary theme is early = wrong. I felt pretty good when I wrote this one in December 2007 when Lookery was still doing all the right aka solely tactical things; the issue was weighing on me last month as I started to wonder if Lookery’s inside round was a bad idea; but it hurts the worst to read this post of Todd Sawicki’s from the day we met four months before Lookery was even founded.\n\nWithin the bounds of confidentiality agreements and showing respect for the many people who treated Lookery and me well over the past two years, I’m happy to respond to any questions that arise. My replies may sometimes take a day or two."}