{"title":"Post-mortem","favicon":"https://secure.gravatar.com/blavatar/ac06c7d5b4adad107e2f88e92e0ddbd9?s=16","description":"RiotVine is closing. I genuinely want to thank everyone that ever signed up, posted an event, or used RiotVine to discover what was happening around town. Unfortunately, we never generated the traction needed to continue. I'm a big believer in learning from your failures, so I wanted to share my thoughts on building consumer web…","lang":"en","canonicalLink":"https://riotvine.wordpress.com/2010/08/09/post-mortem/","tags":[],"image":"http://api.tweetmeme.com/imagebutton.gif?url=http://blog.riotvine.com","videos":[],"text":"« Marketing at SXSW, and how we rocked it\n\nRiotVine is closing. I genuinely want to thank everyone that ever signed up, posted an event, or used RiotVine to discover what was happening around town. Unfortunately, we never generated the traction needed to continue. I’m a big believer in learning from your failures, so I wanted to share my thoughts on building consumer web products. Think of this as a business plan for consumer web companies:\n\nAsk yourself how people are going to find out about your product\n\nWrite down an honest answer. If you answer word of mouth, social media, or press, you need to dig deeper. Press is a small bump in traffic that lasts about 3 hours. Social media is a full time job and that’s time you’re not spending building your product. If it’s word of mouth, what are they saying? “Check out this cool website I found”? Lame. This brings me to my next point..\n\nIt’s not about good ideas or bad ideas: it’s about ideas that make people talk.\n\nAnd this worked really well for foursquare thanks to the mayorship. If I tell someone I’m the mayor of a spot, I’m in an instant conversation: “What makes you the mayor?” “That’s lame, I’m there way more than you” “What do you get for being mayor?”. Compare that to talking about Gowalla: “I just swapped this sticker of a bike for a sticker of a six pack of beer! What? Yes, I am still a virgin”. See the difference? Make some aspect of your product easy and fun to talk about, and make it unique.\n\nFigure out the difference between a website, a service, a product, an application and a platform.\n\nYou need to figure out which one you’re building because what users do with each one and how you make money is very different. If you answer all of the above, you’ve got a problem because the answer determines why people use what you’re offering, and it says that your focus is scattershot. The difference between these is another post entirely, and one I’m probably not qualified to write yet.\n\nYour first public product had better have a viral loop.\n\nHaving a viral loop will stretch the traffic you get into more traffic, and ideally, more users. The only other option is to have a consistent and cheap social media strategy that drives traffic and this will easily suck up one person’s entire day, not ideal for a startup comprised of two people. If you don’t know what your viral loop is, STOP. Figure this out first. If there isn’t one, START OVER.\n\nThe best viral loops have two factors: they evoke an emotional response, and involve an element of surprise.\n\nThese factors make people share content online. Why do you think youtube is so massive? First you find a clip of two kids, and then “Charlie bit me!” happens and you’re laughing or going “Awww!” Video is the best medium to accomplish this. If you’re assuming people will share your content, think about how surprising or emotionally engaging that content is. If it’s neither, you’ll need to share it for them.\n\nThe best metric you should measure yourself against is whether you can make people feel something when using your product.\n\nAt the end of the consumer web rainbow, it’s not about the features, it’s not about the design, it’s not about the usability, it’s not even about the real world pain you solve. All of these things matter, but think about the largest sites in the world that you waste time on—\n\nFacebook: People love seeing faces; this is a simple biological response that facebook excels at. If you spent one second looking at every facebook profile pic, you’d be at it for 158 years.\n\nCraigslist: The design is completely underwhelming, which lowers your expectations.. but then you read something scary, weird or hilarious and you’re hooked. You keep reading hoping to find that next fix.\n\nEbay: If you’ve ever bought or sold anything on ebay, you know the thrill of hitting f5 until the auction ends. Even the aftermath where the person who bought from you is a nigerian scammer and paypal is a nightmare all involves an emotional response.\n\nfoursquare: Ever win a mayorship? Or had one stolen from you. Yeah.\n\nHow often are you just searching for something to do? Once a month? That’s not nearly enough to generate the traffic you’d need. Then there’s the competition: Eventful, Going, Upcoming, and Facebook. All have had millions poured into them. The lucky ones were acquired.\n\nI’d argue that they are all pretty bad, but I blame that on the content; events are terrible content. If you already know about an event, you don’t need an event site. If you don’t know about it, you’re probably searching for something to do and the majority of events will not interest you. Even SEO is an issue; events expire and are pretty worthless after that.\n\nTo be fair, I think it’s very possible to create a compelling product that addresses this. We mapped out our vision of it, but we would’ve spent another three months head down developing it, without a business model or any way to keep paying the rent.. and Facebook would just end up ripping it off.\n\nIt’s hard to learn these lessons without first hand experience though so keep building your consumer web projects! I’d do it all over again, and in fact I am. Building RiotVine helped color my current design philosophy, and we’re taking all these lessons learned with us to spotly. Stay tuned for more :)\n\nGot questions about how these principles apply to major websites, or why some websites, products or apps made it and others didn’t? Feel free to ask in the comments; I’d be happy to share my thoughts.\n\nThis entry was posted on August 9, 2010 at 1:24 pm and is filed under Uncategorized.\t\t\t\t\t\tYou can follow any responses to this entry through the RSS 2.0 feed.\n\nYou can leave a response, or trackback from your own site."}