{"title":"Lessons from my failed startup","description":"I stumbled into founding a company, and perhaps this is why my mistakes seem like “DUH” ones to others, but it’s also why I was willing to take risks more seasoned entrepreneurs or business people were too scared to take.","lang":"en","canonicalLink":"http://skillcrush.com/2012/11/14/lessons-from-my-failed-startup-parceld/","tags":[],"image":"http://skillcrush.com/wp-content/uploads/2012/11/interview-brianne.jpg","videos":[],"text":"Editor’s Note: You may remember that back in April we published an interview with entrepreneur Brianne Garcia. At the time, Garcia was a fellow at the Tow-Knight Center for Entrepreneurial Journalism and working full time on her startup Parceld. Since we last heard from her, Brianne has graduated, won some funding, worked on Parceld, started to raise money, overcome innumerable hurdles, and finally, decided to close Parceld down. In this blog post, Brianne shares with us her lessons learned.\n\nWhen we entrepreneurs decide to start a company, we know that more things can go “wrong” than can go “right.” We understand this, and yet we believe that we have what it takes to put “a ding in the universe”, as Steve Jobs once said. Startups are so “cool” right now that it’s easy to forget how terribly naive, blindly optimistic and delusional startup founders have to be to think their company will succeed over others, especially over others with similar ideas in the same market.\n\nI stumbled into founding a company, and perhaps this is why my mistakes seem like “DUH” ones to others, but it’s also why I was willing to take risks more seasoned entrepreneurs or business people were too scared to take.\n\nAt this time last year, I had never stepped foot in the tech community in New York. To say it was foreign territory would imply that I even knew it existed. Instead, I was fully engrossed in finishing my last semester of journalism graduate school, and was anxious about where I’d work upon graduation.\n\nI had always been interested in online communities, and had hoped that I might be able to merge that interest with my lifelong obsession with fashion. Even though I wasn’t part of the tech community in the way I am now, I had always been an early adopter of shopping and social sharing sites. I hopped on Polyvore, Svpply, Pinterest and Tumblr very early in each of their respective lives, and that’s where the idea for Parceld crept into mind.\n\nAs an avid user of these sites, I noticed gaps in the process of being inspired and being able to actually DO something with this inspiration (namely, buy).\n\nMy company, Parceld, would solve the problem discovery sites create: the desire to purchase a specific style or trend (since a bunch of images aren’t actionable or affordable). Parceld would let women tag photos to say “here’s what I like about this look. Show me something like this”, and we’d surface a pool of suggestions, sourced from some key major brands as well as emerging brands and retailers.\n\nWhen I graduated, I had a choice: go get a job at a media company, or try to make Parceld a business.\n\nI chose the latter, and am so glad I did. Even if, after 7 months of dedicating myself body, mind, and spirit to the effort, I have now shut Parceld down.\n\nTwo months ago, I stood at another crossroads: I had run out of funding, my technical co-founder had quit and pulled the code out from under me, I was out of savings and student loan payments were taunting me from around the corner.\n\nMy gracious network of friends and advisors gave me advice that ranged from “keep on keeping on” to “go find a job, NOW.” One person told me to try bartending while I figured out next step.\n\nI was pointed in the direction of this farewell-of-sorts blog post from Buyosphere founder Tara Hunt, who recently decided to take a position elsewhere, and discontinue a 100% focus/dedication to her own company. Her biggest lesson: “it DOES take money to build stuff. And time. And those who have a large supply of both have more runway to make several mistakes on the road to über success.”\n\nMost of us don’t have big wads of cash and time to burn, so we have one shot and then we have to figure out how to pay the rent and feed ourselves. Those who achieve success in that one shot are just as lucky as they are admirable. And those who don’t hit it big on the first try, but have the time and money to figure stuff out, are extremely privileged.\n\nThough it’s natural to make mistakes, it’s also worth reflecting on those mistakes in order to do better in the next go-around. I made mistakes, BIG ones, that directly contributed to Parceld failing.\n\nWith that in mind, here are my top 3 lessons learned:\n\n1. LEARN HOW TO CODE, and USE GITHUB\n\nObviously, this is stressed and discussed every which way we turn on the internet, and for good reason. But this is probably the #1 “complaint” I had while building Parceld: I felt helpless in some ways because I couldn’t actually code.\n\nIn retrospect, I see that you don’t have to become your own CTO, but knowing what’s going on under the hood can save you tears, money and time.  My team and I started using Dropbox before switching to Github, and it was too late for some of the code. If you’re a founder, you probably HATE feeling helpless, and when I went to visit the alpha product and it wasn’t there, I broke down. Feeling helpless sucks.\n\nThe second I get some dough in the bank, I’m taking some courses beyond my Codeacademy online sessions, which are fun, but not really very actionable.\n\nNo one likes someone who is too aggressive, but looking back, my idea of “too aggressive” could probably fit very nicely into the “persistent” bucket, which, quite frankly, is not enough when raising money. My father told me that, especially as a woman, to never be afraid to ask for what I want or to remind others of their commitments. People these days are busy, forgetful and over-scheduled; it’s quite possible my three emails each got buried, so a fourth or fifth email (not daily, though; maybe weekly) would have served me well. I’ll never know.\n\n3. ASK FOR HELP.\n\nSure, I asked for money from my family and help from a few friends, but there are plenty of strangers I could have tapped into that could have added immense value to either the product, my time management, or other major aspects of my biz. I say “could have” because I’ll never know. Ask for help when you need it, accomplish more. Easier said than done, I know. But always worth a try.\n\nSo what’s next for me? The truth is: I’m still figuring it out. All I know is this: hustle never dies, it just changes shape.\n\nBrianne Garcia is a writer, fashion lover, and general hardcore hustler. Follow along with her exploits on her blog and twitter. Her personal motto is: Always be hustling. Always be learning. Always be sharing. Always be curious."}