{"title":"Zagreb Cohousing FAIL","lang":"en","canonicalLink":"http://svedic.org/personal/zagreb-cohousing-fail","tags":[],"image":null,"videos":[],"text":"“Can’t believe we are moving out,” echoed in my head. I was sitting on the doorsteps of a large, modern house. The view was spectacular, but I had got used to it. Only the back room, gym and sauna didn’t have a view ‒ but I didn’t really mind. Maybe other people did? Not enough people had joined and we needed to leave.\n\nIt all started in 2010, when a Wikipedia article caught my eye. It was about the bizarre and hugely popular Danish trend of cohousing communities. This is the gist: typically, between 10 and 40 families join forces to purchase an empty plot of land. They build private houses that are a bit smaller than usual, but they also build a large common house, with a communal dining room, playroom, laundry, workshop, movie room, guest rooms etc. Common dinner is a killer feature. Instead of shopping, cooking and washing dishes every day, residents do it only few times a month. On other days, they eat in the common house (or take the food home), because somebody else is scheduled in the kitchen. Your kid is bored? Go to the shared playroom or playground. Need to run somewhere for an hour? Ask a neighbour to look after your kid. Need company to watch a football match? There is a large screen and a bar in the common house. Trying to save money? Cohousings get volume discounts and free delivery because they are buying in bulk. The group dinners mean that you actually get to know your neighbours. All of that sounds perfect to families ‒ for a reason. The cohousing movement started with a 1964 article titled “Children Should Have One Hundred Parents”.\n\nIt all seemed a bit too utopian for me. Croatia is a long way away from Scandinavian social experiments, and the whole idea went stealth for two years. Until I went to San Francisco in 2012.\n\nCohousing in the States is often about ideology, not convenience. Many of the projects there are ecological, religious or hippie-like communes. Not my cup of tea. However, Americans are also fond of cohousing’s smaller brother, coliving. Instead of building houses, a group of people just rent one and share the rooms. They are more than merely flatmates, because they organise and share activities. Whatever interest you can imagine, there is a house for that. Startup house, social entrepreneurs house, yoga house. Most of them recruit members publicly; others rely on wild rumours as the only advertising channel. For example, an invitation-only startup house in San Francisco accepts only entrepreneurs who have already sold their first company. Which is quite boring compared to a pick-up artists house or a clitoral stimulation house. The latter is not a joke. I met a guy who lived in an orgasmic meditation house (read about OM houses and 1080 Folsom Street). Imagine that, every morning female residents line up for a clit massage. Guys do the stroking for twenty minutes, everybody says thank you, and then they go off to work. California.\n\nI didn’t have the pleasure of living in an OM house, but I spent two winters in the Slovenian Startup House and Embassy SF. I was sceptical at first, thinking I was too old to be in roommate arrangements. But although there were no naked women laying around, I really enjoyed the experience. The cleaning lady would come once a week; we had common meals and shared food. Embassy SF even had a sauna, coworking space, 3D printers, bowling alley, automated food delivery and shared cars. I was sharing an enormous residence with interesting people for the price of a small Airbnb room. Impressed by my San Francisco experience, I decided to create a similar thing in Croatia ‒ a simple house for young working people, nothing niche.\n\nAn opportunity soon arose. My new startup needed an office space. I decided to upgrade my flat. Rent for each was around €400 per month, so the total was €800. For just a bit more I could get an entire house. Within a month I had found the perfect place: 250 sqm, completely new, with 5 bedrooms, a view, gym, sauna and a backyard ‒ all for a mere €1200 per month. Outside rush hour, it was an 18-minute drive to the city centre. To test an idea before putting down a deposit, I created an “MVP”. I posted an ad and copied agency pictures, as though I already had a house. I named it “Zagreb Cohousing” and declared it was for “young professionals (24-44) with a steady income”. Six people applied. Perfect! I started negotiating with a landlord. She stared blankly while I explained cohousing and told her that I wanted to sub-let the rooms. Two meetings later and after doubling my deposit, she agreed. After signing the contract I felt enormously happy. Every room was screaming with unrealised potential. Not for long, I thought.\n\nIt started superbly. I found my first roommate in one day. Jure, who had responded to the “fake” ad, was enthusiastic and moved into the large room two days before I did. He had a job in nearby Slovenia but was drawn to Zagreb’s bigger city vibe. Every weekend, his girlfriend and friends would come over for a barbecue. We joked that his ensuite bathroom was so large that people could live in it ‒ because they often did. If he put a mattress on the heated floor, two extra people could sleep over. They would often make extra food and leave it with a cute post-it note.\n\nThe lobby became the work space for my startup. A cleaning lady would come weekly. “Cleaning” doesn’t do her justice, because she also did the ironing, changed the bed sheets and cooked one or two meals for us ‒ all for €25 a week. We felt like the Rockefellers.\n\nWe started organising parties and potluck dinners. A girl whom I had been seeing previously called me up and said, “I hear you have a sauna. When can I try it out?” Life was great.\n\nBut there was a problem. The house was half empty. I put more effort into marketing and created a website and a Facebook page. I was featured in the local newspaper. The more people contacted me, the more obvious it became that my initial MVP test was wrong. I hadn’t investigated the target market. For a start I was surprised that most of the applicants were heavily into an alternative lifestyle. That wouldn’t have been a problem, but our house didn’t have anything to offer them. Do you have an organic garden? Are you vegetarians? How far is the house by bicycle? I organise monthly energy healing classes ‒ does that count as a steady income? They were disappointed to hear the landlord didn’t want a garden planted, that we ate meat, and that the house was a one-hour bike ride from the city centre. Their biggest disappointment was the price of €160 per month for a modest room.\n\nI knew Croatia has a high rate of unemployment and that many people don’t have cars, but surely there were three people in the capital city who wanted to pay a little extra for a nicer lifestyle? But how to find them? Since the price was about the same, I placed an ad in classifieds for single-room apartments. The next day, I got a call. “We’ve deleted your ad,” the moderator said, “because it belongs to the rooms-for-rent section.” After I did exactly that, I started laughing. The photo of our house was squeezed between pictures of small rooms with ʼ80s furniture and for half the price. Then I realised that that small money is still enough for some old lady to pay her monthly bills, and I stopped laughing.\n\nThere was another problem. A few of the application emails were enthusiastic, especially from girls. They loved the concept and wanted to visit. The next email was less eager and, by the last one, they had changed their mind. I realised later that between the first and the last emails they had had talks with friends and family. Some people asked me straight out if we were a sect or a hippie/free love commune. One real estate agent called our landlord and claimed that we would destroy the house. Nobody had heard of Danish cohousing, but everybody watched Hollywood movies. Somehow, I became a cohousing/coliving evangelist in Croatia. I did a few interviews and even appeared on national TV.\n\nAfter New Year, Jure decided to move back to Slovenia. He was replaced by two others: Andreja, a very active girl who worked as a medical researcher, and Vlatko, a calm guy who translated French comics for a living. Same as Jure, they were a great fit; on evenings when we stayed in, we would always hang out in the winter garden. My brother moved in for a few months and converted a small room to a tricopter factory. Great, but we still needed two more permanent residents to consider it a success.\n\nAs the end of our first year in the house approached, I realised it was probably not going to happen. At the end of August, five people applied, all wanting the €160 room that was already taken. When I told them we had a €180 room available, they all said the extra €20 was more than they could afford. A few people came for a drink but decided they didn’t like the furniture or the location. Residents aside, I didn’t need an office anymore. My cofounder became a dad and started working from home, and our marketing guy decided to work from the Canary Islands. At one point I started looking for houses closer to the city centre, but they were double the price or simply in a bad condition. Running out of options and with two rooms still empty, I decided not to extend the lease.\n\nPrice wasn’t the main reason. Sometimes you need to quit in order to move on to new things. Andreja, Vlatko and I found a large three-bedroom flat nearby. It also has a large living room, a balcony and a view. Funnily enough, the price per room is the same. Nice places always cost money. We still have our cleaning lady, but that is it from shared economy. No work space, gym or garden. Large dinners, grocery delivery and car sharing don’t make sense with only three people.\n\nI learned many things in the past year and the key takeaway is that most people are unwilling to pay extra for a shared housing arrangement. A flatmate situation is a typical tragedy of the commons; everybody values only their own property (private room) and sees little value in the public property (shared rooms). More than once people complained the price was too high for a room in the suburbs. Yes, it was ‒ but the price was for a house, not just for a room. In every sense, we felt like the house was ours and we made use of the shared spaces when we wanted. Having nice flatmates at the same time was an advantage. But people would disagree, and not just in Croatia. For example, a new trend in UK is rent-to-rent. Property investors rent houses and convert living and dining rooms into extra bedrooms. That way they rent out a three-bedroom house as five individual rooms and make a nice profit. Beautiful ‒ the total antipode of the cohousing/coliving concept. You sleep in a dining room, and the only way to socialise with flatmates is in the queue for the bathroom.\n\nStill, I feel positive. The experience of living in the house was great; the only part I didn’t like was organising it. I met many, many people from all over the world excited about that kind of lifestyle. As I was leaving for the last time, I paused and looked back at what had been our home for one year. Maybe some other time, some other place.\n\nWould you like to live in a world where coliving and cohousing are normal? You can help, just share this with your friends.\n\nOr you would like to discuss this with the author? Book me for a 10min Skype call or a 30min Oxford walk."}