{"title":"Manilla, The Hearst-Backed Service For Managing Bills, Is Shutting Down On July 1","favicon":"https://s0.wp.com/wp-content/themes/vip/techcrunch-2013/assets/images/favicon.ico","description":"Account management startup Manilla says that it will be shutting down on July 1. We received several tips about the shutdown today, then when I visited the..","lang":"en","canonicalLink":"http://techcrunch.com/2014/05/09/manilla-shuts-down/","tags":["All Topics","Spotify","Apple","Uber","Manilla","\n\t\t\t\t\n\t\t\t\t\tBrowse more...\n\t\t\t\t\n\t\t\t","\n\t\t\t\t\t\t\tManilla\t\t\t\t\t\t"],"image":"https://tctechcrunch2011.files.wordpress.com/2014/05/manilla.jpg?w=560&h=292&crop=1","videos":[],"text":"Account management startup Manilla says that it will be shutting down on July 1.\n\nWe received several tips about the shutdown today, then when I visited the site and tried to sign up, I was directed to this announcement, which says that the service will continue to operate as normal until June 30. After that, users will no longer be able to upload new documents, and it will not retrieve any new data, though documents will still be stored on and downloadable from Manillauntil September 30.\n\n“This was a hard decision given that, over the past three years, Manilla has won many awards and has been well supported by its valued user base but was unable to achieve the scale necessary to make the economics of the business viable,” the company wrote.\n\nIncubated and backed by publishing company Hearst, Manilla launched at the DEMO conference in February 2011 with the promise of giving users a single website where they can pay their bills and manage their accounts (and access them on mobile apps as well). The service opened to the public a few months later.\n\nManilla also partnered with AOL, which owns TechCrunch, to create an AOL Bill Manager last year.\n\nThe company said that all the account credentials that users had entered into Manilla (so that it could connect to other services) will be deleted on July 1, as will all other data aside from un-downloaded documents."}