{"title":"Shutting Down Blurtt","favicon":"https://s0.wp.com/wp-content/themes/vip/techcrunch-2013/assets/images/favicon.ico","description":"Blurtt, which launched in its current form back in 2012, was a mobile app that allowed you to create their own digital expressions by allowing you to choose..","lang":"en","canonicalLink":"http://techcrunch.com/2014/02/16/shutting-down-blurtt/","tags":["All Topics","Spotify","Apple","Uber","blurtt","\n\t\t\t\t\n\t\t\t\t\tBrowse more...\n\t\t\t\t\n\t\t\t","\n\t\t\t\t\t\t\tblurtt\t\t\t\t\t\t"],"image":"https://tctechcrunch2011.files.wordpress.com/2014/02/shutterstock_146383358.jpg?w=560&h=292&crop=1","videos":[],"text":"Editor’s note: Jeanette Cajide recently opened an office in Cambridge MA for Dialexa, a technology product development outfit that helps companies, governments and entrepreneurs design and develop custom hardware and software products. She spent many years on Wall Street and in technology consulting prior to launching Blurtt. Follow her on Twitter @jeanettec007.\n\nBlurtt, which launched in its current form back in 2012, was a mobile app that allowed you to create their own digital expressions by allowing you to choose an image, add text and share either anonymously or to your network. Now in 2014, my beloved startup Blurtt is dead and all the assets are for sale.\n\nAs one of the cofounders of the company, I thought it would be helpful to walk you through the many incarnations of Blurtt and the challenges we had along the way in hope that other startups can avoid our mistakes.\n\nIdeas are a dime a dozen; the difference is in the execution. Below is a list of business models Blurtt considered, built and attempted to raise money on:\n\nWeb and mobile platform that curates photography and art from individuals and you can create and send your own postcard from your phone for $1.99.\n\nExecuted: Functional web platform that was live and running.\n\nProblem: We saw a new opportunity (idea No. 2) and changed the business model but needed funding to iterate and scale.\n\nFunding: Bootstrapped with investor interest but no commitments.\n\nAssessment: While many postcard app startups have received funding, this is a lifestyle business. If you want to turn it into a fundable business, you need multiple revenue channels and products. The exits, if there are any, will be small.\n\nWeb and mobile platform that allows you to send free postcards in the mail with an advertisement on the back.\n\nExecuted: Along with our web-based Blurtt-creation tool, we created a functional self-service advertisement portal similar to Facebook Ads that allowed you to choose your target demographics, location and gender. In order to send blurtts, we required Facebook Connect, which allowed us to get your data and match you with the advertiser.\n\nProblem: At this point we turned off monetization for Blurtt and they could be sent for free. However, we had no ad partners, as advertisers wanted to see high volume, and our fixed costs (printing, mailing, hosting) started to add up without any funding or revenue. I had to shut down Blurtt.\n\nFunding: Bootstrapped. Tried to raise money but feedback we received was that no one wanted to send printed postcards, and the name “Blurtt” was not good for snail mail as “blurt” implied impulsivity. The impulsivity of expression would be lost in the mail.\n\nAssessment: A startup recently launched in this space, and I think they will run into the same problems. The idea is good but you are adding an impersonal advertisement to a postcard that is supposed to convey emotion. While advertisers are trying to learn how to read and convey emotion through advertisements, it will take a considerable amount of funding and users to make this business model work.\n\nExecuted: Spent most of the year raising money on this idea. We received an acceleration agreement from Archimedes Labs in Silicon Valley.\n\nProblem:  The money we’d need to raise to make this happen would need to be considerable. We decided to build an MVP instead which at least addressed one of the two ideas.\n\nFunding: Raised our first $25K, which made it easier to raise more money.\n\nAssessment: The MVP ended up being Idea No. 4.\n\nMobile platform that allows you to choose an image from the web (or your camera roll) and add text over the image and share digitally. The blurtts could be shared anonymously or via your user name. The idea here was to give people a platform to use images to better convey how they truly felt. (An image is worth a thousand words.)\n\nExecuted: Mobile app launched in 2012. We were featured in TechCrunch and Mashable’s Top 6 Apps to Download for the Week alongside Angry Birds.\n\nProblem: It is hard to force a Blurtt. When we were working through the MVP it felt like “blurtting” was something one just had to get good at. Blurtt became a content-creation tool of which only 0.02475 percent of the people were actually both funny or clever extroverts who wanted to share their blurtts with the universe.\n\nFunding: We came close to closing a $1 million dollar seed round. When the investment discussion turned to who was going to run Blurtt and what team was going to build it, I had a falling out with the lead investor. I raised a $120K friends and family round and built and launched an MVP using those funds.\n\nAssessment: For the niche who is original, witty and creative, Blurtt was the tool for them.  Some of the content people started creating and sharing was vile and not at all the vision I had for Blurtt. We could not find product/market fit but had several ideas of where Blurtt could go. I did not have enough funding to iterate real-time. Blurtt started to fizzle away but I was going to give it one last shot.\n\nI have a Joan of Arc complex so the only time I will give up is when they burn me at the stake.\n\nWe launched Blurtt (idea No. 4) in March 2012, and by September 2012 it was obvious that we were not getting the traction we needed to raise money. I convinced one of my business classmates to let me live with her in New York City as I tried to find a technical co-founder (i.e. free developer) who could help me with Blurtt.\n\nAt this point, I had my bags packed and I went to say goodbye to the team I had hired to help me build my MVP, a product development company in Dallas called Dialexa. Co-founders Mark Haidar and Scott Harper said, “You can’t just leave Dallas. You are way too smart and too talented to be sleeping on floors and couches and begging people to help you. We will take over Blurtt and you become the product manager and you can work for us.”\n\nAfter making zero salary for two years, managing $120,000 to build a product that might have taken any other person 2-4x that amount to build, I accepted Dialexa’s offer.\n\nI joined Dialexa and we were all happy that Blurtt was getting another chance. But I started to feel burned out. I was Blurtt’s fearless leader, but the problem with burnout is that you become hopeless and you lose every aspect of your creativity. I would stay awake at night thinking about Blurtt (what to do with it, punishing myself for my mistakes, thinking about the people who hurt me along the way and said I did not meet the “pattern of recognition for success” in the Valley). I’d go to work feeling tired and exhausted. I was burning the candle at both ends.\n\nIf I had not had two to three years of battle wounds to recover from maybe I could have bounced back quicker, but I was spent: emotionally, physically, financially and mentally. I asked my investors (who were thankfully my friends and family and understood) to give me a year to see if I could find it within me to save the company.\n\nAfter reviewing more business opportunities within Blurtt I realized it was time to let it go. In the end, time is actually your most valuable resource.\n\nTaking venture money is not the end all, be all. I remember getting asked questions like “Is this a lifestyle business?” like it was a bad thing. The reality is VCs look for big exits so they don’t want to invest in your multi-million-dollar venture even if you’re making millions. I kept on changing the vision to appeal to investors so I could chase the bigger dollars so I could build the startup I really hoped to build. In the end, the passion and magic was lost.\n\nDo not launch a startup if you do not have enough funding for multiple iterations. The chances of getting it right the first time are about the equivalent of winning the lotto.\n\nRemember why you started this in the first place and never lose sight of it, because once it becomes something you are not happy doing — you shouldn’t be doing it. I wanted to change the world by giving people a way to express their true emotions.\n\nI want to take this time to thank Blurtt’s cofounders Laura Jensen Gurasich, Kuba Tymula, and Nikhil Sethi who never gave up on me. My team at Dialexa who stepped up to the plate when things got especially tough and helped me get an MVP out that dazzled the world, even if just for a short while. And to my investors and my family, thank you for believing in me. When you invested in Blurtt, you invested in me. This won’t be my last rodeo."}