{"title":"A Postmortem For Flud, The Social Newsreader","favicon":"https://s0.wp.com/wp-content/themes/vip/techcrunch-2013/assets/images/favicon.ico","description":"In late July, news broke that Flud, the social news reader for iOS, Android and Windows Phone, was headed to the deadpool. Startup failure is an all-too..","lang":"en","canonicalLink":"http://techcrunch.com/2013/09/22/why-startups-fail-a-postmortem-for-social-newsreader-flud-and-what-to-take-from-sonars-demise/","tags":["All Topics","Spotify","Apple","Uber","FAIL","\n\t\t\t\t\n\t\t\t\t\tBrowse more...\n\t\t\t\t\n\t\t\t","Startups","FLUD","\n\t\t\t\t\t\t\tFAIL\t\t\t\t\t\t","\n\t\t\t\t\t\t\tStartups\t\t\t\t\t\t","\n\t\t\t\t\t\t\tFLUD\t\t\t\t\t\t"],"image":"https://tctechcrunch2011.files.wordpress.com/2013/09/flud-hand.jpeg?w=300&h=199&crop=1","videos":[],"text":"In late July, news broke that Flud, the social news reader for iOS, Android and Windows Phone, was headed to the deadpool. Startup failure is an all-too familiar, even cliche, story in Silicon Valley. But when San Diegoan co-founders Bobby Ghoshal and Matthew Ausonio officially shuttered the Flud app and website in August, after three years of development, it was a disappointing final chapter for a product that had attracted more buzz in a year than the average startup sees in its entire lifecycle.\n\nIt was also a surprising conclusion, considering that Flud had managed to raise $2.1 million in seed financing from investors Detroit Venture Partners, Ludlow Ventures, Behance co-founder and CEO Scott Belsky and JFJF Ventures, among others. Furthermore, reports circulated last year that FLUD was continuing to see interest from investors and was in the process of raising up to $8 million in new funding.\n\nBut Flud never closed on the round and today, the startup is no more. In fact what eventually killed Flud, was that the company wasn’t able to raise this additional funding. Despite multiple approaches and incarnations — including a pivot toward enterprise — in pursuit of the ever elusive product-market fit (and monetization), Flud eventually ran out of money — and a runway.\n\nTo date, the founders have yet to speak publicly in any detail about Flud’s closure and why the company wasn’t able to turn a promising start into fame and fortune. Last week we caught up with Ghoshal, who graciously agreed to peel back the curtain and offer a bit of a postmortem on Flud– for sake of clarification and, of course, edification.\n\nStartups are hard — don’t let anyone tell you differently — and everyone fails. Some just learn to fail better than others, and that’s what makes the difference.\n\nFlud’s story has much in common with another recent casualty in the mobile space: Sonar. In a recent post on Medium (which is a must-read for all entrepreneurs, investors and startup peeps), former Sonar co-founder and CEO, Brett Martin, offered insight into why his own mobile, location-based startup went bye-bye.\n\nSonar and Flud were both downloaded by millions of people, were promoted by Apple and Google, raised multiple millions and received high praise from the media — and yet you know how both stories ended.\n\nAs Paul Graham has famously said, one of the keys to building a successful startup isn’t necessarily having a brilliant idea, but to “make something that people actually want.” When Ghoshal and Ausonio began developing the idea for Flud in the summer of 2010, their big vision was to build a product that wouldn’t just be another RSS-based news reader or social magazine, but an actual social news ecosystem (and a design-centric, i.e. visual, one at that) — an “Instagram for news,” if you will.\n\nWhile it’s easy to say, as an armchair observer, that part of the reason Flud failed was because the market was already saturated by similar products and the competition was too strong. After all, when Flud launched its first app for the iPad in August 2010, Flipboard and Pulse were already well-established, had millions of users and mostly dominated mindshare in the newsreader market.\n\nPlus, Flud had to work against the fickle, uncertain and ever-evolving relationship people have with news and news consumption tools. They always say they want a better newsreader, are willing to try something new, but then they cling like pocket lint to what’s familiar. Look at what happened with Google Reader: Most digitally-savvy people seemed to agree that, while Google and RSS were fantasti-awesome for many years, eventually smarter, real-time tools offered greener pastures. Seemingly in agreement, Google started dismantling the service in 2011, finally turning it off this summer, and, of course, the Web went bananas. It was as if Google had just turned off their electricity and punched their mom in the face.\n\nBut, really, when Flud launched its iPhone app in December 2010, there was plenty of demand for a “better” way to consume the news — in truth, there still is. As an illustration of this, when we talked to Ghoshal at the end of December, the app was “adding a new user every four seconds.”\n\nIt’s also why (at least in theory) Flud struck a chord with the media: Fast Company put its iPhone app among the “Best UI Designs” of 2010 and NBC dubbed it “the future of news.” Hell, even some guy named Rip Empson (I know, right?) said Flud could establish itself as a “force to be reckoned with” in the news arena.\n\nIn retrospect, it’s pretty apparent that we were, in a word, “not exactly correct.” (Hey, even the best get it wrong sometimes, right guys? Right? Hello?) Nonetheless, and of course with a little of my own, requisite defensiveness, the demand for a better newsreader was there. And, going one step further, I’d argue that the initial vision behind Flud — the vision of building a full-service, design-friendly social news ecosystem — had appeal. And still does.\n\nJust ask the big social networks. Today, Facebook is in the process of developing its own social newsreader as it inches into territory where Flipboard, Pulse and Feedly are arguably still the best options, if not the best-known names. In regard to Pulse, LinkedIn bought the popular newsreader for $90 million earlier this year to help it develop its own content hub and news reading strategy. Not only did LinkedIn think it was worth $90 million, but has kept the apps alive in spite of the acquisition (and overlap) and continues to update them.\n\nBut who cares about them? (Yes, that’s half a rhetorical question.) In his post on Medium, Brett Martin details the results of Sonar worrying too much about competitors, like Highlight, Banjo and a host of others. Like Sonar, Ghoshal says that there was always noise about how well Flipboard and Pulse were doing, but it was always more psychological. In the end, you can’t let what other companies are doing drive the direction of your business — the more you let them into your head, the worse it gets.\n\nIt’s impossible NOT to pay attention, naturally, but your response should be “Hrmm, that’s interesting — not ‘Oh, F#$%^&*” … Know a good idea when you see it (a “good” idea being a better way to solve the problems your users are having NOW, and if you want to push it, the problems they’ll be having in a few weeks, but NOT the problems they’ll be having in a year, that’s hubris. You’re not Steve Jobs), but don’t let it lead you away from your overall vision.\n\nInstead, if a startup is lucky enough to hit on an idea or a product that users actually want to use, what’s far more important than what the competition is doing is understanding what customers want and narrowing the gap between what customers want, what parts of the product they’re actually using and what your product’s functionality/feature set as it exists at the time.\n\nDon’t waste too much time worrying about press and coverage. If you build a great product, press will come — take it from me, I’m a doctor. Then again, Ghoshal tells us, believe in your product and vision enough so that you’re not surprised by press if it does come, and so that you’ll be ready.\n\nGhoshal says that, leading up to Flud’s launch of the app three years ago, he and his co-founder were working on it part time. Hindsight is 20/20, as they say, but in part because they didn’t expect to get any press and hadn’t done a press-fueled launch before, little problems at the beginning snowballed quickly.\n\nFlud was lucky enough to get a ton of press around its early product launches. However, from then on, when the team would launch a new product, they would reflexively go after press, Ghoshal says. They would get press, users would overload the app, the system crashed, and when they finally got it back up, there were still too many bugs left, and, in a world of eleventy billion apps, people tend to be pretty unforgiving of glitchy user experiences. (As they should, by the way.)\n\nThe Flud CEO then concluded, chuckling: “One of the most important things I learned,” he says, “is that when you launch a new product — especially if it has some real ‘novelty’ to it — the best thing to do is shut up about it.”\n\n“We really didn’t test the initial product enough,” Ghoshal says. The team pulled the trigger on its initial launches without a significant beta period and without spending a lot of time running QA, scenario testing, task-based testing and the like. When v1.0 launched, glitches and bugs quickly began rearing their head (as they always do), making for delays and laggy user experiences aplenty — something we even mentioned in our early coverage.\n\nNot giving enough time to stress and load testing or leaving it until the last minute is something startups are known for — especially true of small teams — but it means things tend to get pretty tricky at scale, particularly if you start adding a user every four seconds.\n\nGhoshal also says that what testing they had done was too narrow in scope: “We also hadn’t tested our assumptions on what people would care most about in a newsreader — we knew that they’d want to share with friends after reading something, but we didn’t think they cared about things like influence. They did, and by the time we added that, some people had already moved on.”\n\nThis relates to the advice above: Know what your customers want and how they’re using the app, and as Brett Martin says, optimize for actual user behavior and, as much as possible, focus on removing friction from their existing behaviors. Not focusing on more abstract things, like tech or an amazing set of APIs.\n\nIt’s Hard To Recover Once Things Start To Spiral\n\nFlud was too concerned with press and not concerned enough with testing new features beyond a few trusted people, he says. And, after that, “things spiraled pretty quickly, because our new users heard about the bad experience from early users, reviews didn’t help, so we lost a lot of mindshare.”\n\nEven after Flud added much-needed features like email notifications to its early product, it was too late, he said. “It’s really hard to recover from that early spiral.” In response to these early problems, the team went heads-down to focus on rebuilding the tech side of Flud, while its competitors focused on user acquisition, the CEO says. But this was a reflexive decision, and it led to Flud going too far in that direction.\n\nAs Martin says of Sonar’s experience, for startups, there’s an ongoing, internal battle over whether to focus on growth or engagement, and how to balance the two. However, if a startup is building a social product, he says, growth is what’s key — engagement doesn’t matter. Ghoshal’s account echoes that of Sonar — perhaps not surprising considering Flud was essentially trying to reimagine what a social network should be in the context of news consumption.\n\nIn the long run, the Flud CEO believes that the team did eventually succeed in building a much better product on the tech side, but when it came time to raise capital, “investors don’t want to invest in a third-tier newsreader.” To Martin’s point — all they cared about was growth. And because of it’s early struggles, Flud had a steeper hill to climb thanks to plateau-ing user adoption.\n\nOnce Flud saw that investors were balking at its consumer product, it had to take stock in the business. The team quickly realized that money was getting tight and it had to move quickly to find a new market where customers would pay — in other words, where it could build a real business.\n\nEarly on, Ghoshal said, a number of enterprise players had reached out to the company, saying things like, “even though Flud is a consumer product, our executives just bought iPads, and they want to use the app, but they need to use it behind a firewall.” Essentially, these companies wanted Flud to build a white label product, keeping the user experience the same, but optimizing it for “big company” use cases.\n\nAt the time, Ghoshal says, he didn’t see the opportunity, so Flud turned down those opportunities. But when it came time to pivot, they went back to those initial leads and found the demand was unchanged. Flud moved quickly to launch a new enterprise version, which launched in December of last year with 1,500 companies on its wait list.\n\nImpressively, in the four-plus months that its enterprise product was live, the four-person team was able to bring in about $500K in bookings. However, the team hadn’t given itself enough time — it ran out time and money before it could really get the ball rolling in any significant way.\n\nIn spite of Flud’s failure, Ghoshal believes that there’s still a huge opportunity for a “consumerized,” social, news-sharing network for medium-sized and businesses. “The enterprise is hungry for a product like this,” the CEO says, “and it’s something not many are talking about. Big companies have a content sharing problem that Yammer isn’t adequately solving.”\n\nThese companies want to offer a product through which employees can read content about their customers, along with internal news and content shared by executives and managers. They want to be able to track what people are reading and offer better, more personalized content.\n\n“There’s a huge opportunity for a product that offers businesses, particularly enterprise businesses, a better way to read, share and syndicate content internally,” the Flud co-founder tells us. While Flud began to do just that, it also ran into problems that any consumer-facing startup moving to target the enterprise has to deal with, and it didn’t have the resources to see it through.\n\nAs many know, Ghoshal says, building a product for the enterprise is an expensive proposition and startups need to make business development hires, deal with the hand-holding and time required to negotiate the more complex integration processes in enterprise — not to mention the capital demands that come from dealing with longer sales cycles.\n\nIn the end, though it was seeing encouraging data from its early customers and had nibbles of interest from investors, “they all wanted to see three to six months worth of data, but we only had two months worth,” Ghoshal explained. Investors wanted to see more validation, which Flud didn’t have, and that, in the end, is what finally killed the company.\n\nThe decision to shut down or sell a company is a nerve-racking, white-knuckled process down to the last minute. The process is all-consuming, and leaves many in bad sorts. While one would assume that it would be tough for employees and founders to move on to the next opportunity, once there’s finality, it can be a lot easier to move on.\n\nThe whole Flud team has moved on to different projects, and Ghoshal says he’s beginning to work on his next startup, though he’s not ready to talk about what that is just yet. In the meantime, the founders are in the process of looking for a buyer for Flud’s assets and are in conversations with several potential acquirers.\n\nHis advice to startups on what to look for in a potential acquirer? “I think for most, it’s a matter of figuring out which company would benefit the most from your product,” he says. “It’s probably obvious, but the company that’s going to give you the best value is the one that wants to sell the product right away … and isn’t going to just give you cash and then shut it down.”\n\nFor more, check out Brett Martin’s postmortem on Sonar here, and for another great (postmortem) read, check out Mark Hendrickson’s post on Plancast. While the failure rate of startups hasn’t changed, it’s great to see that more entrepreneurs and startup peeps are willing to admit that it’s happened to them and share what they learned so that others — when they do fail — at least won’t make the same mistakes."}