{"title":"Why I'm Open Sourcing My Failed Startup","lang":"en","canonicalLink":"http://techu.com.au/2014/03/open-source-startups/","tags":["Startup Life","Web Development"],"image":"http://techu.com.au/wp-content/uploads/2014/03/Screen-Shot-2014-03-02-at-12.31.39-pm.png","videos":[],"text":"Not every startup is a success. In fact, as I’m sure you’re well aware if you’re reading this post: the majority of startups fail. Some, like World Burrow  started product development too early and never made it to market.\n\nI originally had the idea for World Burrow towards the end of last year when I was on work experience. I noticed that the work experience workplace often had a few unused meeting rooms. After noticing the rise of coworking spaces, I thought wouldn’t it be great if entrepreneurs like myself were able to hold meetings in these spaces? I was sure there were offices with unused office or desk space as well. So I charged ahead, I taught myself the Laravel PHP framework and started coding. I was about pretty much finished creating the initial website platform to support the model when Hotdesk launched. Hotdesk is (almost) everything I’d hoped World Burrow to be. Unbeknown to me when I had the idea, Hotdesk had already run a crowdfunding campaign months prior for their idea. Soon after, other key player in this space, LiquidSpace, launched in Australia.\n\nWhat was I going to do? With some other players now in this space I needed a point of difference and thus decided I’d change the focus.  There’s always enterprise I thought.  My plan was to rather focus on large (1B+ annual revenue) companies wanting to do good with their local entrepreneur & freelancer community. The idea was that they give their unused space and meeting rooms to these people for free, and World Burrow will promote their space, get some positive publicity for them, cover insurance and keep their competitors from using the space. In hindsight, the model is clearly not scaleable. I emailed the people responsible for CSR at these companies and of those that responded, they all said that it would not work with their workplace due to their security restrictions.\n\nI’d already written a substantial amount of code for the platform and rather than leaving it to rot on my hard drive, I’m open sourcing it for anyone to use. It’s called the The Collaborative Consumption Marketplace Platform Project (CCMPP.) I’m sure the CCMP will be an excellent starting point and will save a collaborative consumption (or other) startups some time in development. I know I would have appreciated it if something like this existed when I started development.\n\nAnd I ask you to do the same, do you have any products you have developed that didn’t make it to market? I’m sure there will be someone out there that will appreciate your code.  Upload your code to Github and help someone out."}