{"title":"10 lessons learned from burning $50,000 on a failed Kickstarter","favicon":"http://tech.eu/wp-content/themes/techeu/favicon.png","description":"In this guest post, Bulgaria-based entrepreneur Ivaylo Kalburdzhiev shares the 10 main lessons he's learned from a failed venture, KOLOS.","lang":"en","canonicalLink":"http://tech.eu/features/4346/kolos-kickstarter-story/","tags":["Ivaylo Kalburdzhiev","KOLOS","kolos kickstarter","startup lessons"],"image":"http://tech.eu/wp-content/uploads/2015/04/kolo.png","videos":[],"text":"This is how you probably don’t want to see your startup trajectory as a first-time entrepreneur:\n\nCome up with an idea\n\nGo to your bank and get a loan\n\nSee it fail after three years in development\n\nWell, that’s exactly what happened to me.\n\nHopefully, sharing my experience will help you avoid falling down a similar path.\n\nIt was the end of 2011, tablets were just gaining traction. One day, I stumbled upon this:\n\nAfter seeing the image, I thought: “That’s interesting. Why not combine the already established gaming wheels concept with an iPad, the most popular tablet out there?”\n\nAfter a couple of months of research, I didn’t find anything similar and so I diligently made the decision that would shape the next three years of my life: to build KOLOS, “the world’s first” racing wheel for full-sized iPads.\n\nThrilled, I went straight to my bank and signed off papers for a $30,000 loan. Without bothering to make a DIY mockup first, I instantly contracted an industrial designer to create the CAD models. Then, I ordered a couple of 3D printed prototypes and filmed them for a fancy video.\n\nBy then, more than a third of the money had disappeared just like that.\n\nFast forward a few months, I launched it on Indiegogo (which was considered this new “crowdfunding” concept back then) to test the demand. We got featured here and there and a few lost souls chipped in $115 for a potential piece of plastic. Needless to say, the campaign didn’t reach its $150,000 goal, so I decided there was something wrong and I needed to fix it. This was already a year in and I still hadn’t talked to any potential customers.\n\nAfter numerous rejections from accelerators and investors, I started going to conferences in order to build my network, pitch the idea and get actual feedback (finally). Many early-adopters liked it.\n\nBut, did they have an iPad? Did they really believe there were real problems to be solved? Or was it just something fun and “nice-to-have”? And did I ever bother to ask them all that? Nope.\n\nIn the summer of 2014, the team went through an accelerator receiving another $20,000 (bringing the total amount to $50,000) and visited the international CES event shortly after. Mostly, we kept hearing things like, “I’d like to get it for my son/nephew/cousin,” instead of, “That’s super awesome, I want it now!!11!” and then throwing money in our faces. Distributors liked it, but what do they know? They just want to make a buck out of it anyways, so they weren’t a real indicator.\n\nA few months later, a Kickstarter campaign followed – this had been after a total of three years of product development. Eventually, I cancelled it after embarrassing – yet also sometime constructive – comments and getting picked up by major publications, such as Cult of Mac, VentureBeat, and Yahoo! Games among others.\n\nHere are some of the lessons I’ve learned from the roller-coaster journey:\n\nWhen I first came up with the idea, I didn’t own a tablet, nor was I actively playing racing games on any platform. Guess what the very first thing I did with the money was? I actually bought an iPad and installed a few tilt games. I was never solving a problem I had myself, which naturally involved a huge chance of building the wrong product.\n\nWhatever you start working on, make sure it’s a pain you’ve had yourself, so you can really relate to it.\n\nMy initial research didn’t show any similar accessories to the idea I had at the time.\n\nThe questions I should have asked and, more importantly, answered, are: Am I really the first one to come up with this idea? Or is it just something nobody needs? If it’s really an awesome idea, why isn’t someone else already doing it? Competition usually means there’s a market for it in the first place. I obviously thought I was going to create a new category. Yeah, right.\n\nBefore I ever spent a penny on anything, I should have first put together a similar minimum viable product (MVP) and went to talk to people at an Apple Store for feedback. It would have saved me a lot of agony if I had realized early on that there weren’t any real problems to be solved. The iPad is a portable lightweight device, which doesn’t really need an extra bulky accessory to make the experience more comfortable and precise – or to be stuck to a table only.\n\nIn order to justify the product to myself, I started making problems up – there’s an extra iPad tilt, tired arms, uncomfortable grip,  etc. Joining the accelerator, we were reminded of how important talking to customers actually is. So I “cleverly” put up an online survey and started sending it out to all our subscribers, with biased questions like, “You have these problems, right?” What I should have done is actually gone out of my comfort zone and talked to them one-on-one about their lives, experiences and pains. Instead, I continued to perfectly execute the wrong plan.\n\nWith KOLOS, we did a lot of things right, but it was useless because we ignored the single most important aspect every startup should focus on first: the right product. I consider it the classic mistake for first-time entrepreneurs. If you’re just starting out on an idea, I would recommend reading and implementing The Lean Startup by Eric Ries. There are also two free courses that could possibly save you years of mistakes, time and money – I wish I would have taken them before I started.\n\nAlong the way, I’ve heard the same thing over and over again, “Why just the iPad, why not all tablets?”\n\nLooking back, if I would have properly validated the concept, I would have approached a broader market. For example, an adjustable accessory – not necessarily a wheel – that could fit all available gaming tablets out there. Although some recommend dominating a niche first, I think the chosen one, which was full-sized iPad racers only, was too narrow to start with.\n\n7) Take a good look at the market and its potential\n\nAnother risk I took was diving into a new category so quickly – the iPad is now being cannibalised by iPhones and MacBooks and its sales are forecasted to drop rapidly. Overall tablet sales are also projected to continue at a slow pace in 2015. As one of the world’s most renowned VCs, Marc Andreessen once wrote, market is “the only thing that matters”.\n\nI used the money to pay for 3D models, expensive prototypes, a trademark, design patent and huge attorney fees. Then, I used more of the money for a fancy video, to write a business plan, to fix my car, for a new phone, for a four-figure marketing strategy and more. My financial ‘planning’ was so destructive because I thought the money would never end. I used it in a million meaningless ways, just before I realized I was going broke. What I learned: You don’t need any of the things mentioned above until you’re sure that you’re building something that people actually want.\n\nProduct Hunt founder Ryan Hoover wrote something gold: “When you look back at yourself six months from today and don’t feel embarrassed by your naiveté, there’s a problem. That means you’re not learning, growing.” At the time, I really believed there was a chance we were doing something that would sell. And I couldn’t have been more wrong.\n\nWhen I personally emailed every single subscriber saying, “Still interested? Here is it!” and linking to the Kickstarter, out the hundreds of opens, I only received five responses with two of them ending up pledging. So: Always be brutally honest with yourself about what you are building and why it matters.\n\nIn 2014, I got fired from my day job and two of the team members from KOLOS left. I thought it would be the perfect time to rebuild the team and fully dedicate to the project, which I ended up both doing.\n\nHowever, if you haven’t made any significant progress after two years, something is probably dead wrong. The Kickstarter campaign was way overdue, especially since it was launched after three years of development, and the whole project simply took way too long. If it takes you more than a year to develop a physical product (read: prototype and test/get feedback on) and launch a crowdfunding campaign, you’re probably going too slow.\n\nI like to look at my experience as if I went through an affordable MBA. Stanford and Harvard both welcome you at about $100,000 per year, and I doubt I would have learned so much more there – even I if could afford it. I don’t believe you need to go through any of that to be a successful entrepreneur though. Buffer co-founder Joel Gascoigne didn’t go through an expensive MBA program. Instead, through a side project, he identified and – more importantly – tested-before-he-built a solution to a problem he had with social media-sharing. In a blog post, Joel recommends a list of 50 books that have transformed his personal and business life. Read just half of them and I’m sure you’ll be good to go.\n\nHere’s how a few other big-name companies validated their ideas without much effort or resources before building: Andrew Mason of Groupon initially sold only T-shirts in one size and colour in a simple WordPress blog to test the concept. Nick Swinmurn of Zappos took pictures of shoes and uploaded them online to see if people were actually ready to buy shoes online – it was 1999. Drew Houston of Dropbox put together a short demo of how the product was meant to work, testing his assumption of people wanting a seamlessly working file-sync tool.\n\nFrom my modest experience, I’ve learned that just because you’re building something, doesn’t make it worthwhile for customers. Think of that last useless app or product you saw recently. Did it ever cross your mind that you might be creating something similar?\n\nPerhaps, just like them, you decided it would be a great idea if you just built it? Unless you are scratching a very itchy itch you’re having yourself – and at least a few other people have – I suggest you stop the guessing game and get out of the isolation of your own home or office and start talking to customers in order to make something they’d truly want and pay for."}