{"title":"With ‘No Meaningful Position Beyond Flash’, Gaming Platform Mochi Media Will Close March 31","favicon":"https://s0.wp.com/wp-content/themes/vip/techcrunch-2013/assets/images/favicon.ico","description":"Mochi Media, a distribution and monetizing platform for Flash-based games that was acquired by Shanda Games for $80 million in 2010, is closing down, with..","lang":"en","canonicalLink":"http://techcrunch.com/2014/03/16/with-no-meaningful-position-beyond-flash-gaming-platform-mochi-media-will-close-march-31/","tags":["All Topics","Spotify","Apple","Uber","Gaming","\n\t\t\t\t\n\t\t\t\t\tBrowse more...\n\t\t\t\t\n\t\t\t","DEADPOOL","Mochi-Media","post","\n\t\t\t\t\t\t\tGaming\t\t\t\t\t\t","\n\t\t\t\t\t\t\tDEADPOOL\t\t\t\t\t\t","\n\t\t\t\t\t\t\tMochi-Media\t\t\t\t\t\t"],"image":"https://tctechcrunch2011.files.wordpress.com/2014/03/screen-shot-2014-03-16-at-22-41-44.png?w=560&h=292&crop=1","videos":[],"text":"Mochi Media, a distribution and monetizing platform for Flash-based games that was acquired by Shanda Games for $80 million in 2010, is closing down, with all services ceasing March 31. The latest casualty in the decline of Flash, Mochi’s shut-down is also a message to those businesses built on it to diversify or perish.\n\n“If Mochi had a more meaningful position today beyond Flash, then there may have been a different path for the company going forward,” CEO Josh Larson notes in a frank blog post published Friday.\n\nIf the news is a strong mark of the general viability of businesses that are focused too much on the shrinking world of Flash gaming, it doesn’t look like it came as a surprise to Mochi Media specifically: one of the co-founders, Bob Ippolito, was among those who had been trying to prevent a closure of Mochi and had even tried to re-acquire the company from Shanda.\n\nIn a post on a Mochi Media user forum about the news, he writes:\n\nTo be clear, Ippolito is no longer working at Mochi but appears to have remained engaged with company happenings from the sidelines.\n\nIn an email, Larson tells us that all Mochi employees (including himself) are now wrapping things up and looking for work elsewhere.\n\nThe news comes not just on the eve of GDC, but also at a time when China-based Shanda Games has been the subject of acquisition rumors, with one report claiming Alibaba might pay upwards of $3.2 billion for Shanda Games and its controlling shareholder Shanda Interactive. (To be clear, we have heard from a reliable source that this was unfounded speculation.)\n\nAs for Mochi Media, you might call it another casualty in the decline of Flash, in this case as a platform of choice among games developers that are today focused on iOS, Android, Steam and more.\n\n“If Mochi had a more meaningful position today beyond Flash, then there may have been a different path for the company going forward,” Larson notes in a frank blog post published Friday.\n\nIndeed, while a lot of the Flash-based games, written for the web, seem to be designed to promote the equivalent gaming apps for iOS or Android (you can see one example pictured above), Mochi may have had little to no role to play in how those games were distributed across other ecosystems.\n\n“Most ‘Flash’ game developers I knew from the halcyon days of Mochi services (2006-2010) have moved on to make games in HTML5, Unity, and Corona for platforms like Android, iOS and Steam,” games developer Steve Fulton notes in a post on a Gamasutra community board.\n\nMochi Media had provided a few different services: for Flash games developers it offered a distribution platform on the Mochi site as well as through a network of other sites; for web publishers it offered gaming content to put on their properties; and for advertisers it provided a network for serving their ads within and around this content.\n\nAll of these are now winding down. Mochi says it has stopped accepting new games, and advertisers using self-serve accounts can no longer pay any more money in.\n\nFlash these days seems to have diminishing importance as a platform for web development. By one estimate, today it’s used on only 14.7% of web sites, a decline of more than five percentage points compared to a year ago. (Unsurprisingly, Flash-maker Adobe published some figures about how vibrant Flash is in the gaming world — although these come from over a year ago.)\n\nMochi’s origins speak to a richer time for Flash. Founded in 2005 by Jameson Hsu and Ippolito, Mochi Media was quick to see an opportunity in providing a platform to help independent developers distribute their content — a concept that companies like Apple and Google picked up and ran with in their app stores.\n\nIn Larson’s words, the idea was “You focus on making a great game, and we’ll take care of the rest.” As he recalls it, at the time Mochi was founded, “Flash was a platform that held a lot of potential if developers could find ways to track, monetize and build better games. Together, Flash and Mochi provided an on-ramp to a career or business in game development.”\n\nIt was a business model that found some traction with VCs, too, with Accel and Shasta both backing the company.\n\nAs Mochi Media grew, it also used its position to promote the Flash platform as much as itself, organising the Flash Gaming Summit and other events. (Notably, there was no Flash Gaming Summit in the last year.)\n\nBut ultimately, as the wider gaming industry matured, it went in a different direction, even for games or developers that may first have had their start with Mochi.\n\n“We take great pride in currently seeing Ninja Kiwi’s Bloons TD5, and Flipline Studios’Papa’s Freezeria To Go among the Top Games Charts on iOS,” Larson writes. “We love that at one time we shared a desk with Casual Collective which is now known as KIXEYE.”\n\nAfter the end of the month, online accounts, dashboards, and forums hosted by Mochi Media will no longer be available. If games distributed by Mochi are hosted on third-party sites, they will continue to work, but without Mochi services such as ads, Live Updates, Scores, Achievements and Analytics, the company says.\n\nCustomers can download all of their data, and Mochi says it will also be sending basic data around views and revenue information for games to users before the end of this month. It also has made some details about how it plans to pay out remaining monies to customers for those with over $100 in their accounts.\n\nMochi has said that it has thousands of developers on its books. “Please keep in mind that a large number of people will likely be requesting a massive amount of data from our servers over the next couple of weeks, so please be patient with the computing times,” Larson writes.\n\nUpdated with more detail about the closure, acquisition attempt and h/t."}