{"title":"Outbox Shuts Down Its Mail Digitizing Service","favicon":"https://s0.wp.com/wp-content/themes/vip/techcrunch-2013/assets/images/favicon.ico","description":"Mail startup Outbox just announced that it's shutting down its current service. The company has one of those ideas that's both intriguing and slightly..","lang":"en","canonicalLink":"http://techcrunch.com/2014/01/21/outbox-shuts-down/","tags":["All Topics","Spotify","Apple","Uber","outbox","\n\t\t\t\t\n\t\t\t\t\tBrowse more...\n\t\t\t\t\n\t\t\t","\n\t\t\t\t\t\t\toutbox\t\t\t\t\t\t"],"image":"https://tctechcrunch2011.files.wordpress.com/2014/01/ipadandbrowser.png?w=400&h=246&crop=1","videos":[],"text":"Mail startup Outbox just announced that it’s shutting down its current service.\n\nThe company has one of those ideas that’s both intriguing and slightly crazy sounding — it sent people by your home to pick up your physical mail, then it digitized that mail, all for $4.99 a month.\n\nAfter a pilot program in Austin, Outbox launched the service in San Francisco a year ago, and it raised a $5 million Series A led by Floodgate over the summer.\n\nThe company itself isn’t going away. Instead, the blog post says it’s “focusing our team and resources on a totally new product.” Outbox says there just weren’t enough people signing up to pay for the service, at least given the company’s costs:\n\nHowever, after an extensive email marketing campaign to our waitlist, total yield from the waitlist was under 10 percent. And as we started marketing outside of this network, we had difficulty finding a repeatable and scalable acquisition channel. Across all of our efforts, our acquisition numbers were over $50 per lead.\n\nAs our marketing efforts lagged behind schedule, our density numbers remained consistently flat, causing us to spend about double our projected cost to service each customer. Even our most dense routes cost us approximately 20 percent more than our break-even target.\n\nAfter several months of testing and refining, we reasonably concluded that we were executing well and collecting good data—it told us that there wasn’t enough demand to support the cost model.\n\nThat may not come as a huge surprise to the critics who found the idea impractical or downright creepy. I tried it out myself for a few months, but eventually canceled my subscription. I wasn’t bothered by Outbox employees opening my mail, it just wasn’t as useful as I’d hoped, and it was a pain for me to coordinate with a roommate who didn’t subscribe.\n\nAs for current customers, the company says they will be able to download a copy of their digital archives until February 28.\n\nFor nostalgia, if nothing else, here’s a video we made of the actual mail pickup service."}