{"title":"Samba Mobile closes down","favicon":"http://telecoms.com/wp-content/themes/telecoms.com/assets/images/icons/48x48-favicon.ico","description":"UK MVNO Samba Mobile has closed down its business due to unsustainable mobile data costs. The service launched in July 2012 offering subscribers free mobile data usage in return for viewing adverts and ran on 3UK’s mobile network. It's a business model several have tried and none have yet succeeded with.","keywords":"operator, mvno, samba mobile, uk, eastern europe, western europe","lang":"en","canonicalLink":"http://telecoms.com/253092/samba-mobile-closes-down/","tags":["MVNO","Samba Mobile","UK"],"image":"http://telecoms.com/wp-content/blogs.dir/1/files/2011/06/sorry_we_are_closed-300x300.jpg","videos":[],"text":"UK MVNO Samba Mobile has closed down its business due to unsustainable mobile data costs. The service launched in July 2012 offering subscribers free mobile data usage in return for viewing adverts and ran on 3UK’s mobile network. It’s a business model several have tried and none have yet succeeded with.\n\nSamba Mobile was founded in 2010 and said at launch that it has financial backing from an international mobile operator and a number of very experienced and “well-connected independent investors”\n\nThe MVNO said that it closed down its operations primarily due to the high cost of wholesale data. It said that prices of wholesale data makes its current model unsustainable. The service will shut down its data service with immediate effect and warned that it may not relaunch unless negotiations with partners result in lower costs.\n\nThe firm added that all customers who bought a SIM card or Dongle during April 2014 will receive a refund and customers who bought a cash top-up that has not expired will be refunded for any unused data on their cash top-up. The refunds will be paid into the Paypal accounts used to subscribe to the service. However, funds that were earned from watching ads will not be refunded, the MVNO added."}