{"title":"A Post-Mortem","favicon":"http://38.media.tumblr.com/avatar_17c1f929e7f2_128.png","description":"YouCastr - A Post-Mortem","keywords":"technology","lang":"en","tags":[],"image":"http://assets.tumblr.com/images/og/text_200.png","videos":[],"text":"There are many post-mortems from failed startups out there, mainly because there are a lot of failed startups, and the people that start them tend to be very introspective and public about their successes and failures. I’m no different.  This post-mortem will serve to get things off my chest, organize my thoughts, get the most out of the experience, and share my experience with others.\n\nI’m also writing this to be able to point to a single, detailed, lengthy answer to the inevitable questions I’ll be getting from friends and colleagues about what happened with YouCastr. Now people can read to their heart’s content.\n\nAs I write about my experiences, people who know startups will see many common themes.  Most of the conclusions here are consistent with Paul Graham’s analysis and understanding of startups, what’s challenging, and why they fail (if you’re planning on starting a company, especially in tech, read every single one of his essays). But no matter how many times you read or hear certain lessons, you have to do it yourself to really understand. Here are my specific and personal experiences to add color to that advice.\n\nThe idea for YouCastr was hatched about three and a half years ago, during a car ride down from Jay Peak with my good friend Jeff Dwyer.  Throughout the entire ride we were throwing ideas back and forth about cool companies, fun ideas, and stuff that bothered us.  One in particular stuck with me, which was the idea of bringing Mystery Science Theater 3000 to the modern age, and let anyone provide their own comments.  After exploring this some more, I ended up settling on sports as the logical market. This would mean the commentary would have to be live, because otherwise it would have been just a podcast platform, which was not very interesting technologically.  A couple of days later I shared the idea with my soon to be co-founder Jeff Hebert, and we continued thinking about it.  Within a few months we put together a team of 4, created our initial plans, and began building an alpha version.\n\nAs we were getting off the ground, three of the four founders (including myself) were mainly working on building the actual product, since we couldn’t do much of anything without that. We learned Ruby on Rails, did our own designing, worked nights and weekend on the startup as a complement to our management consulting day-jobs, and clawed our way to our initial alpha and private beta.\n\nWe then spent the next three years building the company, quitting our jobs, raising money,  opening our office, hiring people, firing people, going back to bootstrap mode, and finally, pulling the plug.\n\nStartups are all about pivoting. It’s like a word game where you start with HURT, change one letter at a time, then end with LOVE, with many other four-letter words along the way (btw, you really can do that in 6 moves). In our case, we started as a virtual sports bar where people could chime in audio commentary and ended up as a do-it-yourself pay-per-view video platform.  Seems like a radical change, but each pivot was the equivalent of changing one letter.\n\nOur first pivot was to focus on live audio sports broadcasting of games that weren’t being televised (instead of adding commentary to nationally televised games), in response to what customers were doing. Then we added video broadcasting to that same market, focusing on broadcasting sports that weren’t covered (primarily high school and college).  And finally we expanded beyond sports, mainly by de-emphasizing the sports branding on our platform, and adding a few features more geared towards video producers than to schools and teams. All of these were natural pivots, not jumps.\n\nShutting Down - The Reasons and Need\n\nThe single biggest reason we are closing down (a common one) is running out of cash. Despite putting the company in an EXTREMELY lean position, generating revenue, and holding out as long as we could, we didn’t have the cash to keep going. The next few reasons shed more light as to why we chose to shut down instead of finding more cash.\n\n2 - The market was not there\n\nThe thesis of our current business model (startups are all about testing theses) was that there was a need for video producers and content owners to make money from their videos, and that they could do that by charging their audience. We found both sides of that equation didn’t really work. I validated this in my conversations with companies with more market reach than us, that had tried similar products (ppv video platform), but pulled the plug because they didn’t see the demand for it.\n\nVideo producers are afraid of charging for content, because they don’t think people will pay. And they’re largely right. Consumers still don’t like paying for stuff, period. We did find some specific industry verticals where the model works (some high schools, some boxing and mixed martial arts events, some exclusive conferences), but not enough to warrant a large market and an independent company.\n\n3 - The team was ready to move on\n\nThe core team of 5 of us has already made significant personal, financial, and emotional investment over the past three years. We have had our share of tough breaks, not to mention almost two years without salary.\n\n4 - No light at the end of the tunnel\n\nGiven the industry trends we were seeing, we just didn’t see a light at the end of the tunnel worth surviving for.  This market may get slightly better, but it’s not going to be a big company.\n\n5 - We need to put a stake in the ground\n\nWe’re survivors. We hate giving up, and have tenaciously survived for a long time.  We survived the worst economic environment in generations (during which we also tried to raise money), and knew how not to die.  But it was time to shut down and move on.\n\nIn most of the following points I say we, but as CEO, many of the mistakes below can be placed directly on my shoulders, which I will take as a valuable experience as I move on.\n\nWe did a pretty good job of pivoting, but we didn’t make the hard choices quickly enough. Our first pivot, towards broadcasting of original sports content, took us 6 months.  We had legacy users and web traffic that we were afraid of losing. We had a brand in one area. We had a story for investors, customers, and the community. All of that made it harder for us to quickly change our focus and apply all resources to the new area, which we knew was the long term future. We iterated our product quickly, but didn’t pivot fast enough.\n\nDidn’t love it\n\nWe started the company because we liked the idea and wanted to do something entrepreneurial. We weren’t in love with the idea or market we were going after, and weren’t core users of our product. We worked really hard getting it off the ground despite this, but it made it more difficult to sustain the energy and to understand the best product choices.\n\nHire slow, fire fast. That’s how the saying goes. We made a mistake when hiring. We hired too early (before product-market fit), and we rushed into it by foolishly setting an internal deadline to make the hiring decision, which drove us to ignore some gut reactions by some of the core team members. Eric Ries has a great overview of how not to make these mistakes in his Lean Hiring Tips post.\n\nAlmost immediately after our private beta we started trying to raise money, and saw many of the typical challenges when raising money for the first time.  This was late 2007 remember, when plenty of Web 2.0 companies were getting funded, and we got caught up in the spirit.  We spent 6 months raising our angel round, and finally closed it after launching our public beta in February 2008.  We raised less than we should have (Chris Dixon notes that the worst thing a seed-stage company can do is raise too little money and only reach part way to a milestone, which is great advice). We spent 3 months getting ready for raising our next round, then 6 months beating our head against a wall trying to raise money during the financial collapse. Finally we regrouped, but had serious short term cash issues that we had to resolve with additional investment from current investors and cutting of costs. We then focused on the product and made some solid progress, with the plan on giving it another go. By the time we got there, though, we realized we didn’t have the metrics we wanted, so pulled back our fundraising efforts and decided to go back to bootstrap mode.\n\nNever quite figured out customer acquisition\n\nWe never seriously figured out customer acquisition, and had trouble growing throughout our various pivots. Customer acquisition is hard and more expensive than most people realize when starting a company. There has been a lot of good analysis, including Andrew Chen’s overview of calculating cost per customer acquisition and David Skok’s warning about how it can be a startup killer, but it takes firsthand experience to understand that.\n\nWe started the company with four co-founders. I believe Dharmesh Shah nailed it in his analysis of the optimal number of co-founders. In our case, the advantage of having 4 co-founders was that had more people and resources willing to work for sweat equity. But it also presented challenges, including slowing down decisions, as everyone naturally wants to chime in with their opinion.  As CEO, a lot of this falls on me, as I should have been stronger in making decisions. I tend to be a consensus builder, but in my next startup I will have to improve my ability to make bold unpopular decisions while still motivating everyone and building consensus after the decision is made.  On the plus side, the entire founding team was incredibly committed through the entire time, and we never had any of the fundamental founder issues that many people complain about become a major problem.\n\nCounted on big partnerships to close (when they didn’t) and to help more than they did\n\nWe initiated some very interesting high level partnership and business development discussions with large companies. We put some hope into these deals, but large companies move much slower than startups, and every deal took much longer than we needed. Marc Andreesen even draws a parallel that going after large partnerships is like chasing Moby Dick.\n\nWe put too much stock and hope into closing some of these. And for the ones we did close, we expected more results than we got. It’s an interesting dilemma, because partners are often the best acquirers, but the downfalls can even lead people to suggest to NOT partner with big and powerful companies.\n\nWhat I Learned and some of the positives\n\nI’m an optimist by nature, which you have to be to start a company given the odds and challenges. Given that, it’s good to look back and think about the positives of the entire experience. It’s incredibly satisfying to create a revenue-generating company that is flirting with cash-flow positive, especially having started with a crazy idea. The experience of building a company and tasting success was incredible, and though we didn’t quite get over the hump, we have tasted it, and it will only motivate me more to get there again, through all the hardships.\n\nOn a personal level, I’ve learned more about business, people, life, and myself over the past three years than I ever have. I have made life-long friends with whom I can share these experiences with. I have come closer to understanding how to reach my limits, which is one of my fundamentals goals in life.  Startups let you try and find those limits  in a way that most jobs wouldn’t, and I’ll keep pushing. And best of all, I have realized that my true passion is entrepreneurship. I have a very addictive personality, and therefore only do things where I am comfortable with the extreme case, like starting companies or running ultra-marathons.\n\nWe built a great culture, including some great parties for the local tech-scene, competitive ping-pong matches, and late night coding sessions with house music blasting. We converted three lifelong PC people to Mac, all of whom are happier for it.  And most satisfying, we helped kick start two young and promising careers, those of our designer and community manager.\n\nMy long term goal is to continue starting companies.  There’s no question I’m in a better position now to start another company than I was when I first started YouCastr.  It’s almost like thinking back at how much more fun high school would have been had you known what you knew when you graduated back when you started. Practically speaking, though, after having gone almost 2 years without a salary, I’m not in a financial position to bootstrap another company, which is the way I would really want to start a company.\n\nIn the short term I’m working on various projects for my consulting company, Scenario4. We are working with some great people on some fun projects across the tech world.  I am also pursuing several side projects, including the recently launched BooksforBits, a non-profit company designed to help accelerate the transition to ebooks while getting books to communities in need.\n\nIt’s an incredibly exciting time in technology. We are on the cusp of the post-pc era, which includes a revolution in the mobile space, and in how we interact with and perceive computers. We are in a world where startups can be more capital efficient than ever before. And most interestingly for me, as a society we are going to be facing challenges unlike any we have ever seen.\n\nWith every ending is a new beginning, and I’m excited about what lies ahead."}