{"title":"10 lessons from a failed startup","favicon":"http://venturebeat.com/wp-content/themes/vbnews/img/favicon.ico","description":"A year and a half ago, my co-founder Dev Nag and I started an internet TV network for games called PlayCafe. Our ambitious plan was to run highly interactive game shows in which everyone was a contestant. Players could watch our hosts, answer questions, win prizes, form teams, call our studio, live chat, and run their own games. It was a huge undertaking, but despite great engagement — users watched for 87 minutes per session and 40 percent returned within a week — we didn’t reach enough users. We may revive it in the future, but for now, we’ve placed the site in hibernation and returned remaining funds to our investors.","lang":"en","canonicalLink":"http://venturebeat.com/2009/04/29/10-lessons-from-a-failed-startup/","tags":["View more","\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t"],"image":null,"videos":[],"text":"A year and a half ago, my co-founder Dev Nag and I started an internet TV network for games called PlayCafe. Our ambitious plan was to run highly interactive game shows in which everyone was a contestant. Players could watch our hosts, answer questions, win prizes, form teams, call our studio, live chat, and run their own games. It was a huge undertaking, but despite great engagement — users watched for 87 minutes per session and 40 percent returned within a week — we didn’t reach enough users. We may revive it in the future, but for now, we’ve placed the site in hibernation and returned remaining funds to our investors.\n\nWhat follows is a post-mortem of what we did right and wrong and how we will improve next time. I feel too many entrepreneurs are afraid to discuss their failures, locking up important lessons. I hope you find some of this useful.\n\n1. Find quick money first. We were fortunate to know several top investors but we spun our wheels pitching too early and trying to optimize terms. Many entrepreneurs seek A-list investors first; quick (but not dumb) money is more valuable. There are only about 30 high-profile investors in the Valley, they all know each other, and they generally have enough deal flow to wait until risk is minimized.  Money is more valuable than advice or connections since there are easier sources for the latter.\n\nNext time, we’ll focus on strengthening our network of investors who are comfortable at the earliest stage and invest quickly, even if they don’t have a high profile (as long as there aren’t red flags). More than three meetings is too long and indicates your network isn’t broad enough or your pitch is poor.\n\nLesser-known investors also often have more time to give you. David Shen, previously unknown to us, initiated multiple deals and a site-wide design evaluation for us; it took one meeting for David to commit. You want to find 10 David Shens. Once you have traction, the Reid Hoffmans and Ron Conways will find you anyway.\n\n2. Content businesses suck (or: do it for love and expect to lose money). Producing quality content every day is a herculean task, especially live. The idea of creating both the content and technology for PlayCafe seemed achievable, but TV networks focus on distribution and studios on production for good reason: both are hard. Dev and I knew we were production novices but we thought live-filming a pretty girl delivering trivia with one camera guy was simple enough. We were wrong; the business was beyond our pay grade.\n\nWatch American Idol, the country’s most popular show, and you’ll see how often they screw up despite massive resources: sound and video fail, hosts and contestants stammer, camera angles are wrong, stretches get boring, and it happens despite a reality format that is simpler than live sports or news. They also don’t have to deal with DOS attacks, server downtime, scalability, or customer support like we did.\n\nI would advise any entrepreneur or investor considering content to think twice, as Howard Lindzon from Wallstrip warned us. Content is an order of magnitude harder than technology with an order less upside; no YouTube producer will earn within a hundredth of $1.65 billion. This will only become more true as DVRs and media-sharing reduce revenues and pay-for-performance ads eliminate inefficient ad spend, of which there is a lot. The main and perhaps only reason to do content should be the love of creating it.\n\n3. Know when to value speed vs. stability. Another reason PlayCafe’s complexity hurt us is that developing good content and technology simultaneously required too much time. We tried to make each deep and stable — important, we thought, given our live nature — but we were too slow to iterate in a novelty- and entertainment-based business.\n\nA metaphor I like is that a chess novice can defeat a master if moving twice each round. This generally increases bugs and offends perfectionists, but I agree with Reid Hoffman that if you review your first site version and don’t feel embarrassment, you spent too much time on it.\n\nAn exception is when your product is mission-critical for users. An eBay outage is a catastrophe while a Twitter one is a joke. eBay iterates slowly partly because 1.3 million businesses depend on it. It has to get it right.\n\n4. Set a dollar value on your time. I agree with Paul Graham that good entrepreneurs are relentlessly resourceful, but I have a bad habit of bargain-hunting for sport. I spent three hours negotiating our wireless bill down $100, which was a poor use of time given our funding. The mantra to pinch pennies ignores the value of time.\n\nTime is arguably more valuable than money because you can’t raise more time. Dev suggested pricing our hours. You can divide your available work hours by salary, remaining funding, or total company costs. Ours was around $50/hour. If I was going to spend 5 hours negotiating, I’d have to save at least $250. This value should increase as you gain funding and traction. For anything greater than $500 at any stage, I’d still strive for NPR: Never Pay Retail.\n\n5. Marketing requires constant expertise. The main failure of PlayCafe was marketing. Dev and I came from PayPal, a strongly viral product at a company almost hostile to marketing. Our efforts in SEO, SEM, virality, platforms, PR, and partnerships weren’t terrible, but drawing users to a live event requires constant, skillful work.\n\nLike creating content, I no longer think marketing is something smart novices can figure out part-time. As the web gets super-saturated, marketing is the difference-maker, and it’s too deep a skill to leave to amateurs.\n\nAn exception is inherently viral ideas, especially one-to-many virality, where normal use of your product reaches new users, not “word-of-mouth” viral that requires users to advocate you. With inherent virality, a barely adequate product might suffice, though even then marketing should accelerate growth. Next time we’ll raise enough to hire a marketing expert early.\n\n6. Control and calculate your user acquisition costs. We initially conceived of marketing as a wildly creative exercise: filming viral videos, launching clever campaigns, pitching media players. That’s partly true, but the best marketing is controlled and calculated. If you know exactly how much it costs to acquire a user and you control the entire process, you then know how much capital and revenue you need, reducing your marketing plan from fuzzy guesswork to a clean formula.\n\nUntil you find a marketing expert, a place to start is the AdWords keyword tool, which shows you how many people Google for certain words, and the Traffic Estimator, which shows the rough cost of buying keyword ads on Google.com. Yahoo has similar tools. The ideal terms have a decent number of monthly searches (10,000+), low number of competing advertisers (3 or less), and strong relevance to your site.\n\nFor example, “game TV shows” has 12,100 monthly searches with 7 currently competing ads, while “2008 game show” has 14,800 monthly searches with only 1 ad. The relevance of these searchers is roughly the same so the latter is a better chance to acquire users cheaply. Your first users are the most expensive and can cost $10-20/user, but the cost should decline as your brand and word-of-mouth grows. The promised land is when you convert and monetize well enough to literally buy users.\n\nOther tactics to control and calculate include A/B testing, tracking sign-up and purchase conversion, and creating landing pages to drive SEO and track different campaigns; look at the bottom of Mint.com for a good example. For fuzzier marketing tactics like blogs and press, knowing the time you spend on each, the value of your time, and your break-even acquisition cost will help you calculate efforts that aren’t cost-effective. A data-driven culture is a well-oiled machine.\n\nI would also avoid money pits like PR firms, CPM ads, billboards, and TV/radio spots. We wasted $5,000 on a promoter who produced almost no buzz then said it takes a few $5,000 sprees to see results. Unless you control and calculate, these methods are mainly for marketers bad at math.\n\n7. Form partner relationships early, even if informal. Two downsides of partnerships are that they’re slow and you lack control, but they do have advantages beyond driving users and revenues. Partners can make connections, teach you the market, flag potential competitors, and become potential acquirers. Believing we had little leverage, we de-prioritized several partners who later said they might have bought us if we had built a stronger relationship and proven our value.\n\nWe learned that you can build informal relationships with little time. Meeting decision-makers early, keeping them in the loop, and being genuinely helpful builds familiarity and goodwill, which reaps some of the above benefits without the pain of hashing out a deal. It takes foresight and maintenance, but dating before getting married also makes it more likely the partnership will be healthy.\n\n8. Plan costs conservatively and err on the side of raising too much. While I’m doubtful more funding would have made the difference in our case, it would have let us try more tactics. We did a detailed financial plan, but I underestimated costs to fully expand. Next time we’ll better know real costs and likely bite the dilution bullet to raise a bit more than needed. This also prevents spending a lot of time raising extra rounds.\n\nGlenn Kelman from Redfin has some nice common costs. To refine, ask a successful entrepreneur for a previous financial plan to vet yours. I disagree with folks who think financial plans are a waste. They are indeed wrong the moment you start, but they help you estimate headcount, fundraising, break-even, and whether your business model is insane.\n\n9. The key to negotiating is having options. The single most useful piece of advice I got was from Bill Trenchard, founder of LiveOps: “Always have options.”\n\nAlmost everything you do as a founder/CEO involves negotiation: closing investors, hiring employees, signing partners, paying vendors, even advocating features internally. The best way to persuade your counter-parties is signaling — implicitly or explicitly — that you have viable options (also called BATNAs). Just two can be enough. Being at the mercy of a lone option is a recipe for getting screwed.\n\nThe more humans are involved, the more negotiable the system. If you hear a human say “that’s our policy” without much reason, bells should go off that you have room to negotiate if you reach the right decision-maker. Be nice, ask to speak with a manager, and politely signal that your endurance will outpace their patience. Higher-ups know the value of time and make exceptions accordingly. Sales managers are especially persuadable because they’re social and work on commission.\n\nThat so much of a founder’s job involves negotiation also means work can get adversarial and lonely. It really helps to have a group of friends you don’t have to haggle with.\n\n10. Knowing isn’t enough. Most frustrating is that Dev and I knew much of the above going in. We’ve been doing this for 10 years each across three startups (though this is our first significant one at the helm). I could have sent this to myself two years ago and probably would have thought what many of you are thinking: this is nothing new.\n\nWhat’s new for me is painfully experiencing the gap between knowing and doing. Advice is thrown liberally around the Valley, but like a surgeon who has studied but never practiced, I think it takes a lot of hands-on experience to learn intricacies and exceptions. I think advisers should more often say, “You probably won’t get what I’m saying until you screw it up.” Expertise takes time, and pithiness comes with a cost.\n\nPlenty of useful advice conflicts for this reason: Know Your Customer vs. Build For Yourself, Don’t Raise Too Much vs. Don’t Raise Too Little. The better answer to these questions is It Depends. Advice isn’t like code that’s easily executed, but like map coordinates that require skill and context. My hope is that our experience brings us (and you) a little closer to that.\n\nMark Goldenson lives in Palo Alto, Calif. He is launching an innovative web venture in health care."}