{"title":"Bitpass croaks — is this the end of micropayments?","favicon":"http://venturebeat.com/wp-content/themes/vbnews/img/favicon.ico","description":"Bitpass, the Menlo Park start-up that gave people a way to make micropayments online, has died.","lang":"en","canonicalLink":"http://venturebeat.com/2007/01/19/bitpass-croaks-is-this-the-end-of-micropayments/","tags":["View more","\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t"],"image":null,"videos":[],"text":"Bitpass, the Menlo Park start-up that gave people a way to make micropayments online, has died.\n\nMicropayments are typically payments of between one cent and a dollar — used for things like digital content, such as downloadable music or PDFs.\n\nBitpass sent out an email this afternoon to users saying it was closing Jan 26 (see below). Online payments have become more competitive over recent months, since Google joined the fray with Google Checkout, and began offering its service for free.\n\nPerhaps Google’s homepage promotion of Checkout was the last straw — making Bitpass the latest Google road-kill. Just three months ago, Bitpass’ chief executive said he was hoping to ally with Google, to have Bitpass’ micropayment feature integrated into Google Checkout.\n\nBitpass was already showing odd signs two years ago, when the CEO disappeared and nobody ever responded to our request for information about what happened. And numerous other micropayments companies struggled or went belly-up, including First Virtual, Cybercoin, Millicent, Digicash and Internet Dollar. Peppercoin is still standing.\n\nSee our recent coverage of BitPass here.  BitPass has taken two rounds of funding, the latest in the fall of 2004, when it raised $11.75 million from Worldview Technology Partners, Steamboat Ventures (the venture capital arm of the Walt Disney Co.), RRE Ventures and others. Prior to that, it had raised $1.5 million from Garage Technology Ventures, Cardinal Venture Capital, Amicus Capital and Constantine Partners.\n\nWe want to thank you for your past business, however due to circumstances beyond our control, we are discontinuing our operations.\n\nWe have partnered with Digital River to provide operational support during the period prior to shut down.  As of today, January 19, 2007, all Bitpass Buyers with US dollar denominated accounts are being notified that they will have seven (7) days to spend any amounts that currently exist in their Bitpass Account.\n\nDuring this seven day period, US Buyers will not be able to further fund their account.\n\nOn  January 26, all US Bitpass Buyer accounts will be closed and Digital River will begin the process of refunding all unspent monies to the accountholder.\n\nAll account records and materials will be retained for 60 days and available upon request.\n\nAgain we would like to thank you for your business and support."}