{"title":"Argyle Social is no longer in fashion","favicon":"http://venturebeat.com/wp-content/themes/vbnews/img/favicon.ico","description":"“It’s not what we wanted to do, but in the long term, we could see that we were going to have a hard time continuing to stay competitive with the feature set of some of our competitors.”","lang":"en","canonicalLink":"http://venturebeat.com/2014/04/16/argyle-social-is-no-longer-in-fashion-startup-shuts-down-exclusive/","tags":["Adam Covati","Argyle Social","editor's pick","exclusive","Social Media","social media marketing","Trak Lord"],"image":"http://i2.wp.com/venturebeat.com/wp-content/uploads/2014/04/argyle-social-shutdown.jpg?fit=780%2C9999","videos":[],"text":"Argyle Social is no longer in fashion: Startup shuts down (exclusive)\n\nMore than three-quarters of marketers do email marketing exclusively with marketing automation platforms. Find out why in our Marketing Automation webinar on June 18.\n\nArgyle may always be in style, but the app is about to die.\n\nSocial media marketing startup Argyle Social is permanently closing its doors, the four-year-old company told customers in an apologetic email today. The Durham, N.C.-based firm said it’ll shutter its social media management service May 31.\n\nDespite its product — the Argyle customer we spoke to raved about its “awesome” dashboard and “excellent” scheduling features — Argyle Social couldn’t compete with marketing giants like Radian6, Adobe, and HootSuite.\n\n“At the end of the day, it’s a very tough industry,” Adam Covati, the founder and CEO of Argyle, told VentureBeat.\n\n“It’s not what we wanted to do, but in the long-term, we could see that we were going to have a hard time continuing to stay competitive with the feature set of some of our competitors.”\n\nKeeping up with Facebook and Twitter is tough for small startups, said Covati. Every time the social networks change their APIs, that’s a lot of development work for third-party social media tools.\n\nArgyle tried to distinguish itself by integrating with marketing automation systems like Marketo and Pardot, but those bets didn’t ultimately pay off. Meanwhile, its competitors became heavily capitalized and bulked up their sales and marketing departments.\n\n“We’re a very small company based in a great area, but it’s definitely not [Silicon] Valley,” said Covati. “It’s a double-edged sword, because in the Valley, you’d be paying twice as much for developers and land. But out there, there’s a different attitude toward raising money.”\n\nCovati says he looked hard for a place to land Argyle but couldn’t find a buyer.\n\n“We went and talked to a number of likely partners, but we couldn’t find a deal that made sense for both sides,” he told VentureBeat.\n\nThe company will keep links generated through its service active for “as long as feasibly possible,” but it ultimately expects its URL redirectors to expire.\n\n“On the positive side, most of [our customers’] legacy information resides in the social networks,” said Covati.\n\nArgyle’s shutdown came as a surprise to Metaio, an augmented-reality company that uses Argyle’s service to manage its social media channels.\n\n“It’s been invaluable to us for the past couple of years — extremely useful, with a really manageable price point — so it’s kind of a shock to see them shut down their services,” Trak Lord, Metaio’s marketing and media relations manager, told VentureBeat.\n\n“We’re in the Bay Area, so I read about that stuff happening all the time, but you never really expect it happen to a service that you use all the time — especially one that brings so much value to your business.”\n\nOther folks, like Citrix’s Dan London, are airing their thoughts on Twitter.\n\nI’ll miss @argylesocial It was the BEST social tool and the only one that tracked conversions and revenue. #ROI\n\n“It’s kind of funny. You send out a shutdown notice, and you get an outpouring of support from people you haven’t heard from in years,” said Covati.\n\n“I think that it’s important that we celebrate the failures as well as the positive. We employed as many as 25 people at times, and we served a lot of marketers. We were in business for over four years. … I’m just excited we were able to do this.”\n\nCovati’s immediate focus going forward is wrapping up Argyle, but in the long term, he envisions leading another startup in Durham.\n\n“I hope to do something like this at another point in the future in this area, because I think it’s a fantastic place to do it,” he said.\n\nArgyle Social had raised $1.6 million in financing: a $325,000 seed round in October 2010 and a $1.2 million round in September 2011. Madison River Ventures led the latter funding round.\n\nWe’ve included the complete email Argyle sent to its customers below.\n\nIt is with no sense of happiness that I write to you today. After 4 years, Argyle Social is shutting down our service – effective 5/31/2014. We founded Argyle with a mission to help social media marketers achieve greatness by providing them with the tools they sorely needed to manage their social world. We’re honored to have helped thousands of marketers do just that since we started out.\n\nWe are grateful to our investors, advisors, and friends for helping us on this journey. We are most thankful for our customers, many of whom have invested in our future, advised us on where to go with Argyle, and also become our friends along the way. You have been fantastic, and we loved working with you.\n\nWe’re sorry that this is where our adventure has ended, but we know it isn’t the end for you. We wish you luck with your social media marketing journey, wherever it takes you next.\n\nThanks for being an Argyle customer and friend,\n\nWhy is this happening?\n\nWe made a good go of it, for sure. But today’s social media management space is becoming more and more dominated by large companies with very large marketing budgets and sales teams. On top of this increased competition is the high cost of maintaining integrations with the ever-changing social media networks. It’s a lot for a small team. We’ve tried a number of things to make it work, but in the end it looks like it’s not in the cards.\n\nAre you sure you can’t find someone else to run Argyle?\n\nYou have to trust us, if there were a way to keep Argyle running we would have done that instead. But it’s a complex system that requires operations folks, developers, and support to keep running on a daily basis. We’ve worked very hard trying to find a place to land Argyle. But after all that, you’re still receiving this email. Sorry, truly.\n\nWhen is the last day? Can we get an extension?\n\nWe’re sorry, we don’t want to be shutting Argyle down either, but given our current situation, we cannot provide an extension of service beyond 5/31/2014.\n\nWhat happens when the system is shutdown?\n\nOn May 31, 2014 the servers that run the website and backend systems will be terminated. This includes web application servers as well as database servers and the analytics processing infrastructure.\n\nWill our Argyle links still work?\n\nYour short links will not become inactive immediately. We will keep the url redirectors up for as long as is feasibly possible. While we have no guaranteed SLA on the redirectors, we are hoping to keep them up for a reasonable timeframe. We are investigating possible option to make this period as long as possible. However, there is no ability for you to maintain them after that.\n\nFor customers with custom domains, your links will also still be active for a little while after the shutdown. However you may be able to host them yourself after the shutdown. We are offering a report that has all your short urls listed within it. This report contains the short url and the destination url associated with it. You can request this report from the Custom Domains page (http://app.argylesocial.com/settings/showNewDomain) – you should see a notice at the top of the page that tells you if you are using a custom domain or not and direct you on how to download that report.\n\nYou will need to work with your IT folks if you want to host these urls yourself. It will most likely require that a server be setup and custom code be created. We are sorry, but we can’t provide any further assistance on this than what is provided here.\n\nVentureBeat’s VB Insight team is studying marketing and personalization...\n\nChime in here, and we’ll share the results."}