{"title":"A Postmortem Analysis of Standout Jobs","favicon":"http://instigator.wpengine.netdna-cdn.com/wp-content/plugins/genesis-favicon-uploader/favicons/favicon.ico","lang":"en","canonicalLink":"http://www.instigatorblog.com/postmortem-analysis-of-standout-jobs/2010/10/05/","tags":[],"image":null,"videos":[],"text":"It’s been a number of months since I announced that we sold Standout Jobs. In that time I’ve gone through a myriad of emotions and cyclical arguments in my head about the entire process of starting Standout Jobs, running it and selling it. I’ve read a number of great (and heartfelt) postmortems of late, and then read Eric Ries’ blog post: Stop lying on stage. I appreciate Eric’s point-of-view, and I’ve had similar experiences watching people on stage, publicly addressing an audience and omitting key points of their “startup’s story”. Investors do it too. Everyone does it (I think it’s human nature.) But there’s a big difference between “on the record” and “off the record”. People should be smart enough to know the difference. And there are some bridges not worth burning (at least completely.) Even more importantly, there’s just some things that aren’t meant for public consumption. Perhaps in those cases the stories (or “legends!”) shouldn’t be promoted whatsoever, because they’re only half-truths…\n\nOne thing is certain: Success is never as easy as it seems when someone else talks about it, and failure is rarely as dismal as it seems either.\n\n“Overnight successes” are generally bullshit. No road to startup success is without big, massive road bumps. It’s called a rollercoaster for a reason. On the flip side, failure is rarely so crippling a blow that entrepreneurs can’t pick up and keep going. Everyone fails. “Out of the ashes…” and all that.\n\nSo in reflecting on all of this (and more), I’ve decided to write the Standout Jobs postmortem. And the only way to do so effectively, publicly and hopefully with the end result of helping other entrepreneurs, is to reflect on my own performance and efforts.\n\nAlthough we did exit Standout Jobs it was not a financial success. In fact, personally, I have less money now than when I started the company. Initially (I can’t remember for how long) I wasn’t paying myself. When we raised financing, I paid myself a fair salary, but then cut it down when the company was struggling. At the end, I wasn’t paying myself for quite awhile as well. Such is life when you decide to start a company. High risk = high reward (or not!)\n\nI am pleased (as I indicated when I announced the exit) that we found a buyer for Standout Jobs. It was a great and difficult experience to go through. It was a true learning experience. The technology we built was solid, and I do honestly hope that the acquirer is able to leverage it with great success. You can certainly see in the marketplace today that a number of players have been working on enhancing employer profiles, increasing employer branding and social recruiting opportunities for employers. We were onto something.\n\nOur timing was terrible. We launched the paying version of our application in the fall of 2008 about 5 minutes before the economy collapsed. Very few companies were hiring. I got feedback on sales calls like this: “That’s a great product, really love it, but we won’t be hiring for another 18 months or so. You have anything to help us fire people?”\n\nWe knew the economy was heading south, but we had no idea how bad it would be and how long it would last. And we failed to react quickly and aggressively enough. In fact, I think most failures of CEOs and startup founders fall under the category of, “didn’t react quickly and aggressively enough.” I’d say it’s fairly rare that a startup overreacts to something and changes too radically. In 99.9% of cases it’s the opposite: startups don’t change fast enough. But making aggressive, fast changes takes bold, bold leaders.\n\nSimply put, I wasn’t bold enough. It took too long for me to sound the alarms loud enough. There are a number of reasons for this, and I’d say they’re quite common. For starters, I’m not a loudmouthed egomaniac. I don’t think you have to be, but you do need a big ego to survive. I have a healthy enough ego (most days!) but it did take a beating during the course of Standout Jobs. It’s not that hard to get to a point where you believe that everyone else knows better than you do. And having to tell your investors, Board of Directors, employees, family, etc. that what you told them would work isn’t working is just plain hard.\n\nI absolutely believe that taking a more analytical approach – driven by Customer Development and Lean Startup principles – can bolster your sagging ego and help you make rational, honest and difficult decisions. With Standout Jobs, I wasn’t rigorous enough in this process. I won’t make that mistake again.\n\nI didn’t have a strong enough understanding of the HR / Recruitment market going in. I’ve written about this before and I see countless entrepreneurs make the same mistake. They look at a market objectively and think, “I can fix that!” only to realize when they get neck-deep into it that there are a whole bunch of issues they didn’t understand.\n\nI just didn’t do enough homework. And doing homework while you’re writing the test as fast as you can is pretty damn hard.\n\nHaving said that, I do think that I did a good job pushing my way into the industry leadership, networking, communicating Standout’s vision and catching a good sense of where the market was heading. And in some markets, brand awareness and brand building amongst the evangelists and leaders is critical to gaining exposure and generating buzz. It can provide a false sense of success, which is something to be wary about, but it can also add significant value.\n\nThe lack of market understanding ultimately meant that we couldn’t match the right product to the right market at the right price.\n\nI had an exceptionally strong team. Best I’ve ever worked with. But in reality we didn’t code and launch fast enough. We didn’t get product into customers’ hands fast enough. We were fast, but next time I’ll move faster, and iterate much more frequently. Of course that’s easy to say, but I think a lot of developers aren’t as comfortable as they need to be with this strategy. The fact is that having a specification and building to that specification is a lot easier for a developer; constantly changing requirements, moving things around, cutting features, adding stuff, circling back with feedback, etc. makes a developer’s job harder. More rewarding. But harder.\n\nIn the future I’ll focus a lot more on a Minimum Viable Product (MVP) and getting it into the hands of customers as early as possible. And even more importantly, I’ll solicit real, hard feedback from them. With Standout Jobs, we did things in a slightly incorrect order, which distorted our view of reality.\n\nIf you find yourself in an argument with a market, you’re very likely to lose. As we got Standout Jobs into the hands of customers we saw a few troubling issues. People weren’t using it as actively as we had expected. People were still following the same bad habits they had before even though we provided them a “better way.” Ultimately changing behavior is extremely hard. It’s possible, but you need to be very, very creative about it.\n\nI didn’t realize just how much of a behavior change we were asking people to make. We did find ways of circumventing people’s unwillingness to change, but we never committed to those strategies fully, in part because they didn’t work quickly enough, and in part because we were stubborn.\n\nI was able to simplify Standout’s value proposition to the point where it was clear, but that’s not always enough. Part of the problem was that our value proposition lacked immediacy: “Invest in your employer brand and over time you’ll hire better fits into your company at a faster rate.” The problem is with “invest in your employer brand” – too few people truly have time for that (although they should!)\n\nI didn’t make a strong enough case for tying the value proposition to something immediate that HR could sell internally to their bosses. It’s important to note that “selling a value proposition” and “delivering actual value” are two different things. I remember a sales call once with two people in an HR department. This was the second call. We were doing a web demo. As I was presenting, the new person on the call said, “We already have something like this. It’s [name not included here]. It does what you’re talking about.” I was surprised that the first person I had met didn’t bring this up since the other product was somewhat competitive. It turns out that neither of the two people even knew the URL of the site that the competitor had launched for them. The competitor had managed to sell their solution to this company, and the company didn’t even know where that solution was online. That was surprising and demoralizing. The competitor had managed to “sell their value proposition” extremely well, but whether they were delivering on value was a different story. Please note: I’m not arguing that you should sell a good value proposition and not deliver actual value, but you can’t get to delivering actual value if you can’t sell a good value proposition.\n\nValue propositions need to be super clear, straightforward and deliver (or at least claim to deliver!) immediate results. Tying value propositions to making more money is best. Saving money is second best. Everything else is tertiary…\n\nI raised too much money, too early for Standout Jobs (~$1.8M). We didn’t have the validation needed to justify raising the money we did. Part of the reason for this is that the founding team couldn’t build an MVP on its own. That was a mistake. If the founding team can’t put out product on its own (or with a small amount of external help from freelancers) they shouldn’t be founding a startup. We could have brought on additional co-founders, who would have been compensated primarily with equity versus cash, but we didn’t.\n\nI had never raised venture capital before. Raising the money felt like winning. It felt like all (or most of) the justification we needed. It set us on a path of building a bigger product than we should have, and committing (falsely) to our own assumptions of what would work, without fully testing them.\n\nHaving said that, I also realized at some point in the process – especially as a result of the recession – that in order to survive we would have needed a lot more money and a lot more time. I estimated about $5 million and 3 more years. That wasn’t going to happen. But as we got deeper into the market we recognized that to punch a real hole in it would require lots and lots of capital. So while we raised too much, too early, we also weren’t in a position to raise a lot more, later when it would have made more sense.\n\nAlthough I did raise too much money too early, it also took too long. The money was raised in two major tranches, but we also left room for key angel investors to come in at various stages. The entire process took 9-10 months at least. As a result, I spent too much time raising money, which was a complete distraction from running the business. That’s the double-edged sword of fundraising — you have to do it (and it’s hard) + it’s distracting and in some ways detrimental to running your startup. I saw raising money as a form of validation, and so I was willing to invest in it. But it’s really only validation that someone will write you a check; not that you’ve got a strong, scalable business. The challenge with raising money is that once you start, it’s hard to stop. The money is used to grow your company, which often results in more expenses. More expenses, without revenue to support them, means going back to raise more money. So you end up on this conveyor belt of raising money, which is difficult to get off of.\n\nI had a great group of investors. This included Montreal-based venture firms and angel investors in Montreal, New York and elsewhere. Unfortunately I didn’t manage and leverage my investors enough. From a leverage perspective, I didn’t do enough to extract value from my investors. I didn’t engage them enough for introductions to potential partners and customers. I didn’t follow through as frequently as I should have.\n\nI think the key to successfully managing and leveraging investors is consistency. You need to be consistently knocking on their door, asking for help with specific issues, and providing them the ammunition they need to promote your startup. Investors are busy people. Venture capitalists are managing portfolios and chasing new deals. Angel investors are doing the same, and often times have their own startups they’re working on. You need to earn mindshare and attention.\n\nOn the flip side, you can’t listen to everything your investors tell you. They’re not infallible. If you disagree with them you need to step up and say so. It’s not easy, especially for first-time entrepreneurs, but it’s critical. The relationship between investor and entrepreneur isn’t parent-child. It’s partner-partner.\n\nWhen we were getting ready to launch the paying version of Standout Jobs, we decided to pursue a channel partner strategy. This meant providing partners with a white label version of the Standout Jobs platform so they could resell it. In principle it made a lot of sense: they had existing customers, market share, mindshare and experience selling into the HR market. And we had a lot of interest. But looking back it was too early for us to be seeking partners. We didn’t know ourselves yet how to sell the product, to who and for how much. Without that information we didn’t provide channel partners with enough of a “sale-in-a-box” that they could execute on.\n\nIn some ways we tried to offload responsibility of selling our product to our channel partners. It worked, to a degree, but not well enough. And when the recession hit, everyone in the HR / Recruitment space got clobbered. Our partners recoiled and focused on their core, and we were left holding the bag. I still believe there’s immense value in leveraging channels for sales, but only after you know how to sell your product effectively; the channels then provide scale.\n\nAt some point in mid-2009 it was very clear that Standout Jobs was in trouble. The recession was still holding a death grip on the economy, we were running out of cash and traction was middling at best. It was a difficult time. I don’t remember the exact order of events, but we decided to pivot in a big way. This was an “Odeo into Twitter” moment, where we were prepared to shutdown Standout Jobs as we (and everyone) knew it, and resurface with something completely different (although still relevant and emergent from our experience.) It was an exciting point and truly re-energized the founders and the team. We had some rough ideas, brainstormed furiously and put together a super-basic prototype of what we envisioned. It was a B2C play around identity, referrals and recommendations. There are a number of startups now that are playing in that space.\n\nWe pitched the concept to our Board of Directors but a decision was made to “stay the course.” I have no clue if the new idea would have generated any traction, but I should have fought harder for it. We certainly didn’t have much to lose at that point. I don’t think many startups really go through this kind of massive, transformational change. It’s scary. And inasmuch as people talk about pivoting (although this was more like a “scrap and restart completely new”), I don’t know that most entrepreneurs and investors really have the stomach for it.\n\nI also tried a few smaller pivots. I relaunched the website and repackaged the product into a few different offerings. Also added a service layer on top of the product. The goal was to take what we had and try to find a market. I also wanted to simplify things and focus on lead generation as much as possible. These smaller pivots and market adjustments actually generated positive response, but I didn’t have the time or resources to execute on them aggressively enough.\n\nI’m not a fan of bullshit or politics, but unfortunately these are both realities when running a startup – particularly one that’s not performing well. You have to be prepared for it. I’d recommend having one or two very strong outside advisors – experienced entrepreneurs that have “been there, done that” – to lean on when you get to this stage.\n\nIn October, 2009 we let go the bulk of the team. We held on for as long as we could because we were engaged with potential acquirers and felt that the team would add value in an acquisition. And there were a couple of acquirers where I think this was legitimately true. Unfortunately, they didn’t see it that way! Eventually I made the decision to let the team go. It’s a shitty experience, but not as bad as you might think.\n\nThroughout the acquisition process we worked to create value. The team. Our partners. The technology. Us (the founders.) It’s a very similar experience to raising early money; often you don’t have a lot of proof of anything, but you try and tell a good story. And fundamentally, I believed at the time (and still do today) that we were doing something right in terms of where recruitment marketing and branding was headed. The package wasn’t quite there, but combined with other pieces of the proverbial puzzle and I saw the potential for strong value to emerge.\n\nWith all of the mistakes I made and all the difficulties faced by Standout Jobs, I’m still pleased that we (and I) persevered. From the fall of 2009 until the acquisition closed, Standout Jobs was really just me looking to get a deal done. Sort of a “last man standing Ultimately it was too little, too late, but I’m still glad I went through it.\n\nHaving said that, I think founders have to be very cognizant of their startup’s lifecycle. When it’s time, put a bullet in it and move on. Whenever I had the “should we kill it?” conversation with my founders, investors or Board of Directors I always felt that I could extract more value. And I wanted to try. The experience was worthwhile.\n\nI’m no longer involved with Standout Jobs. The acquirer has been working for some time on the technology and I look forward to future announcements from them. I’m still actively looking at the HR / Recruitment space — frankly, I feel like there’s unfinished business there. A lot of entrepreneurs have reached out to solicit my feedback on their HR / Recruitment startups. I’d encourage you to keep doing so. I’m looking for the winners in there; I’ve gotta believe they’re somewhere!\n\nI’ve now moved on to Year One Labs, an early stage seed accelerator based in Montreal. So I’m (sort of) on the other side of the table, although I can’t ever really picture myself as an investor. I see myself more like a guy that wants to help other entrepreneurs build successful businesses. Not because I’ve sold a company for $100M yet, but because I’ve been through a lot, seen a lot, and like to roll up my sleeves and get dirty. And at some point in the future I will found another startup (or two, or three, or four.) Once you start, it’s hard to stop. Even with the ups and downs, bumps and bruises. I’d rather not repeat the same experience I had with Standout Jobs (at least not in its entirety), but I’d take this life and these experiences over a “regular job” any day."}