{"title":"7 Things I Learned from Startup Failure","description":"My former company, Intellibank, was sort of like Dropbox done wrong. You’ve probably never heard of Intellibank, because it came and went like so many startups do, but it was a promising company with smart people. We raised money and could have been the next big thing, but it never happened. Why?Though Intellibank was not successful, I don’t view my time there as wasted. From the mistakes we made, I learned what not to do — and from there, I’ve arrived at some essential truths that can lead to startup success.1. It’s all about the marketEven the best t","lang":"en","canonicalLink":"https://www.linkedin.com/pulse/20130923123247-758147-7-things-i-learned-from-startup-failure","tags":[],"image":"http://m.c.lnkd.licdn.com/mpr/mpr/p/3/005/014/247/137edd6.jpg","videos":[],"text":"My former company, Intellibank, was sort of like Dropbox done wrong. You’ve probably never heard of Intellibank, because it came and went like so many startups do, but it was a promising company with smart people. We raised money and could have been the next big thing, but it never happened. Why?\n\nThough Intellibank was not successful, I don’t view my time there as wasted. From the mistakes we made, I learned what not to do — and from there, I’ve arrived at some essential truths that can lead to startup success.\n\n1. It’s all about the market\n\nEven the best team with the best product will fail if its market does not exist. Venture capitalist Marc Andreessen says that product-market fit (a term he is said to have coined) is one of the most important factors he considers when evaluating startups.\n\nAt Intellibank, we did not achieve product-market fit. Every customer was asking for something different and we gave it to them. We had six markets with 40 different types of customers, and in hindsight, we should have developed just one product. We couldn’t be all things to all people — and by failing to declare our major, we created a world of chaos for our sales, product and marketing teams.\n\nEven if you do have product-market fit, you will not get very far if the market is not big enough. To determine whether you fall into that category, ask yourself if the market you’re targeting is big enough to allow for pervasive adoption of your product and exponential growth.\n\n2. Validate with your customers, not your investors\n\nA common mistake among entrepreneurs is seeking validation of their ideas and decisions from investors. The most important people any company should seek validation from are their customers. That’s right, your customers matter more than your investors — and any good investor would agree.\n\nDo not ignore yellow lights coming from your early adopters, because their activity indicates a momentum shift. Spend time understanding all aspects of the customer value proposition. I once heard Guy Kawasaki talk about his 10X rule — in order for people to switch and buy your new thing, your product doesn’t need to be perfect, it just needs to be 10X better than the alternative. Think about the 10X rule and ask yourself: why should your customer buy your product? How does your product fit into the rest of his world? What influences their opinion of the product’s value? What is your product displacing — all products displace something — and why should your customer risk making that switch? You need to be as knowledgeable about your customer and their needs as you are conversant with your own product.\n\nFocus and simplicity are often more difficult to achieve than building features on top of features on top of features. As a result, too many startups are unfocused. The time required to trim back an idea is not insignificant — said best by Mark Twain: “If I had more time, I would have written a shorter letter.”\n\nIn order to succeed, a startup needs to do one or two things exceptionally well; some of the greatest products today don’t have a million bells and whistles, but they solve one concrete problem brilliantly. I’m thinking of companies like Salesforce.com in the early days. They entered the market with good products, and over time they iterated, grew and added features — but not before they owned essentially the entire market.\n\nBy keeping it simple, measurable and achievable you’ll be well on your way. Everyone at your company should be able to articulate the goal of your business, enabling a dogged, unyielding focus on that goal throughout the organization.\n\nYour goal should not be meeting your customers’ expectations; it should be exceeding them. Truly great and memorable products surprise and delight their customers, so don’t be afraid to spend the time and money to build an exceptional product. But don’t let this pursuit inflate your product’s ego, if you will — making promises you cannot keep will leave you surrounded by disappointed customers, investors and employees.\n\nI cannot emphasize how important it is in the long run to over-deliver to your customers. For example, Fab does not have to give every customer a $5 gift card with every order, but doing so wins them a lot of brand loyalty and even word-of-mouth marketing.\n\n5. Figure out streamlined metrics to measure your progress\n\nI once had a board member tell me that we were over-measured and under-prioritized. It stung. A lot. But it also made quite an impression. As a business leader you need to figure out the metric that matters most for your company and understand that the more you measure, the less prioritized you’ll be. Don’t fall into the trap of trying to measure everything. What I’ve learned is that in the early days, what matters most is having customers who love and use your product. Figure out the one or two best measures to determine this.\n\n6. Pivoting is okay… but it is not a business strategy\n\nI learned this one the hard way. At Intellibank, we would change our pitch deck based on what we thought would get us traction with investors. In one particular meeting, I was in the middle of explaining our revenue model, when a potential investor interrupted me and asked, “Can you tell me what your product actually does?” We were pivoting so often for different types of customers that we completely lost the big picture. You must be agile, but not to the point of an identity crisis; you have to look beyond your four walls and convey the big picture.\n\nCustomers come to restaurants for a great overall dining experience, but the food is the baseline. They come back if the service and experience exceed their expectations. It’s the same with any business—the product is table stakes and it’s the experience that brings people back.\n\nTake a look at Hotel Tonight. It’s only accessible from a mobile phone and while there have been several times mid-flight when I’ve wanted to use the app to book my hotel in my destination city, I can’t and so I wait until landing. Using their service on my laptop would be nice, but the experience is so elegant and over-delivers every time, so I prefer to book my hotels there.\n\nWith all of these learnings in mind, think about the product you’re selling and think about where you see it going. Now take a step back and ask yourself the most important question of all—when your customers are using the product how do they feel, and will that feeling keep them coming back?\n\nIf you liked this post, please share it and click the FOLLOW button above to get more!\n\nGary Swart is the CEO of oDesk, the world’s largest online workplace."}