{"title":"How to Learn From Your Mistakes in a Tech Startup in Order to Succeed","favicon":"http://cdn2-b.examiner.com/sites/all/themes/greyhound/favicon.ico","description":"It was the fall of 2010, and the movie I had written, produced, and directed was finally finished and submitted to film festivals.","keywords":"Small Business, Tech, Startup, Founder, Silicon Valley, Philadelphia","lang":"en","canonicalLink":"http://www.examiner.com/article/how-to-learn-from-your-mistakes-a-tech-startup-order-to-succeed","tags":["Strange News","Startup","Founder","Silicon Valley","Philadelphia","startup","Reality TV","Pop Culture","Young Adult Fiction","Movie Reviews","Comic Books","Music Festivals","Extreme Weather","Gun Control","Same-Sex Marriage","Global Warming","Life","Education","Leisure","Recipes","Luxury Travel","Makeup","Camping","Recreation","Tablets","iPhone","Google Glass","Wearable Tech","Xbox One","Playstation 4","Facebook","Anonymous","Bitcoin","Google","Twitter"],"image":"http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/5f/07/5f07b81d39bf4be64a7bf96b44ebfac3.png?itok=35ksiRnA","videos":[],"text":"It was the fall of 2010, and the movie I had written, produced, and directed was finally finished and submitted to film festivals. It was an exhausting journey (creating a feature-length film), and I found myself needing a break. Being a technology guy at my core, I felt inclined to take a step back from film and take a step forward into the realm of technology. Roughly 6 years before creating my movie, I had an idea for a new website. But there were no such thing as smart phones, and my application would have been difficult to build as a website back then.\n\nOne of the actors from the movie called me one day to see how things were going with the film festivals, and then asked me what I was going to do next. I told him I was thinking about building a website and told him about my idea. Since smart phones were now prevalent, I thought it was a perfect opportunity to dive back into my old idea. He liked it and said he would partner up with me if I agreed to tweak the platform for a different audience. So after discussing our ideas on the phone for a couple of hours that day, we decided to partner up and do it together. This was the first time I cofounded a tech startup. During my one year in this company, I learned what not to do.\n\nThe first thing I learned, was how to choose a cofounder. The person I had chosen was an artist, plain and simple. He was not technologically savvy, had a little bit of business knowledge, but very little marketing or presentation skills. The first thing he made me do was go with him to a law firm to pay them a retainer, and get everything documented.  He had seen the movie “The Social Network” shortly before partnering with me, and said he didn't want the same thing to happen to us. Sadly, we didn't have anything to protect, no code, no designs, no platform, no team, nothing. Yet he still wanted us to spend thousands of dollars on lawyers to tell us what to do. Basically, he did not know how to run a company, and he wanted the lawyers to tell us how to do just that. Unfortunately, we argued a lot about this because I was a business owner for many years, and I did understand how to run a business, but he didn't feel confident enough that my skills were up to par.\n\nAs the technologically savvy partner, I was in charge of designing our platform, finding programmers, and creating the workflow document for our functionality.  I also designed our PowerPoint presentation, wrote a lot of our business plan, handled our marketing on social media sites, created a video to showcase our idea, and much more. I felt like I was doing 90% of the work, but only owned 50% of the company, and I didn’t like that at all.  All the while, we kept sending money to these lawyers for more and more documents, which in hindsight I realize we did not need at all. I kept asking myself, “Why am I doing all the work, AND paying lawyers all this money?”  I felt as though my partner should be paying the lawyers, while I did the work.  It was only fair.  But unfortunately, he did not value my skillset as much as others would in the future (as I have found out in the last 5 years).\n\nAnyway, we ended up outsourcing our original platform to a company in India to get built quickly, and for little money. While we did get some of the work done, we found ourselves spending a lot of money and not getting exactly what we wanted. I then tried to get programmers locally to help us with our idea, and while I did succeed in getting a couple of programmers, their productivity fizzled out when my partner and I could not secure funding.\n\nLuckily for me, my partner realized this lifestyle was not for him, and after one year of trying to get the company off the ground, he gracefully bowed out. I too, let go of the company altogether, and joined two friends to start another tech company. This time I took my lessons learned and brought them into the company. Unfortunately, this new company also did not work out because of cofounder disagreements (go figure).  But, after one year not only did we not spend a lot of money on lawyers, but we had a fully functional platform available to the public. This company, we did pitch to a lot of investors, but quickly were saturated by other competitors who started to surface every day. It seems as if we launched at the right time, but could not secure funding quick enough to keep up with competitors.  So again, we fizzled out and let go of the company, even though the website is still live and getting new users.\n\nNow in my current (and third) startup, I am in my second year.  I used all of the lessons of the past of what not to do, and what to do, how to choose cofounders, how to get programmers to join the team, how to properly execute legal documentation, and how to properly run a tech startup. As the saying goes, “Third time's a charm.”  I do see why they say that.\n\nHere is what I can say to anyone out there who wants to start a tech company of what NOT to do:\n\n* Don’t spend money on anything that you can do yourself\n\n* Don’t pitch to investors until you are either earning revenue, or have 1 million users.\n\n* Don’t pay employees with cash (they aren’t passionate then)\n\n* Don’t wait to release your first version until it’s perfect.  Release it when it is barely considered finished.  Get customer feedback before it’s too late.  (See MVP below)\n\n* Don’t be stubborn, be open-minded and embrace opinions\n\nAnd here is what I can say TO DO:\n\n* Do design your product before talking to programmers\n\n* Do learn how to build (code) an MVP (Minimum Viable Product) by yourself\n\n* Do release your MVP as a “Soft Launch” to get customer feedback from at least a few thousand users.\n\n* Do pick cofounders that have skills that you don’t have (and need)\n\n* Do find free legal help from local colleges\n\n* Do get interns from local colleges\n\n* Do pay employees with stock options (this incentivizes them)\n\n* Do listen to your employees and customers, use this information to make your product amazing.\n\nHopefully this article helps those of you who are just starting out. Or maybe it resonates with other tech founders out there who have been through the same thing.  Knowing when to let go of your startup is just as important as knowing when to push forward.  I started 3 tech startups in 3 years, and stuck with the third one because it showed potential.   I still run it full time and love every second of it.  It's exciting to say the least, but I would have never gotten here if I hadn't failed in the first two."}