{"title":"Tis the Season for a Tigerbow Post Mortem","favicon":"http://cdn.alleywatch.com/wp-content/uploads/2013/01/favicon.ico","lang":"en","canonicalLink":"http://www.alleywatch.com/2013/12/tis-the-season-for-a-tigerbow-post-mortem/","tags":[],"image":"http://cdn.alleywatch.com/wp-content/uploads/2013/12/Tis-the-Season-3.jpg","videos":[],"text":"AlleyTalk\n\nEvery holiday season, folks reach out to talk to me about the gifting market because of my first startup. It was called Tigerbow, and it let people send real gifts to email addresses (and Facebook profiles, Twitter accounts, mobile phones, etc.). I poured my heart and soul into it for 2-3 years, and it failed. Facebook’s (re)launch of Gifts and the holiday season got me thinking that I ought to finally do a post mortem. It’s been a few years and another startup, so forgive my memory, but here goes…Let me first dispense with some of the more obvious insights:Founders need to be full-time. If you’re not full-time, you’re not a founder. Until you are. (Duh.)You need full-time tech talent. You can outsource some stuff, but you’re going to rebuild it. Learn to build a product, code a little or find a tech co-founder. (Duh again.)Market timing is critical. We tried raising money for our company during the financial crisis of 2007-08. Needless to say, we were running up against stiff headwinds. (Duh?)Execution is way more critical. I cannot attribute our failure to market conditions. We were unable to execute on a strategy to drive early traction. (Duhhhh.)Don’t raise money from people who don’t invest in startups. We raised a (comparatively) small amount of money from friends and family. For the most part they were very supportive, but there were exceptions. Aside from the fact that we got little (non-monetary) value added from these investors, people who are unfamiliar with investing in startups and the risks and challenges of building a company will drive you bananas. (Tempting, but don’t / duh.)Too early is wrong. After Facebook’s acquisition of Karma and subsequent relaunch of its new Gifts product, a handful of people told me how “smart” and “early” we were with Tigerbow. But too early is wrong. Early / good timing plus building great products and solid execution are right. (Some people will think you’re smart, but who cares. Duh.)And now some more things we learned that were a bit more specific to Tigerbow, ecommerce, gifting, etc….My Awesome Math. (It’s awesome because I made it up.)The gifting market is indeed large. We estimated that more than 20 percent of merchandise purchased was with the intent to give that merchandise to someone else (i.e., a gift). That estimate was predicated on the idea that online retailers see 40 percent of sales in the fourth quarter (so about a 20 percent bump compared to other quarters). Assuming that entire bump is holiday gifting and that there is no additional gifting during the year (wanna know what the biggest gifting event each year is? hint: it’s birthdays) gives you 20 percent. Yeah, it’s kind of a BS analysis, but it sounds good and, luckily, compares well to other statistics, so I’m sticking with it.The problem we were trying to solve, however, was when someone wants to buy a gift but doesn’t because they don’t know how to get it to the recipient (i.e., there is shopping cart abandonment). Stats will show you that shoppers abandon carts something like 60 percent of the time, and one of the top reasons, though not the top reason, is because checkout is too complex. Figuring we could increase the bottom of the retail funnel by streamlining checkout, we would bring retailers more money.But how does a user know that this feature exists until they reach checkout? And was it a big enough issue? And was it a big enough issue for retailers to focus on it at the expense of focusing on other issues? In retrospect, the answer was no (at the time), but to figure that out we tried a bunch of stuff (that I’ll describe in reverse chronological order because I’m feeling acrobatic…)After one of the first times I presented Tigerbow at an event, someone walked up to me and suggested I reach out to Amazon for an integration opportunity. It was at this point that I became retroactively mortified for every piece of “advice” I ever delivered to former banking clients and investments. Really? I should think about partnering with Amazon? Well, gee, why didn’t I think about making that call? Grr.Of course we thought the best course of action would be to integrate our technology (a double blind set of databases matching a virtual address with a physical address using a key that only we knew) into merchant checkout. First thing to learn: merchants do NOT screw with checkout. This is how they make their money, people. No matter how good your clever plan sounds to help them increase the bottom of the funnel and generate more revenue, they are extremely reluctant to reconfigure any onscreen real estate, let alone implement a new technology or order flow. This one was pretty obvious in retrospect, but you’d be surprised how many companies believe they’ve got a solution for solving a checkout problem that retailers are dying to implement. There’s a reason you only see credit card, Paypal and maybe a few other checkout options from extremely powerful companies like Google and Amazon. And even they have had significant trouble penetrating here.Second point on this (and a corollary): retailers are way more focused on the top of the funnel (getting traffic to their site) than the bottom. They know their conversion metrics, and there are simple, well-known and inexpensive ways to increase the top of the funnel (e.g., affiliate deals). So we knew we would have to prove our value-add elsewhere before approaching big retailers.Partnering with Dating Sites (and the unfortunate discovery of the “freenis.”)We had already built a rudimentary (Atari 2600-looking, and not in a good way) online store that I’ll talk more about in a bit. We hustled and got some decent press (including my favorite, a headline from Mashable: “Big Idea or Just Creepy?”) so we had some people visiting the store and buying books and flowers and such. I’ll spare the details of how we figured this out, but we noticed that we were seeing some Tigerbow gifting via Second Life. (Remember them? They still exist – swear.) Aha – seemed like a natural fit to integrate our platform into dating sites so that guys could entice dates by sending real flowers rather than some pixels. (Not something I would do, but I also wouldn’t wear a freenis – I promise I’ll explain the freenis soon.) We had some (very) limited success integrating our platform into some dating sites such as Passions Network, a collection of 100+ niche dating sites, including what I believe was the largest Native American dating site as well as a niche community for (and I swear I’m not making this up) lesbian amputees, but the harsh reality was that gaining incremental revenue from or enhancing the user experience with real gifts wasn’t compelling enough for most online dating sites to make any meaningful changes to their properties. They could more easily use that real estate for additional advertising or other engagement opportunities.So we determined the only way we could truly present our unique value proposition was to build out our own store, which we did… before we learned the definition of a freenis. Without further ado, here is that story:On April 18, 2009, I received an email from my co-founder titled: “dude [Second Life] is weird.” We both knew Second Life was weird, so for him to feel compelled to elaborate on this was alarming. His email directed me to this guide for getting started on Second Life. The guide includes 30+ things every newbie should know, including this gem:“One for the guys: don’t bug every female you see for sex. Especially don’t attach your ‘freenis’ (freebie penis) and run around everywhere. You WILL get laughed at.”Freenis. Now you know.My co-founder started the company by building a very basic online store that allowed people to send books as gifts with only an email address. You picked a book, entered an email address and a message, and your recipient would receive a message asking them if they wanted to receive or reject the gift. If it was rejected, the transaction unwound (no harm no foul), and if the gift were accepted the recipient would enter shipping details (which were kept private from the sender), and the gift would arrive.We started with books because they make decent/easy gifts for any occasion, they’re relatively inexpensive, there are drop shippers like Ingram that will allow you to integrate and fulfill orders easily and, well, it worked out pretty well for Amazon as a starting point.Books worked out OK for us, too. In fact, the only hitch I recall was when I was testing sending a book to my then girlfriend (now wife – bless her heart). I selected a book that would make her laugh when it showed up (recipients didn’t necessarily know what they were receiving). The book showed up, and the test was a success (seemingly). It wasn’t until we were at dinner with my co-founder and his then girlfriend (now wife) when my brave soulmate asked me what on Earth she would do with the children’s bible I sent her. Evidently she didn’t think that book was that funny. And neither did I because I sent her a book of lesbian erotica. When we realized that the gift note that accompanied her children’s bible was from an aunt to a nephew we were very curious to see the reaction on the little boy’s face when he got his collection of lesbian erotic stories. Can anyone say world’s greatest aunt? (True story.)We added flowers because they’re one of the most obvious gift categories (and matched nicely with our dating partnership strategy) and because we found a drop shipper called Grower Flowers that was willing and eager to have us integrate our platform. Evidently they had tried something similar with Plenty of Fish a while back. And evidently we and they weren’t the only ones to try this real gifting thing. Jared Polis, who founded Bluemountain.com and ProFlowers – both of which sold for a bajillion dollars – before he became a congressman, started FrogMagic, which did essentially the same thing as Tigerbow. Who knew.It became clear pretty quickly, though, that we would need to build a full-fledged online gift store if we wanted to prove our value proposition. That would require a full catalog (which we tried to sneak by via adding things we could do ourselves like greeting cards and affiliate deals with select retailers that we could fulfill manually), a spectacular user experience and prolific marketing (all of which required lots of money, expertise and resources that we didn’t have). And still, it would be extremely difficult to convey to people that they could utilize our key feature (yes, feature) – the ability to send a gift to someone’s email address.Start a company with a simple idea. But also remember that you absolutely must have a simple, clear and effective way to build early traction and demonstrate your value proposition to derisk your project for potential investors. Otherwise, it’s like running around everywhere with your freenis attached – you might not get laughed at, but you will fail.David Levy is an Entrepreneur-in-Residence for Comcast Ventures and the founder of Tigerbow and Philo. He is also an advisor for various startups, including Admitted.ly and eduClipper, as well as a venture partner with the Entrepreneurs Roundtable Accelerator.\n\nAlleyWatch is the destination for startup news; opinions and reviews; investment and product information; events experienced, seen, heard and overheard here in New York.\n\nPROUDLY MADE FOR NYC · LEGAL· PRIVACY POLICY· TERMS OF USE\n\nWhat is “Warrant Coverage” in a Convertible Note Financing"}