{"title":"why the world's best photo startup is going out of business","favicon":"https://cdn0.vox-cdn.com/images/verge/favicon.vc44a54f.ico","description":"One day last month, the seven employees of Everpix gathered at their co-working space in San Francisco to discuss the company's impending shutdown. Wayne Fan, one of the co-founders, opened a...","lang":"en","canonicalLink":"http://www.theverge.com/2013/11/5/5039216/everpix-life-and-death-inside-the-worlds-best-photo-startup","tags":[],"image":"https://cdn0.vox-cdn.com/thumbor/WUTq62oCfb8iMD7Mg3yO7FC7j4k=/0x95:1020x669/1600x900/cdn0.vox-cdn.com/assets/3469607/IMG_4752.jpg","videos":[{"src":"//www.googletagmanager.com/ns.html?id=GTM-5XTZVB","height":"0","width":"0"}],"text":"Out of the picture: why the world's best photo startup is going out of business\n\nEverpix was great. This is how it died.\n\nOne day last month, the seven employees of Everpix gathered at their co-working space in San Francisco to discuss the company's impending shutdown. Wayne Fan, one of the co-founders, opened a mock-up of the screen that the photo storage service’s customers would see once the company announced the news. The screen described the refunds that would be offered to the company's 6,800 paid subscribers, assuming Everpix could come up with the money. No one knew if they would.\n\nThe immediate concern in the room was a forthcoming bill from Amazon Web Services, which hosts the 400 million photos stored with Everpix; the team estimated the bill would be about $35,000. \"Our AWS bill is going to be due on the third. We’re not going to be able to pay,\" said Pierre-Olivier Latour, who had the idea for Everpix four years ago after a vacation left him struggling to organize the hundreds of photos he took on the trip. Behind him, a poster advertised San Francisco's minimum wage of $10.55 an hour, which he had been paying his employees for the past month. \"Amazon is going to reach out to us saying, 'Your card doesn’t work.'\" He paused. \"So that’s going to be fun.\"\n\nIn two short years, Everpix has gone from a dream shared by two French graphics experts to one of the world's best solutions for managing a large library of photos. It attracted 55,000 users and earned enough each month to cover the cost of the service, if not employees' salaries.\n\nBut while its talented team obsessed over the look and features of its product, user growth failed to keep pace. Starting in June, Latour tried to raise $5 million to give Everpix more time to become profitable. When those efforts faltered, he began pursuing an acquisition. Everpix had tentatively agreed last month to be acquired by Path, according to a source close to the social network. But Path's executive team killed the deal at the last minute, leaving Everpix adrift.\n\nWith the service's remaining lifespan now measured in days, Latour scrambled to find a home for the product and his team. He worked on one potential deal for a so-called acqui-hire, in which the team would stay together at a new company while the product shut down; and another for a true acquisition, in which Everpix's core technology would live on in some form. He also tried to negotiate a last-minute, product-saving infusion of cash from an investor who loved the product.\n\nThe question in the room was whether any of it would come in time. The bills were starting to come due, and there was no money to pay them. Silicon Valley prides itself on being a place where great ideas win, and yet here was an excellent product teetering on the edge of oblivion.  \"It feels like we're going 100mph into the brick wall,\" Fan said. \"And we're still picking up speed. But we don't know if the wall is going to be there.\"\n\nSection TOC Title\n\nEverpix began as the brainchild of Latour, a 34-year-old French entrepreneur who sold his first company to Apple in 2003. That company, PixelShox Studio, made motion-graphics software that was later renamed Quartz Composer. It became a key part of OS X, powering the operating system's screen savers and iTunes visualizations, among other applications.\n\nAt Apple Latour met Kevin Quennesson, a fellow French computer scientist who joined Apple in 2006 and became the project lead for Quartz Composer. Quennesson's background is in math and physics; his name is listed on six patents related to motion graphics, image processing, and graphical user interfaces.\n\n“The more photos he took, the less likely he was ever to look at any one of them ever again.”\n\nBy 2009 both men had left Apple and were working at Cooliris, which makes photo viewing software. Latour set up an office for Cooliris in Japan, and after spending some time traveling through Asia with his girlfriend, he became frustrated with how difficult it was to store and organize all the photos he was taking. He discussed an early idea for a product with Quennesson, who was interested in using math and science to create better photo software.\n\nQuennesson had noted that the more photos he took, the less likely he was ever to look at any one of them ever again. \"People take more and more photos, but paradoxically, they become more and more disconnected from them,\" he said last month in a conference room at their co-working space. \"You don’t want to go back to this whole life that you’ve captured, which is counterintuitive. It's the most important thing — it’s your life! So there’s this obvious problem.\"\n\nIn August 2011, Latour incorporated under the name 33cube Inc. so they could refine his prototypes. In June, after searching for designers on the portfolio site Dribbble, they came across Wayne Fan, who worked at a San Francisco firm doing interaction and visual design. Fan, too, felt frustrated by photo software, and they brought him on as a co-founder. \"We give consumers these tools like iPhoto or Aperture or Lightroom, which are basically artifacts of this bygone era,\" Fan said. \"Why would anyone need to rate a vacation photo from one to five stars, or flag them? Or have a histogram with levels? That’s crazy.\"\n\nTo give the team a deadline, Latour entered the startup competition at TechCrunch Disrupt. They spent the next few months building a prototype of their service, which they were now calling Everpix. Many of its most distinctive features were in place from the start. The service seamlessly found and uploaded photos from your desktop and from online services, then organized them using algorithms to highlight the best ones.\n\nThe software was fast, the design was clean, and the service was simple to use. \"The best part about Everpix may be its 'set it and forget it' nature,\" TechCrunch noted at the time. \"After the one-time installation and configuration, there’s nothing else you have to do.\" To the team's surprise, Everpix became a finalist at the competition. (They lost the $50,000 first prize to Shaker, a bizarre kind of Second Life-meets-Facebook social network that raised $15 million and hasn't been heard from in a year.)\n\nEverpix had gotten started with small investments from former Apple executive Bertrand Serlet and 500 Startups, the incubator run by former PayPal executive Dave McClure. In the wake of Disrupt it raised money from investors including Index Ventures, Strive Capital, and Picasa co-founder Michael Herf, for a total of $1.8 million. \"The use case was incredibly compelling,\" said Nuno Gonçalves Pedro, managing director at Strive. \"The product really looked very robust. And finally, we really liked the team.\"\n\nEverpix had acquisition discussions after Disrupt with Facebook and Dropbox, among others, but waved them all away: the founders wanted to create this service on their own terms. They spent the next six months building their product in a public beta before releasing what they considered to be the true Everpix 1.0 this March. A free option let you see all your photos from the past year, or longer if you connected your desktop computer to the Everpix iOS app. For $4.99 a month or $49 a year, the service would let you store an infinite amount of photos. A feature called Flashbacks sent users daily emails of their photos from the same day in prior years, which led to a huge spike in the number of users who returned to Everpix daily. Critics raved. But it had taken the company longer to get there than investors would have liked. “At that point, it had been one and a half years since we started,” Latour said. “Which is a huge amount of time for a startup to have a full-featured product.”\n\nWhile the team obsessed about perfecting the service, the founders paid less attention to the subject investors care about most: growth. Everpix built some features for sharing photos, but there was little else in the product to help it spread to other people. At one point, the team considered requiring a user's friends to create an account to download any photos that the user shared with them. It was a surefire way to boost signups — but also felt like the sort of ugly, needy design choice that the team prided itself on avoiding. The idea died.\n\nAnd so at a time when successful photo apps were attracting users by the millions, by March the company had attracted fewer than 19,000 signups. Everpix had spent almost nothing to advertise the service, not that it could have afforded to pay for much. The company had spent almost all of its $1.8 million building the service.\n\nAs May approached, Everpix was going broke.\n\nSection TOC Title\n\nIn one of the last breaks Everpix would ever get, Index Ventures agreed to loan the company $500,000 in the hopes that it would float the team until they could complete a proper fundraising round. (500 Startups contributed another $50,000 as well.) Latour hired a marketing specialist, Julie Supan, who previously had helped YouTube and Dropbox position themselves in the market. Together they came up with a tagline for the service: “solving the photo mess.” With a re-written pitch deck on his laptop, Latour set about trying to raise money.\n\nSource: Everpix profit and loss statement. All expenses not included.\n\nGiven his connections at Apple and the investors he had already attracted, Latour had no trouble persuading Silicon Valley's top venture capital firms to take a meeting with him. His goal: a series A round, in which Everpix would trade equity in the company for $5 million in cash. The money would support the team as they worked to build their subscription business and become profitable.\n\nUnfortunately for Everpix, they went out to raise money in the midst of what has become known as “the series A crunch.” The number of initial (or \"seed\") investments has increased dramatically in the past few years, while series A investments have plateaued. Many investors remain willing to write a $100,000 check to see if a startup becomes an overnight success. But when it comes time to write a $1 million check, or a $5 million check, they have become much more selective.\n\nThe sheer explosion of apps, and the ease with which consumers can switch between them, has spooked the investment community. \"Investors have stepped back a little bit,\" says Gonçalves Pedro, of Strive Capital. \"They see this as a dramatic increase in risk.\"\n\nIn meetings on Sand Hill Road, Latour says, nearly everyone expressed enthusiasm for Everpix's product. But one by one, they turned him down. After two meetings with one well-known firm, a partner sent Latour an email. \"You guys seem to be a spectacularly talented team and some informal reference checking confirmed that, but everyone here is hung up on the concern over being able to build a >$100M revenue subscription business in photos in this age of free photo tools.\" Said a partner at another firm: \"The reaction was positive for you as a team but weak in terms of whether a $B business could be built.\"\n\nMeanwhile Index, which had led the seed investment and provided the $500,000 loan, declined to lead the series A round, signaling a loss of confidence in the company that surely resonated among other investors. \"While the product was clearly superb and had a very small but very loyal following, we were not comfortable enough with the other aspects of the business to kick up our level of investment,\" said Neil Rimer, a partner at Index.\n\nWith fundraising efforts hitting a dead end, Latour turned to the idea of an acquisition. Non-disclosure agreements prevent him from talking about the discussions. But the tech giants that once sought Everpix were no longer interested, for a variety of reasons. And when Everpix finally reached a tentative deal with Path last month, it collapsed before the final paperwork could be signed. The social network, which has had fundraising problems of its own, laid off 20 percent of its staff a few days later. Path declined to comment.\n\nLatour continued to seek new investments and to court potential acquirers. In the meantime, his employees set about the grim work of dismantling their product. They agreed to work for minimum wage in the hopes some deal would be struck. \"I haven't given up on the product yet,\" said George Leontiev, the company's 25-year-old iOS developer, last month. \"Maybe someone will come along and see that and help us do what we want to do.\"\n\nBut as time ran out, hopes diminished. \"It succeeded in every possible way,\" said Jason Eberle, who built the web version of Everpix, \"except for the only way that matters.\"\n\nSection TOC Title\n\nThe founders acknowledge they made mistakes along the way. They spent too much time on the product and not enough time on growth and distribution. The first pitch deck they put together for investors was mediocre. They began marketing too late. They failed to effectively position themselves against giants like Apple and Google, who offer fairly robust — and mostly free — Everpix alternatives. And while the product wasn't particularly difficult to use, it did have a learning curve and required a commitment to entrust an unknown startup with your life's memories — a hard sell that Everpix never got around to making much easier.\n\nRimer put it a bit differently: \"Having a great product is not the only thing that ultimately makes a company successful.\"\n\nOn the other hand, they created a product that people genuinely love. The iOS app has a 4.5 star average rating, out of more than 1,000 reviews. About half of free users return every week, and more than 60 percent return each month. And 12.4 percent of free users wound up subscribing to the service, compared with a rate of about 6 percent for Evernote, which also sells its service on a freemium basis.\n\nHe wanted to let the users of Everpix know: “We tried.”\n\nBack at the Everpix office, the team focused on how to shut down in the gentlest way possible. They hoped that at the very least, they would be able to refund their customers' money and allow them to download their data. \"We’ve made a commitment to people,\" said Sameer Sundresh, the company's back-end engineer, wearing a pained expression on his face.\n\nMeanwhile, someone had to write the shutdown letter. The task fell to Fan. He was struggling with the words, but knew what he hoped to get across. He wanted to let the users of Everpix know: “We tried.”\n\nSection TOC Title\n\nIn the final hours of the company’s life, Latour’s efforts to keep the team together unraveled. The acqui-hire fell apart when the potential acqui-hirer decided it didn’t want the entire team. The investor who loved the service made a tentative offer to float the company for another month, but Everpix’s employees worried that would only prolong the inevitable. Meanwhile, Index and Strive pushed back against the offer, as it reduced their stakes in the company to nearly nothing.  And so Everpix is in the process of selling off its technology in order to cover the costs of ending the service. The team estimates it will cost roughly $200,000 to refund Everpix’s customers, allow them to download their data, and pay employees their full salaries. None of users’ photos or personal data will be transferred as part of any sale.\n\nEverpix team at lunch after packing up their office\n\nOn Thursday, the team packed up their office in SoMa. Today, they will post their shutdown notice from borrowed office space elsewhere in the city. One or two employees will continue to maintain the service through the end of the month.\n\nIn time, Latour hopes, the lessons of Everpix will become more clear to him. Where had it all gone wrong, exactly? Maybe there was something obvious that everyone had missed. Maybe it was ahead of its time. Maybe not. In any case, Latour said, he would be fine. “You look at all the problems that we’ve had, and it’s still nothing,” he said. “I have more respect for someone who starts a restaurant and puts their life savings into it than what I’ve done. We’re still lucky. We’re in an environment that has a pretty good safety net, in Silicon Valley.”\n\nAfter they packed up their office, the team went out for lunch. Over beers, they discussed a man who had tweeted at Everpix that day asking them to add some navigational arrows to a section of the web app. “How hard can it be?” the man asked. How hard can it be? Latour read the tweet with deep amusement. Everpix itself had once been that naïve. But not anymore. Latour stood up to take a picture of his team. In the photo, everyone is laughing.\n\nIf you currently have a username with \"@\" in it, please email support@voxmedia.com.\n\nYes, I would like to receive a daily newsletter from The Verge and occasional dedicated newsletters from sponsors and/or partners.\n\nIf you signed up using a 3rd party account like Facebook or Twitter, please login with it instead.\n\nWe'll email it to you.\n\nIf you signed up using a 3rd party account like Facebook or Twitter, please login with it instead.\n\nIf you signed up using a 3rd party account like Facebook or Twitter, please login with it instead.\n\nTry another email?\n\nIf you signed up using a 3rd party account like Facebook or Twitter, please login with it instead.\n\nTry another email?\n\nBy becoming a registered user, you are also agreeing to our\n\nTerms and confirming that\n\nyou have read our Privacy Policy.\n\nChoose an available username to complete sign up.\n\nIn order to provide our users with a better overall experience, we ask for more information from Facebook when using it to login so that we can learn more about our audience and provide you with the best possible experience. We do not store specific user data and the sharing of it is not required to login with Facebook."}