{"title":"The little startup that couldn’t (a postmortem of MyFavorites)","favicon":"http://www.stevepoland.com/wp-content/uploads/2014/03/avatar-steve-favicon.png","lang":"en","canonicalLink":"http://www.stevepoland.com/the-little-startup-that-couldnt-a-postmortem-of-myfavorites/","tags":[],"image":null,"videos":[{"src":"http://www.youtube.com/embed/WM1RChZk1EU?rel=0","height":"390","width":"640"}],"text":"Tweet\n\nI’m officially putting MyFavorites behind me. The problem I was trying to solve, isn’t one of those problems you think you have… and I think those types of solutions/startups are a bit tougher. I already outlined my own problems with running a startup in a prior post about MyFavorites (“Repeat after me, I will not do another startup as a non-technical founder unless…“).\n\nI’m writing this post with the intentions of telling you about the idea, sharing the debates that occurred with how the app should operate and be used, share mockups with you, share documents/spreadsheets of tasks/bugs/features/timelines, and simply give a glimpse into this failure. It was a failure because I called quits on it — I ultimately couldn’t keep funding it myself and the team was losing interest in working on this app that I kept going back-and-forth on how the user experience should play out — when we hadn’t even had any users using it yet.\n\nMy initial pitch for MyFavorites was “Show + Tell Your Favorites”. That pitch eventually became: “The Like button for everything.” Nick came up with that one and it was solid gold — would have made a great TechCrunch post title… we discussed possibly using it as our tagline, knowing it might be controversial and Facebook might sue — but any press is good press  We weren’t going to do that though. [Quick shout-out to Buffalo-native Chris Sacca, whose portfolio list has a one-liner that sums up every single company. If you can’t do that for your startup, then you’re likely too broad and not simple enough. Remember, if you can’t explain your solution to your Mom so she can understand it, then most people won’t understand it and they especially can’t explain it to their friends]\n\nThe problem we tried to solve — wouldn’t it be great to know the favorite books of your friends (and celebs), so you know what book you should be buying to read this weekend? Facebook has interests, but have you ever updated those since you signed up for Facebook? Wouldn’t it be great to know your friend’s favorite … anythings? You’d be looking at a feed of just favorites — blog posts, beers, sneakers, drinks at Starbucks, things to do in Baltimore, apps for iPhone, tree cutting services locally, meals at a restaurant, etc.\n\nWouldn’t it be cool to see all of Ashton’s favorites? Or Britney Spears, or any celebrity?\n\nWe were tackling the “interest graph”. You can find lots of my notes and findings at the MyFavorites blog.\n\nI’ll tell you my grandiose billion-dollar idea for MyFavorites — imagine 50k people that took pictures of themselves with their love for Starbucks (or any brand). Sure, Starbucks currently can show a Facebook widget that shows profile pics of their Facebook fans… but imagine just replacing their homepage with 50,000 people showing their absolute love for Starbucks? That’d be amazing — Starbucks doesn’t even need to say anything about their products, because here’s people that vouch for us. Imagine Gary Vaynerchuk when selling his next book to just show tons of pictures of people with his last book, showing creatively how much they love garyvee?\n\nWith all of these pictures, a new ad network could be created — per the one I wrote about back in 2007 (“Ads with Personal Endorsements“) — this is the future, there’s no doubt about that. The problem is how do you get people to take pics of themselves with brands/products that they absolutely love and personally vouch for?\n\nIn the feed, our plan was to always have a #dickbar at the top of the screen. That would be asking the user for their favorites. At first, these would all be some default categories that we ask everyone, but as the user gets friends and follows people, anytime those users are asking people for favorites in a category, that user’s profile pic and name would show in the #dickbar with category they want favorites for. Meanwhile, there’d be sponsored favorite questions — such as, if you favorited Doritos, then Doritos could ask you “What’s your favorite Doritos flavor?”, or if you favorited Starbucks, it could be asked “What’s your favorite drink at Starbucks?”, etc. It just keeps going and going. [Here’s a spreadsheet of some more sub-question examples]\n\nAs a user favorites something, there would be sub-questions to those categories. If you favorited ‘NFL’, then we could ask the question, “What’s your favorite NFL team?”. The plan was to allow multiple favorites for any category, for every user… so that everytime you were drinking a beer you loved, we wanted you to whip out your phone and favorite it. Then you’d have a ranking of your favorite beers — with # of times you favorited each one. You’d also be able to see the favorite beer tally of all your friends combined, or individually… so then you would know the most popular beer amongst your friends. With us knowing where you live and where you’re favoriting this stuff, we could also figure out the most popular ANYTHING in every city — that’s powerful. We could basically show a map of the world and show Gibson vs Fender and which guitar brand is the leader in every city, every state, and every country.\n\nI used 99designs. I know that basically every designer out there loathes this service and anyone that uses it, but I beg to differ. If you’re awesome, you aren’t going to be replaced by 99designs. I think it’s a great opportunity for college kids and international designers that don’t have access to design work. It’s a great platform for learning as a designer — understanding a client’s needs/requirements/vision and trying to design for that. The designer gets feedback from not only the client, but other designers — and can see feedback on other designer’s work by the client [and others]. As a designer you need to go into knowing you’re basically paying for education — you pay by doing work for free and likely not going to get paid for that work. You go to school and pay for that education. Education and experience costs money and time. 99designs is disruptive and I understand the controversy. Various designers in the world will continue using it and so will various people — but it’s not going to become the defacto for the entire design world.\n\nWith the MyFavorites logo, I wanted something that could eventually be placed on blog posts like the Twitter ‘tweet’ button and the Facebook ‘like’ button.\n\nWe went back and forth on this so many times I can’t count them all. Granted, I was the one changing my mind a lot. We initially started with a sentence strategy — you would say “My Favorite beer is Duvel” — so basically “My Favorite (category) is (item)”. The problem you run into is pluralization — is vs are. I can’t even speak to all the issues with this, but our language is a mess   [Here’s a screenshot of an old sentence structure process for our app]\n\nThe other problem with the sentence structure is that it seems a bit lengthy. We all went to SXSW 2011 and were almost ready to launch the app (this was after weeks of tons of late nights trying to cram this app to be ready) … and then we all saw Pete Cashmore’s interview of Dennis Crowley … where Dens talks about making the checkin process as easy as possible.. and I realized we needed to simplify our favoriting process. Nick had mentioned many weeks prior that we should start the process by showing like 10 default categories, with the ability for user to choose ‘other’ and input their own category. This would help guide our users and make the process slicker. So that was our final strategy on this focal UX point of the app.\n\nWe also originally allowed the user to input multiple categories for a favorite — this seemed to like it would make the user have to “think” too much. We found ourselves wondering what categories/tags to use.\n\nOur other strategy was to focus on the ability for users to add tips to Foursquare. Initially we thought that when someone favorites something, they’d be able to checkin at Foursquare, post it to Twitter and Facebook. That doesn’t really make sense though — I use the Foursquare app — I opened that as soon as I walk into a venue — that’s when I think to use that app. The idea with MyFavorites is to use it when you are loving something — so likely, you’re already checked-into a Foursquare venue, and so this would be an ability to add more tips into Foursquare…. which hasn’t been done yet. No other apps are focused on getting more tips into Foursquare — and to me, tips are the most valuable aspect of Foursquare.\n\nThe big problem we just never knew how to answer until the app started getting used, was we didn’t know what to give the user after they favorited something. Foursquare gives points, random badges… should MyFavorites being doing game mechanics like this? Leaderboard seemed pertinent to us — but specifically showing the user what other favorites exist in the category they just favorited in — and where their current favorite item ranks in relation to other items they have favorited in that same category (i.e. ‘Pabst Blue Ribbon is your 3rd favorite beer!’). [Here’s an old leaderboard mockup and another one specific to a user] [Here’s a spreadsheet of tons of possible messages we could have delivered to the user after they favorited something]\n\nInitially we were building both an iPhone & Android app (after establishing our dev platform as Titanium Appcelerator), as well as a website where you could favorite things as well. It was all too much. Even with Titanium’s ability to “write once, and push out an iPhone and Android app” — that’s false; it takes a lot of work to manipulate features for iPhone and Android — there’s no scroll wheel function in Android; there’s no menu button on iPhone as there is on Android.\n\nHaving a web app being created at the same time was ridiculous too — especially since we still hadn’t nailed down the favoriting process or tried it with any users. I was blowing cash — at a ridiculous pace. I had 7 guys working on this thing at once, as we were hustling for SXSW launch deadline. We decided to focus on the iPhone app, which sucked for me and Dan the backend programmer, because we both couldn’t even use the app — we both have Droid X phones.\n\nFocus on one platform. Get it out there — let people use it — nail down the UX with user input.\n\nI looked at Twitter, Facebook and Foursquare — then wrote a post called the “Metrics of me, me, me!” — basically the conscious and subconscious interactions/metrics we make with these services. I also blogged about the “usage psychology” of those services to better understand how we could hook MyFavorites users. Our social interactions were the following:\n\n* ‘me too’ [trying to get users to add more favorites easier]\n\n* ‘reply’ [ability for users to reply to someone’s favorite with their own favorite — i.e. your favorite car is a Nissan Altima, well mine is a Mattel. We found a lot of humor came from this action]\n\n* ask for favorites [ability for user to ask friends for their favorites in a category — i.e. if I were going to Ireland for vacation, what are things to do there?] [users would simply ‘reply’ with their favorite]\n\nEventually we wanted to open an API that allowed you to have favorites auto-imported — such as Twitter favorites, who uses that feature on Twitter anyway? Our site would give you a reason to use favoriting on Twitter. For YouTube, we’d auto-import stuff you favorite in there. Lots of apps out there have a like or favorite ability, and it seems like an opportunity exists for aggregating all of that.\n\nThese obviously took tons of hours of our lives nailing these. We looked at lots of apps for help/ideas.\n\nThis was up for serious debate all the time. Basically, I wanted this. I wanted to be able to ask my friends what their favorite things to do in Ireland were. Or Hawaii, where I’m going for my honeymoon. Or I am looking for someone to take down this tree in my backyard — Yelp sucks in Buffalo, so how can I find a friend that can recommend a tree cutting service? So the ‘where’ was a big issue — I didn’t want just a ‘tree cutting service’, I wanted a ‘tree cutting service in Buffalo, NY, USA’. So we had this ‘Where?’ optional field, which then would either take a Foursquare venue, or you could select a city or country from a DB we had. It was a complete mess — it was confusing to users [especially when we had this on the Favoriting process] — and the rest of my team didn’t think we needed this functionality at all anyhow.\n\nFavorite page on web — we ultimately decided to do the Instagram thing, which was have a non-interactive website initially and simply have a webpage for every favorite that occurs by users, so that these could be shared. I think this minimal design was great and we planned to build out feed/category/profile pages on the web this way too:\n\nSearch / Discovery – nearby and everywhere. By the people you follow, or everyone. Too many options and thus too cluttered IMO:\n\n* Sharing to Facebook and Twitter and Foursquare — get new users! Here’s a spreadsheet of all the possible copy (tweets, etc) that could have been used.\n\n* URL examples of our website as a spreadsheet (more ideas of our future plans).\n\n* Here is a spreadsheet of our final team push towards a launch. These were the remaining features to finish and some hours estimates on completing them.\n\n* Here is a monster feature / task list, which clearly was just out of control. I didn’t know how to tame my beastly instincts for “we could do this, and this, and this, and..”\n\n* Here is a list of common categories that most people would likely add favorites for.\n\n* Here is a monster list of bugs and features (different from above) — you’ll see more ideas of our plans here.\n\nMeanwhile at SXSW is when I first learned that Kevin Rose was gathering some troops (including Daniel Burka, whose design work I have been following for years in awe) to create Milk Inc., which was going to be an incubator of app ideas. One of those app ideas that possibly was going to be their focus (OINK), was dabbling in similar territory of MyFavorites. We had about 6 months on them, but still — that’s some competition.\n\nI still want to use an app like MyFavorites — and I hope OINK can nail it. Ultimately, I wasn’t the guy to push this idea through. Being a non-technical founder, I just can’t throw money at this thing in the hopes of nailing it. I believe we were definitely at a point where we could have raised some funding around SXSW timeframe — we had the team, the focus, and an app that was working … but ultimately when we came back from SXSW, we all started losing interest, the team was all wondering where this was eventually going, and I was wondering if I even wanted to run a startup, have investors, have the responsibility of employees and answering to a board of investors, etc.\n\nMoving forward I’m looking to help the OINK guys or anyone working on this problem in any way I can. There’s a solid 6 months of problems, solutions, strategy, userflow, monetization, and everything else under the sun… that went down. And there’s still a massive opportunity out there to nail.\n\n* Want to read more of my startup failures? Read here\n\n* Want to read the 100+ web startup ideas I’ve written about? Read here\n\nIn closing, I’ll leave you with some Jay-Z that pretty much sums my future up…"}