{"title":"Startup Post-mortem: Keep Fit Stay Sane","favicon":"http://www.startupnews.com.au/cntnt/uploads/2014/06/favicon1.ico","description":"Keep Fit Stay Sane was a startup looking at mental/emotional health and fitness, with the aim of preventing depression/anxiety disorders.","keywords":" perth, startup, start-up, start up, news, interviews, opinions, events.","lang":"en","canonicalLink":"http://www.startupnews.com.au/2014/10/29/startup-post-mortem-keep-fit-stay-sane/","tags":["failure","Keep Fit Stay Sane","post mortem","startup story"],"image":"http://www.startupnews.com.au/cntnt/uploads/2014/10/keepfitstaysane2.jpg","videos":[],"text":"I first pitched Keep Fit Stay Sane at the 2nd Perth Startup Weekend (March 2013). I had practiced the 1-minute pitch over and over again and had it down perfect, right up until I actually went up on stage, forgot everything and dribbled some crap at the audience. Needless to say I didn’t get a team formed around it, but it stuck in my head as a good idea. The original idea was to create a “gym for depression”, an online site that implemented a few of the psych things I’d learned during my depression, because there wasn’t (and still isn’t) anything out there on the interwebs that actually helps with depression.\n\nAround October 2013 I decided that I should just do this on my own. Within a couple of weeks I had a basic site engine together in Go – it handled logins and templates and storing stuff on the database and everything. Of course, the actual HTML it served looked like crap because I’m a colour-blind code monkey and can’t design for toffee 😉 By January I’d got a slightly better version together with some basic functionality in place, and I officially launched it on January 30th by putting the code live and sending out a link to my friends & family on Facebook (yes, that was it).\n\nMy sister qualified as a counselor around this time, and she helped out a lot with advice on the psych aspects, and I had a volunteer, David Perich, who helped out with the marketing plan (more on that later). Around this time I got more involved with //Startup News, and that example of real growth provided a real contrast to the anemic increase in interest I was seeing. I figured part of the problem is that there’s a huge stigma around mental health and although everyone thought it was a great idea, it was a great idea for someone else, not them. Classic startup fail indicator number 1. So I pivoted the pitch slightly to “emotional fitness” and the need for everyone to maintain a level of emotional fitness, which seemed to go over better. I went through Sam Birmingham’s excellent Pollenizer workshop and refined the pitch down to something people responded to and “got” quickly.\n\nBut taking people through the site showed I still knew nothing about design, and while people got the idea the actual site made no sense to them and looked ugly. Finally around June, Patrick Green finally talked some sense into me and got me to implement a ready-made theme, which worked brilliantly. I applied for the NEIS program to get some basic revenue going while I pushed through, and started getting the actual functionality into shape now I had the landing page sorted (yes, six months in and I’ve just got the landing page sorted!). Around this time I hit the Trough of Despond; realising how much work was involved and how little I knew. Tough times. Then I really hit the wall trying to get the basic site functionality working. After pitching this to the Silicon Beach crowd one night, Marcus Tan really drove this home to me; without a working exercise I really didn’t have a product, and without a product all the rest was just useless scenery. I’d assumed the functionality would be the easy bit, but actually it was really hard.\n\nAround this time my research  showed  that while people got the idea behind emotional fitness once they’d had it explained to them, it was still something that they thought other people needed, not them. And people kept telling me that Employee Assistance Programs (EAPs) really sucked hard and the concepts behind Keep Fit Stay Sane could be applied to that to make a really nice B2B product… if I could get the interface working.\n\nI redoubled my efforts to create a decent interface, but just found that more and more I not only couldn’t actually get something that worked, but didn’t want to deal with it. My focus moved more to //Startup News (at this point only six months old and getting 10K page views!) and I found myself talking about Keep Fit Stay Sane but not actually doing anything with it. This was my indicator that actually I wasn’t interested in creating a B2B EAP enterprise product, and that the project was actually dead and I’d better dispose of it before it stank the place up.\n\n* Typical techie stuff: I got way too attached to the code and spent much too much time building nice RESTful API’s instead of hacking together front-end prototypes out of nastiness and duct tape\n\n* Too slow. It took me a year to work out where the idea would actually work and how. I could have found this out in weeks if I’d been more enthusiastic about engaging customers early.\n\n* Ignored marketing: I had a whole marketing plan written up by David Perich, and didn’t follow through on it. Marketing isn’t my thing, but it needs to happen so I’d better get used to it!\n\n* No email. As David Smit keeps reminding me: I still haven’t send a single email to the mailing list I created and asked people to sign up to.\n\n* Not getting to revenue. I messed about with the business model and pitching and all that. If I’d just focused on getting the product to revenue I would have failed faster and moved on.\n\n* Talked to other people: it took me too long, but I did actually engage with people and customers, listened to them and pivoted the idea.\n\n* I launched early, way before I thought I was ready. It was fine, and if I’d waited longer this would be in the “what I did wrong” section.\n\n* Using the resources available. Although it took me a while, using a template and MailChimp was quicker, better, faster. Yes, I tried rolling my own mailing list server… see “typical techie stuff” above.\n\n* Finding an audience is really important, but having something to show them when you find them is also really important. It’s a tough call whether it’s better to waste time writing code for an audience that may not exist, or finding an audience for a product you can’t build.\n\n* Don’t do this solo. Working with Patrick on //Startup News and comparing that experience with doing it solo for Keep Fit Stay Sane is a revelation. I work better in teams, and trying to do a startup solo is a mistake. I should have had a psychologist and a marketing expert on the team with me for this one.\n\n* If I’m not enthusiastic about it, dig down and find out why. I could have killed this three months ago and been on to the next thing already if I’d just admitted it was dead.\n\n* Focus is important. Doing Keep Fit Stay Sane plus //Startup News plus SNAP plus Startup Weekend plus Rails Girls plus PerthJS plus Just Start IT plus Startup West was probably a stupid idea. I need to learn to say No (or at least Not Yet) to things that I want to do if I’ve got a project on.\n\n* The money trap is real. There was a lot of resistance to killing Keep Fit Stay Sane because the government is paying me (a pittance) to do it through the NEIS program. Although killing it will allow me to go find some decently-paid work, it also does remove a consistent income and that’s scary.\n\n* Taking feedback: I learned how to take feedback impersonally without getting defensive.\n\n* BUILD, measure, learn. Hack together a prototype and then show it to people, instead of seeing if anyone likes the idea first. I work better in code, and I think I’d learn more about the idea from hacking together some code for it and then seeing how people react, rather than finding the audience first.\n\n* Get co-founders first. My first pitches next time will be to potential co-founders who may be interested in the idea. I won’t even think of going near customers without some skilled, trustworthy, committed people beside me.\n\n* Give it a fixed time to get to revenue and pay its way. If it can’t make revenue within a couple of months at most then it’s probably a bad idea.\n\n* Look for some paid work – I’m all out of money and need to rebuild the runway. If anyone needs a failed entrepreneur  for something, email me at mh@marcusholmes.biz\n\n* I normally open-source my failed projects so others can use them, but in this case I’m going to take the core of this project and turn it into my standard tech stack for all new projects. I did some cool things with this one, and I think I can turn it into something flexible yet fast for use on new stuff. A nice little hobby project to keep my hack on\n\nShuttering Keep Fit Stay Sane is hard, because this was my baby, and I’ve really invested a lot in it. But at the same time there’s a huge sense of relief that I won’t have to keep banging my head on this brick wall and can finally move on to something else."}