{"title":"Vitoto Officially Shutting Down","description":"Vitoto was a failure. It feels good to say that. There has been an air of uncertainty around the state of the company for the last few weeks, its nice to","keywords":"apple,business,iphone,start up,startup,technology,technology internet,video","lang":"en","canonicalLink":"http://www.abstract-living.com/why-vitoto-failed/","tags":[],"image":"https://www.process.st/wp-content/uploads/2013/10/ps-logo-light.png","videos":[{"src":"http://www.slideshare.net/slideshow/embed_code/16556106","height":"300","width":"476"}],"text":"It feels good to say that. There has been an air of uncertainty around the state of the company for the last few weeks, its nice to make a decision.\n\nFirstly, I am proud of myself for taking the shot.\n\nI am also proud to have acquired my first startup failure. People in Silicon Valley respect failure, its almost like a badge of honor.\n\nDon’t get me wrong, I would have much preferred a success, and I am really disappointed I was not able to generate a return for my investors, but I definitely left this experience with more than I started with so I’m not complaining.\n\nIf you don’t know, Vitoto was a startup I founded in July, 2012 that set out to create a collaborative video app for the iPhone.\n\nI came up with the idea while I was in Las Terrenes, Dominican Republic – I had been perpetually travelling for the previous 2.5 years while running my internet marketing company.\n\nI quickly raised some seed capital ($50k) and partnered with a Sydney team – Moroku – to build the MVP. After about 4 months of design and development (during which I traveled through the DR, USA, Thailand and Australia) we launched on the Apple App Store and I moved to San Francisco to start the funding gauntlet.\n\n3 months, a plethora of emails, calls, meetups, pitches and half a startup accelerator later we are shutting down the doors.\n\nI want to keep this post as short as possible while both covering off why we are shutting the company down, and some of the key mistakes I believe we (I) made in this process.\n\nThe short answer is: No money.\n\nAnother short answer might be: Good idea, bad business.\n\nBelow is the long:\n\nOne of the key lessons I learned is that great startups have a blindingly obvious, ideally really large and painful problem that the company is trying to solve. Solving this problem should drive almost every decision in the startup.\n\nVitoto did not have this. I mused on this in an earlier post.\n\nI tried to spin up problems that I could use in pitches and conversations like “its difficult for people to create collaborative videos” but I couldn’t even convince myself, let alone anyone else. The problem just wasn’t real enough.\n\nNext time I need a blindingly obvious, clear, defined, large, real problem that is being solved. No exceptions.\n\nI have seen two types of successful startup teams here in Silicon Valley.\n\n1. Young teams who can survive on very minimal cash. These are teams of 2-5 people who have a blend of skills (technical, design, business) and can execute an entire startup between their core team. They are able to stretch $30k to 9 months as they all live in one house, work 15 hours a day, 7 days a week and survive on ramen noodles.\n\n2. Experienced, well funded teams. These are teams that are generally spear headed by an entrepreneur who has had a successful exit in the past. The entrepreneur goes around and recruits a bunch of his or her friends from their 6 figure jobs and convinces them to help create their next vision. Due to their strong track record and the experienced team formed, they are able to raise money before a single line of code is written. The money raised can be anywhere from $250k to $40 million.\n\nBoth team styles have pros and cons, however, these two team structures seem to be the most successful.\n\nThe Vitoto team fell somewhere in the middle. We had a great team, don’t get me wrong, but there were some key elements in the structure that lead to the inevitable demise of Vitoto.\n\nThe two key factors were:\n\n1. We had a team that was too experienced for the budget.\n\n2. We had no invested User Experience/Design specialist.\n\nOur team ran out of runway and could not develop new features into the product. The product was not getting the traction needed nor could we get the viral loop to work, this made the product unappealing to investors. We did not have enough money to support the team in executing the required UX tweaks and experiments, thus were unable to further develop the product to a point where it could get enough traction to attract investors.\n\nOne key element here is that the Australian team was not able to deliver any code without money coming in. They have huge overheads and were unable to contribute time for pure equity.\n\nNext time I make sure I start or am part of a founding team that falls into one of the 2 above success categories.\n\nThe lack of UX focus was another key factor in the  (lack of) success of Vitoto.\n\nThe first element to this was that we had no dedicated UX specialist on the team. We did bring in outside expertise for the graphics design, and while the quality delivered was high, this put further constrain on the budget.\n\nThe second element was that the team never properly sat down and brainstormed the UX. Quick decisions were made to get the MVP out the door and these had serious impacts on how the product was received by customers.\n\nNext time I will make sure that there is extensive planning, brainstorming, and user testing done on the UX of the product before any time or money is invested in actual coding. And I will make sure there is an invested UX specialist on the founding team.\n\nWhen I budgeted my initial capital for the business, I budgeted to get an MVP out the door.\n\nWhile I understood there would need to be a marketing effort for the product, I didn’t take into account the extent of tweaking that would need to be done to the product after the MVP to get it to a point of consistent user uptake. The UX is the most important marketing tool for an early stage startup.  If people are not using your product, it doesn’t matter how well you market it.\n\nI consistently had user feedback to add, remove or enhance features or experience. But continually found myself saying “it’s on the road map but we don’t have enough money to build it”. A position I should have never been in.\n\nNext time I will make sure my initial funding can carry me to TRACTION not just the MVP. Traction (unless you’re super lucky) is going to be a solid 6-12 months AFTER the MVP is released. So I will make sure I have enough to last that long before I dive in.\n\nThis is important, but not as important for consumer focused products. If you are building a consumer app without a clear monetization strategy, just make sure you have the runway as mentioned in point 3. You will either gain traction or you won’t. If you gain traction you can figure out monetization, if you don’t, well, you’re dead in the water anyway.\n\nNext time I am not building a consumer product. B2B with a clear cut monetization strategy and a focus to start monetizing as early as possible.\n\nNobody in the team had built a successful consumer product before. We all had experience in the enterprise space, selling to businesses. We had no experience in consumer of video. We were not playing to our strengths.\n\nNext time I will play in a space I have lived in before.\n\nAs I said at the beginning, this experience has definitely been a positive one. I can’t even begin to describe how much I have learned. It felt like an accelerated university degree. I have gained a TONN of real world experience in the startup world, built a strong network in San Francisco and Silicon Valley and even have my next startup idea locked down.\n\nBut for now, my visa to the US runs out in about a month so I will be leaving.\n\nMy marketing company is still running strong and the focus is going to be on scaling that over the next 12 months.\n\nI am going to do a few stops in the US over the next few weeks, San Diego, Tempe, Pittsburg then I am going to head to Hong Kong to handle some banking and I want to visit my parents and little brother who are currently in Ningbo (a city in China near Shanghai). After that I am planning to move to Jaco in Costa Rica for at least 6 months.\n\nThe words for the year are “Scale and Systems”. Beyond building my business, I also want to focus on getting stronger in the gym, learning to surf properly and learning Spanish.\n\nI am also brewing the idea of doing another sneaky startup, working on team for this one so well see how that goes.\n\nWhat would you have done different?"}