{"title":"Startup lessons learned from my failed startup","description":"Here are the startup lessons learned from Teamometer, a startup with 2 years and about 300 users.","lang":"en","canonicalLink":"http://www.sergioschuler.com/startup-lessons-learned-from-my-failed-startup/?hvid=3EvjLn","tags":["postmortem","Startup","Teamometer"],"image":"http://www.sergioschuler.com/wp-content/uploads/2013/12/7777982086_7e23739606_h.jpg","videos":[{"src":"http://www.reddit.com/static/button/button1.html?width=120&url=http%3A%2F%2Fwww.sergioschuler.com%2Fstartup-lessons-learned-from-my-failed-startup%2F%3Fhvid%3D3EvjLn&title=Startup%20lessons%20learned%20from%20my%20failed%20startup","height":"22","width":"120"}],"text":"Two years ago, on December 2011, I was generating ideas for a business that would help team managers to not suck so much at managing their teams. I came up with this idea because I had some pretty terrible managers in my life. At the same time I worked for about 5 years with leadership development and had some pretty great teams and team experiences. Exactly January 1st 2012 I registered the domain teamometer.com.\n\nI was reading The Lean Startup at that time, which is a great book, but not completely fool proof (here is a fool who got it wrong). I started well: in December I created a very basic idea and rough screens of my team management web tool. In January I built a very basic 2 page website with a video explaining what Teamometer.com did and a “try it free” button, which then lead to a page for inputting the email address to capture leads (since I had no product, that was just a test to see if there was demand). Then I bought a few dollars in Adwords to drive traffic to it.\n\nWhat was good: create a simple and fast website was sweet. The presentation video was pretty good too in my opinion. The Adwords was good to drive traffic too and got a fair share of people who gave me their email address (about 10% of people who clicked the ad).\n\nWhat could be even better: “try it free” and free trials in general are good if you know your product rocks and you will convert the customer. However, when you are testing demand, it is not the best, because it invites people that are only curious, not really thinking of buying. So the best approach would be to put a price page, see who would click that and after capturing the email telling that the product is not ready and they won’t be charged anything just yet. I would probably get fewer prospects, but the people who did subscribe would be serious about the product.\n\nWhere it went wrong: I had all those people who were interested in the product. I judged the product “validated” (WRONG! WRONG! WRONG!) and went on to build it. Looking back, I cannot believe how stupid I was. I had all those people who said they were interested and the obvious next step was NOT building the product, but TALKING to the people who were interested. Asking them things like:\n\n* What were you looking for in Google when you found Teamometer? Why were you looking for it?\n\n* Why is it a problem for you/company?\n\n* How are you trying to solve this problem today?\n\nAfter discovering their needs, going through with them on what is your idea, to get feedback if you are on the right track.\n\nIf I did this, I would have a much better perspective of what people wanted.\n\nWhere it went REALLY wrong: one of the prospects was an HR person from a huge Indian manufacturer. They wanted the system NOW and wanted to speak to me. I had a Skype call with them and what they wanted was clearly not what I was thinking to provide with Teamometer. Instead of surfing the wave and adapting my idea to what a real prospect client was telling me they wanted, I entered “sales mode” and sold them my idea, what it would be, how good it was. How dumb is that? I just needed to build what they wanted.\n\nThe worst part is that I was blind, thinking that this call had validated my product even more, when in fact it was clearly invalidating it.\n\nOnce I believed the idea was validated (it was not), I started to scramble to find a way to make the product. I spoke with tons of developers, but my persuasion skills were not impressive enough. I got none. Then an old friend, which founded a million startups, told me he was interested and he knew a guy who was a developer.\n\nThings moved pretty fast, and in no time we were 4 partners: me, the developer, my old friend (background in finance and marketing) and the brother of the developer (background in marketing). And when I say pretty fast, the whole thing literally happened over a cup of coffee, the first time I met the 2 brothers. I needed a developer, I ended up with a developer and 2 business guys. BUT the 2 business guys were also responsible for financing the project.\n\nThere are so many lessons to be learned from this and so many stupid mistakes.\n\nFounder roles and expectations. Conflict and disagreement arrived early, because expectations of work and founder roles were not agreed upon and everyone had a different idea about their share of the load:\n\n* The developer had no intention of being the project’s developer (?) he was not really a developer, he was a computer science graduate who owned a webdev shop and was used to managing, not coding.\n\n* Everyone but me had other businesses, so time was constantly an issue and deliverables just didn’t happen timely (which is pretty essential for a fast moving startup).\n\n* Since we were 3 business people, we spent all this time into idiot plans, budget forecasts, BUSINESS CARDS, fancy website… all useless things which in the end did not contribute to anything.\n\nThe result of this was that in the end we had to hire a full-time (and paid) developer. So we had zero revenue, 4 co-founders and a paid employee (which was effectively the only one doing real work).\n\nMust I tell you that this was a disaster?\n\nThe first partner left the company a few months in. The 2nd one year after. And finally we ended our run after 2 years of zero paying customers.\n\nLearning: I believe a company is the closest to marriage with kids among parents who (probably) don’t have sex or have any sort of romantic love for each other. If marriage with sex and love is already tough, imagine now without any of those things. I should have been much more careful with who to bring in the company. And, if I was convinced of their value, I should have agreed really really well what was expected from each partner.\n\nBy this time what is really import to hammer through your head is that building the product at this point was a mistake (it was not validated, we needed to speak to prospects). But I made more mistakes which are meaningful:\n\nLiterally 100% of the feedback I got from free trial users was that Teamometer was useful and it helped them discover the issues in their team and tackle them. That was exactly what the tool should do, great! So what is the explanation for exactly 0% conversion rate from free trial to paid customers? Why were we not able to sell it?\n\nSimply put, because we didn’t have a painful enough problem.\n\nIf a company stops invoicing, they will immediately feel the pain. If a company stops managing well their teams, it can take as much as 1 year for people to realize there is something wrong – and they won’t know what is wrong. Maybe some people will leave, but it is easy to put the blame on the employee or the market.\n\nIt is possible to sell soda in the desert (nice to have), but it is much easier to sell water (must have).\n\nMultiply $30 times 1.000 clients times 24 months. WOW, we will be rich!\n\nOh, silly you, you have no idea how hard it is to get 1.000 clients paying anything monthly for 24 months. Here is my advice: get your first client. Then get your first 10. Then get more and more.\n\nUntil you have your first 10 clients, you have proved nothing, only that you can multiply numbers.\n\n…and all the crap about registering company, etc etc etc. While you have no sales (product validation), you should not invest in such gimmicks that only distract from the main goal, which is to find a repeatable business model.\n\nRelated to the above: I wrote a damn article every effing day. It made us jump to the first page of Google in several important keywords. How did that translate to sales? Zero.\n\nSo the lesson is (unless your product is a multi-sided business like Facebook, where users are not paying customers) do not invest time and money to get more traffic. If you do, make sure to TALK to those people, because validating the product is more important than vanity metrics like how many likes you got on Facebook.\n\nIf there is just one thing you should learn, it is: Just speak to prospects and extract their pain, then sell the painkiller (before building the product). If they are willing to buy, do take their money and invest that money into building the product."}