{"title":"Note App Alternatives :: Web Development and Design Blog","description":"Foowebs is a full service web development company based in Wesley Chapel Florida. We specialize in taking the burden of all things web off the shoulders of the small business owner.","keywords":"web, development, design, wesley chapel, florida, dubc, lutz, zephyrhills, new tampa, land o lakes, weddev","lang":"en","tags":[],"image":null,"videos":[],"text":"\"It has been a great pleasure working with Kim Young, owner of Foo Web Development. She is the perfect person to create a website, update a website, or maintain a website for you !!! She is very creative and she has an eye for detail. She has the patience of a saint when it comes to making changes on the website, and she is always prompt when changes are requested. She has a great deal of knowledge about social media advertising and how to maximize search engine optimization. I can not imagine working with anyone else!!\"\n\nCindy Fleming [President, Bay Insurors Corp]\n\n06/11/2014\n\nThis week the cloud based notes app, Springpad, announced that it would be turned off by the end of the month. Due to financial constraints with their business model they are no longer able to stay in service. Here is the message that they are sharing on their website:\n\nAs we announced a few days ago, we are very sorry to let you know that Springpad will be shutting down on June 25th. Unfortunately, we were not able to secure additional funding or scale to become a self-sustaining business. As part of closing our business, a portion of our team is joining Google.\n\nAt this point, our priority is to help you move forward with the data you have stored in Springpad.\n\nToday we are releasing an export tool that gives you a few options including a full Evernote migration, a viewable HTML data backup, and an importable JSON file for other services to use. Read more below about each of these options, or go to springpad.com/savemystuff to start migrating your data now. You will have until June 25th to continue to access your data and complete your migration. At that point Springpad.com will no longer be available, all online and sync features of the mobile apps will stop working, and your personal data will no longer be stored on our servers.\n\nWe understand that this transition may be difficult for many of you, and we will try to help as much as possible. If you have questions or need help, please visit the Springpad Shutdown FAQ.\n\nThank you to our loyal users and partners – We couldn’t have made Springpad what it was without you!\n\nIn light of this news, if you are a Springpad user, then you will want to export your data and find a new tool to organize your notes and tasks. You can use the automated tools on their website but it seems those are overloaded and will take a bit of time to work. Perhaps a manual copy paste situation will be better depending on your situation. In the meantime, we have compiled some alternative Note apps to switch to...\n\nEvernote - since Springpad has created an automated export tool to send all your stuff to evernote, this may be the most obvious choice. In my experience, Evernote really didn't fit the bill but it is one of the most popular Note apps out there, so it may suit you quite well. The parts that I wanted to make use of would cost additional money rather than offering those features for free as Springpad did.\n\nDropbox - while this may not be as fun or GUI-ish, it may work for you depending on your situation. If you already have your files organized in Dropbox, then your notes and tasks may do well organized this way as well in the form of doc or txt files. Since there is an app for every device for Dropbox this may be a good flow for your needs.\n\nNotes Plus - This has long been a favorite of mine for taking notes on my iPad. There is nothing that compares in Notes Plus' capability for organization and ability to use script to text and drawing as well as typing. The only thing that has prevented me from using this on a regular basis is that it did not compare to Springpad in its web GUI ability, and only seemed to backup files to Dropbox rather than be able to edit files anywhere but on an iOS device.\n\nThere are many other options but here are three that will come close to replicating the features of Sprinpad, though not as nicely. Many features that I was using in Springpad, I will now be able to transition to use Pinterest for. Good luck on your post-Springpad days and be sure to get your data out before it is gone.Tags:\n\nAbout The Author\n\nKim Young is Founder, CEO, and a developer at Foo - a web development company based in Wesley Chapel, Florida. She can also be found on Google+. With over 16 years of experience as a web developer, Kim is excited to share with you tidbits that she has picked up along the way. Kim prioritizes continuing education and out of box thinking in order to bring the most valuable solution to Fooweb's clients."}