{"title":"4 Mistakes Made And Lessons Learnt by Vijay of SMSnoodle","favicon":"https://www-techinasiacom.netdna-ssl.com/wp-content/themes/techinasia/img/favicon/favicon.ico","description":"As an entrepreneur, you might have read many tips on starting up, but when it actually comes down to your own startup, you might be tempted to make the same","lang":"en","canonicalLink":"https://www.techinasia.com/4-mistakes-made-and-lessons-learnt-by-vijay-of-smsnoodle/","tags":["Olivescreens"],"image":null,"videos":[],"text":"As an entrepreneur, you might have read many tips on starting up (check out why you should eat your dog food), but when it actually comes down to your own startup, you might be tempted to make the same mistakes you were warned about. Here, founder of failed startup SMSnoodle, Vijay Ganesan, contributes his thoughts on a few of his mistakes made and lessons to be learnt.\n\nSMSnoodle was an outcome of our (my friend Arun and my) stint at iAccelerator2008 camp, which is an Indian Ycombinator version conducted by IIM-A (Indian Institute of Management, Ahmedabad). SMSnoodle is an SMS based entertainment channel for the Singapore region.\n\nThe mistakes we did with SMSnoodle taught us a lot of things that we could have done better. You must have heard most of them before, but you can flush your brain and refill it again.\n\nDiscuss your startup idea not only with friends, but also other people who are strangers to you. I promise that you will definitely learn a lot here. The concept of your idea getting stolen is 99.99% impossible. Visit barcamps, hackerspace, geek terminals and bounce your ideas to different people.\n\nWe failed to do this step and hence overestimated the Singapore market. We found that the Singapore market for such a service turned out to be very small. People are SMS crazy in Singapore, but that does not mean that they were ready to pay for the service.\n\nLooking back I would say this is the most important step which we could have done to save a lot of disappointment later.\n\nHere is another method to valiate your idea. Get a “landing page” for your startup and buy some google ads as well [Google ads worth 75$ is free with most hosting services]. In your landing page request people  to subscribe to your newsletter to get notified on when you would startup. Look at the Click through rate and you would get some good statistics for your startup idea.\n\nHere you can find some examples to design your landing page.\n\nI have been hearing this advice from the time I have been in my mother’s womb. If you are a techie, there is a high chance that you will not follow this piece of advice. In your heart, you are probably not satisfied with any level of development and always want to make further improvements.\n\nIgnore your heart, listen to your brain. If you are a web startup, you can take maximum of 6 months to release your first version (for something like Mint.com). Simpler websites should not take more than 2-3 months. You can always iterate later. Wet your feet ASAP.\n\nFirst try to create a small community of people who would market for you. This number can be small, something around 30-50. This is the core part of your customer base. We made the mistake of targeting everyone in Singapore. I know it sounds very funny.\n\nDefine your target people. Visit your target people often. Buy them a coffee or beer. If they are students, visit their hostels and spend time with them. If your target people are all mothers, visit baby creches. This is not only great to get feedback it would also help you sharpen your service.\n\nNone of us in our team had any experience in marketing. So we tried things like distributing pamplets at MRT stations, spamming forums and requesting bloggers to cover us. None of them was quite effective as social media. Moreover bloggers would generally cover you, if you have already created some buzz through a contest or a presentation.\n\nSocial media is much more powerful than what regular users get to know. Do not get involved in any physical marketing or branding for the first one year. Use social media creatively and you can do wonders to your startup. Look at how Brewerkz have adopted Facebook and Twitter to build their market. It is a beautiful case study to deploy for your own startup.\n\nThis post was originally published here. It has been modified and edited to be republished on SGE.\n\nGuest Author Vijay Ganesan is a Research Engineer at Microfocus, a middleware firm in Singapore. He has previously done two startups, the recent being SMSnoodle, which was developed at iAccelerator2008(IIM-A), an Indian version of Ycombinator. Currently he is working on his idea OliveScreens, after becoming one of the top 10 finalists at The Ultimate StartUp Space contest. He can be found on Facebook and Twitter."}